{"f9f7hs": {"text": "&nbsp;\n\n\n&nbsp;\n\n\n##### All the *R*esearch *C*hemicals I have tested\n\n&nbsp;\n\n&nbsp;\n\n| Name | Rating | Thoughts|\n|:----:|:------:|:-------:|\n|1P-LSD| 8/10   |LSD-25 is cheaper|\n|ALD-52| 8/10   |LSD-25 is cheaper|\n|4-AcO-DMT| 10/10| Will be remembered as legendary whenever it is unavailable|\n|5-MeO-MiPT| 8/10|It absolutely could be used as a substitute for MDMA for a night out|\n|25E-NBOH| 9/10|My hidden treasure :) |\n|2C-E| 10/10| Too many good times spent living in *2C-E*ternity|\n|3C-P| 7/10| Very stimulating but not in equal ratio to its visual effects|\n|DOC| 9/10| A very long and worthwhile experience|\n|DPT| X| Have had trouble effectively smoking this compound|\n|JWH-018| 7/10| I loved making edibles with this compound|\n|5F-ADB| 8/10| Highly potent, probably toxic, infrequent use was fun\n|3-HO-PCP| 7/10| Enjoyable compound, would rather take 3-MeO-PCE|\n|3-MeO-PCE| 8/10| An excellent addition to any trip|\n|DCK| 6/10|Enjoyed my PCP/PCE experiences more|\n|DXM| 10/10| Hear me out, my experiences were with pure powder DXM and every single one has been HIGHLY enjoyable|\n|Clonazolam| 8/10| Good for sleep, highly potent, most people can't avoid abusing this compound|\n|Flualprazolam| 8/10| 2-3x as potent as Alprazolam|\n|GBL| 10/10| I refuse to drink alcohol. GBL is 100% better|\n|2-Methyl-AP-237| 6/10| Toxic to your organs, infrequent use for short term pain management was effective\n|N-Ethylhexedrone|6/10| Most will end up abusing this compound, fun for 2-3 doses|\n|N-Ethylpentedrone| 7/10| More enjoyable than N-Ethylhexedrone|\n|α-PHP| 9/10| I will only ever orally or intranasally administer this compound, one dose a night, good fun at a concert|\n|4F-MPH| 10/10| Amazing compound for productivity| \n|3-FPM| 6/10| Not really my style of stimulant|\n|6-APB| 8/10| A pretty visual empathogen, quite a bit longer then MDMA, very highly enjoyable, it is a worthwhile experience.|\n\n&nbsp;\n\n&nbsp;\n\n##### All the *D*rugs I have tested\n\n&nbsp;\n\n&nbsp;\n\n| Name | Rating | Thoughts|\n|:----:|:------:|:-------:|\n|LSD-25| 10/10| Do you even need me to say anything about this legendary compound?|\n|Mushrooms| 8/10| I would honestly rather take 4-AcO-DMT due to it being easier on my stomach|\n|Ketamine| 7/10| Need to experiment more with this, would rather use a PCP analog for a night out|\n|Fentanyl| 6/10| Great for pain management, I used this under hospital care|\n|Morphine| 7/10| Great for pain management, I used this under hospital care|\n|Oxycodone| 8/10| I feel comfortable using this in a recreational setting|\n|Kratom| 9/10| Sort of nauseous at high doses, very fun for me personally, the downside is taking so many pills to get an effective dose|\n|Hydrocodone| 8/10| Great for migraines and pain management, wouldn't use it recreationally|\n|Baclofen| 10/10| Great little compound to help you sleep after a night out|\n|Adderall| 9/10| I'd describe it was multi-threaded thinking. I would start another test question and while solving it I would figure out the correct answer to a past question.|\n|Ritalin| 9/10| Good compound, would rather take 4F-MPH|\n|Modafinil| 8/10| Migraines and headaches can make you HATE this chemical if you are not smart with it.|\n|MDMA| 9/10| An excellent choice for any night out involving music|\n\n&nbsp;\n\n&nbsp;\n\n\n\n##### Notes\n\n&nbsp;\n\n\n\nI do not have an addictive personality, I have never had any problems stopping the use of a drug or chemical, I have a large amount of self control with substances. \n\n\n&nbsp;\n\nMy experiences may not match your experiences especially with highly addictive and dangerous chemicals like \"α-PHP\" or \"Clonazolam\".\n\n\n&nbsp;\n\nFeel free to ask me any questions about my experiences or ask for advice on their use.\n\n\n&nbsp;\n\n\n&nbsp;", "author": "kingjj", "score": 31, "flair": null, "created": 1582686132.0, "url": "https://www.reddit.com/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/", "num_comments": 67, "title": "My Research Chemical and Drug Review Compilation", "subreddit": "researchchemicals", "comments": {"fir8qo0": {"score": 6, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fir8qo0/", "is_submitter": false, "created": 1582688413.0, "body": "I never had too much trouble stopping a compound either, how did your experience with NEP go? I read that it can be super fiendish and that's the only thing I'm worried about.", "replies": {"firanzs": {"score": 5, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firanzs/", "is_submitter": false, "created": 1582689509.0, "body": "NEP is child's play compared to like a-php/a-pvp", "replies": {"firayw2": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firayw2/", "is_submitter": false, "created": 1582689678.0, "body": "Can you compare NEP to Coke or amphetamine?", "replies": {"firboam": {"score": 5, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firboam/", "is_submitter": false, "created": 1582690084.0, "body": "It's like a better coke but lasts much longer too?\n\n\nNEP isn't bad, but it's nowhere close to true pyros", "replies": {"firbro9": {"score": 3, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firbro9/", "is_submitter": false, "created": 1582690138.0, "body": "That's what I thought, there is no other stimulant that's less fiendish than coke isn't it? Cuz I actually didn't want to consume anything that's more fiendish than coke.", "replies": {"firdty2": {"score": 3, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firdty2/", "is_submitter": false, "created": 1582691293.0, "body": "If you're looking for a rush/ceiling, you're going to run into fiendishness.\n\n\nJust how it works", "replies": {"fireje5": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fireje5/", "is_submitter": false, "created": 1582691679.0, "body": "I'm so confused, the only time I really experienced fiendishness was with nitrous on MDMA (not even nitrous alone) and was originally only looking for a more recreational and shorter lasting substitute for speed and started looking into the RC market and stumbled upon NEP but the constant warnings and talks about people getting on day long binges with this stuff threw me off.\n\n cuz no substance stands between me and my sleep :D the concept of something being so fiendish that you can't stop until it's gone sounds pretty bad but the other effects all sound like the perfect substitute as long as you  a) don't have access to too many redoses or even better b) could control the greed\n\nI've never been a greedy person period but I'm afraid that this stuff could still make me.", "replies": {"fiscebb": {"score": 5, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fiscebb/", "is_submitter": false, "created": 1582710948.0, "body": "MDMA and Nitrous is the best combination ever. Its mind bending but it gave me DMT like effects and I blasted off to the end of time. I met this entity at the end of time and I asked it to tell me everything about the existence of the Universe. The entity told me a story that felt like it took a 1000 years to tell and right at the end, I said out loud \"that story is insane, no one will ever believe me if I tell them this\". The entity said none of this matters anyway and you will forget everything when you go back to Earth. After that, the nitrous wore off and it had only been about 30 seconds since I first took the nitrous. It felt like I spent a thousand years listening to this entity and was so disappointed that I couldn't remember the story of the Universe when I came back to Earth. All I  can remember is exactly what I wrote in this comment but it was still a very enlightening experience. I've tried MDMA and nitrous a few other times and it has given me more answers about the universe than any other drug I've tried. I felt like I was a thought and an object at the same time, like I was transforming between energy and matter. This is something everyone should try, nitrous is very safe too. Would love to hear your experiences with MDMA and Nitrous", "replies": {"fivnhp8": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fivnhp8/", "is_submitter": false, "created": 1582792752.0, "body": "One time I was doing no2 with my buddy and he told me after every pull I kept telling him i had the best idea ever but i couldn't tell him cause it would ruin it. I remember i kept having epiphanies and it was super trippy, but shortly after the experience, I couldn't remember what any of them were lol. Oh well", "replies": {"fiw6mq6": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fiw6mq6/", "is_submitter": false, "created": 1582805290.0, "body": "Exactly what happened to me too. I kept getting my mind blown every time I took the no2, kept saying I figured everything out and it turned into a joke in the end because after every hit I took, I would remember that I was going to forget everything and then I realised I kept forgetting everything because the information I was receiving was meant to be kept a secret as I was unable to speak out loud the ideas I was getting. Eventually I managed to pull some information out, writing down things as well but I don't know if I remembered this 'secret'. I figured out that I was merely a thought travelling through still frames of reality and that time was created by travelling through these still frames one by one like a digital video. It looks like a lag effect. Every frame of reality exists at once in the Universe; past, present and future. The Universe is like a finshed film and time is the illusion of movement created by travelling through these still frames of the film one by one, from start to finish. I also figured out that our conscious is nothing but a chain of thoughts and memories, a chain of moments of reality. Every thought connects with a unique reality or dimension. Our thoughts mirrors our environment and we are moulded by the thoughts and moments we remember. We can change who we are by changing our thoughts and memories. I had contradictory thoughts all the time too. I remember being a thought and the environment at the same time, kinda like the quantum cat theory, I felt like I was alive and dead at the same time as well. I eventually realised that everything in the Universe exists on a spectrum and that the world isn't black or white. We are a mix of two opposites which means I could be 90% alive and 10% dead and that makes me healthy and energetic or I could be 60% alive and 40% dead which makes me sick and have no energy. Gender is mixed too and defined by masculine and feminine energies. I could be 80% masculine and 20% feminine which makes me a man or I could be 45% masculine and 55% feminine which makes me a tomboy. 90% feminine and 10% masculine would likely make me a girly girl. We are all a mix of light and dark energy, good and bad, yin and yang. The spectrum theory really helps me understand why the world works the way it does. One other thing I remember as well is that I felt like I had no control over the thoughts I was having, it felt like my mind was mirroring the environment and it was the environment that was in control of my thoughts. For example, if I wanted to take another hit of the No2, it was the energy of the No2 itself that gave me the thoughts to huff it. If I wanted to eat a burger for dinner, it was the collective energy of the burger that gave me the thoughts to want to eat one. It's like all matter has a purpose and we get thoughts based on the environments energy and purpose. This has led me to start to believing that everything in the Universe is consciousness and I'm now experimenting with the idea that the conscious environment controls the everyday thoughts that you have. MDMA and No2 together is truly a powerful experience and I've always had mind blowing trips every time. Who knows what I'll find out next, what do you think of the information I got out of this mix?\nI've never had experiences this mind blowing before.", "replies": {"fiyec40": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fiyec40/", "is_submitter": false, "created": 1582866568.0, "body": "Consciousness is energy and the universe is an ocean of energy. Everything that exists was already here in some form, just constantly changing. Some things change fast and some things take forever, but time is relative. I enjoy the information you got out of your experience. I've felt this way for a long time now. My epiphanies were basically about an ending for a book I will one day write that will hopefully be able to explain these profound through the story I'll come up with. Wish I could remember those endings cause they seemed super clever at the time lol.", "replies": {}}}}}}}}}}}}}}}}}}}}, "firgzrf": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firgzrf/", "is_submitter": true, "created": 1582693018.0, "body": "I am probably not the best person to ask about the fiendishness of a chemical but with NEP I usually do 2-3 bumps for a night out. \n\nI still semi-occasionally partake in it for social outings with friends. I have had no innate desire to consume it outside of social outings or have had thoughts about taking it randomly throughout my day to day.", "replies": {"firhjo9": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firhjo9/", "is_submitter": false, "created": 1582693318.0, "body": "That's reassuring to hear. My top law also was to never take any drugs on my own and I've held to that my entire life except my very lowest points no matter the substance. \nI guess I'll order a minimal amount, and keep it at a friend's house just to be safe.", "replies": {"firhw5a": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firhw5a/", "is_submitter": true, "created": 1582693510.0, "body": "I think the danger is that people keep taking more to achieve some 'high' that maybe isn't even reachable with the chemical if that makes sense. Best of luck man.", "replies": {}}, "firv6r6": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firv6r6/", "is_submitter": false, "created": 1582700620.0, "body": "This is a great rule to follow. I used to follow this for alcohol, and then broke it.  Now alcohol is ruined for me, because I see it as something to relieve stress and not to just go out and socialize.  Don't even like it anymore actually because it just puts me to sleep.\n\nI don't think you really need to follow this rule for something like psychedelics though, since the urge to do it again doesn't have the same character, and there is benefit to experiencing them alone.", "replies": {"firvdht": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firvdht/", "is_submitter": false, "created": 1582700717.0, "body": "Yup Psychs are probably the only exception but even there I feel uncomfortable doing them alone. I must have at least a sitter in the next room.", "replies": {"firvyn9": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firvyn9/", "is_submitter": false, "created": 1582701016.0, "body": "probably the best option to be safe if you have the sitters.  I just have nobody who is interested in psychs to join me!", "replies": {}}}}}}}}}}}}, "firu6hr": {"score": 4, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firu6hr/", "is_submitter": false, "created": 1582700096.0, "body": "What's your preferred dose for 25E-NBOH?", "replies": {"firyj91": {"score": 4, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firyj91/", "is_submitter": true, "created": 1582702536.0, "body": "1.3mg is the standard dose for a single tab of it. 2.6mg to 4mg is my usual dosing.", "replies": {}}}}, "firas82": {"score": 3, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firas82/", "is_submitter": false, "created": 1582689575.0, "body": "Lmao the one chemical that's currently relevant to me is an \"X\"\n\nWhat's that mean? Straight trash? Didn't try it enough? So much better than anything else it doesn't fit on the scale?", "replies": {"firfw9w": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firfw9w/", "is_submitter": true, "created": 1582692422.0, "body": "I just haven't been able to properly 'blast off' with it, I have tried many ways to freebase it and even tried smoking the salt I have of it. \n\nThe salt was very putrid and caustic to the airways. I want to try it either rectally or nasally but I know the drip is terrible.\n\nI have tried 5-6 different ways to freebase it and none were proper well. I even have pictures of all my processes as I was planning on making a proper how-to guide on the process of freebasing it for the subreddit.", "replies": {"firhipc": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firhipc/", "is_submitter": false, "created": 1582693304.0, "body": "I just used the baking soda tek last time, didn't wash with acetone or anything, it's super easy and seems to work well; biggest issue IMO is finding the correct temp", "replies": {"firhrcp": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firhrcp/", "is_submitter": true, "created": 1582693436.0, "body": "I have been certainly confused as to my results with freebasing it. I think I am properly freebasing it but I need to find a better way to actually smoke it. I have been attempting to use a dab rig but with very limited luck.", "replies": {"firj4z9": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firj4z9/", "is_submitter": false, "created": 1582694176.0, "body": "I've had mixed results with the dab rig, think it's partially the temperature and partially not being able to hold all the vapour for long enough; a few times I've had my vision go mostly white like I'm about to go off but it's just not quite there, but my shipment is on its way so hopefully I'll figure it out", "replies": {"firjpeq": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firjpeq/", "is_submitter": true, "created": 1582694479.0, "body": "If you find a good way to smoke it please do let me know.\n\nThe strangest fucking thing actually was my friend smoked it out of a lightbulb and a lighter (this was the salt also) and he just held it deep as hell cause he's been a smoker for most of his life and believe it or not he blasted off.", "replies": {"firkoqg": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firkoqg/", "is_submitter": false, "created": 1582695009.0, "body": "Was actually thinking some sort of crack pipe or maybe a nectar collector type of thing would work well, or even an actual bucket-banger for the dab rig, currently using titanium and there's just not enough surface area I feel", "replies": {}}, "firksky": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firksky/", "is_submitter": false, "created": 1582695069.0, "body": "But ya, I'll prob try a higher temp with the dab rig and maybe keep the carb half off to allow more airflow, if it doesn't work I guess I'll explore other options", "replies": {}}, "fisa3vj": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisa3vj/", "is_submitter": false, "created": 1582709710.0, "body": "Have you tried making \"the machine\" type of device to smoke it?", "replies": {"fism8y6": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fism8y6/", "is_submitter": true, "created": 1582716505.0, "body": "No, not had the huge drive to go that far yet.\n\nMight revisit smoking the chemical when I find a chunk of free time though.", "replies": {}}}}}}}}}}}}}}}}, "fircye7": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fircye7/", "is_submitter": false, "created": 1582690809.0, "body": "6abp...it what ways is it similar/dissimilar from mdma? Duration? Jw cause mdma/2c-b are my favorite", "replies": {"firg1zc": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firg1zc/", "is_submitter": true, "created": 1582692508.0, "body": "More visual, like I have had traditional psychedelic visuals from it after a long roll. 5-7 hour roll, not instantly flooring like MDMA is. If you like MDMA and 2c-b do definitely try it while it is available, also try 5-meo-mipt.", "replies": {"firg9h3": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firg9h3/", "is_submitter": false, "created": 1582692619.0, "body": "What’s up with 5-Meo-mipt? And I have my market and back up market and back up back up market but nothing legit on a “grey” RC market...", "replies": {"firha5j": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firha5j/", "is_submitter": true, "created": 1582693174.0, "body": "It is more rare then 4-AcO-DMT or other tryptamines but so are most of the 5-MeO-xxxx class. I would say it is absolutely not out of the question to find it on a clearnet website. With some searching I am sure you could find it, It was certainly worth buying in my opinion.", "replies": {"firifag": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firifag/", "is_submitter": false, "created": 1582693795.0, "body": "I’ll look into it. It’s just the sites I’ve found that are “clear” or even “grey” seem to legit as funny as that seems. Hard to pick one to try", "replies": {"fit3gap": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fit3gap/", "is_submitter": false, "created": 1582731631.0, "body": "Look north young man and think logically", "replies": {}}}}}}}}}}}}, "firvph6": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firvph6/", "is_submitter": false, "created": 1582700885.0, "body": "I don't get why I don't get the same reaction from 5-meo-mipt that everybody else seems to get.  I don't see the similarities to MDMA.  Just jittery with some mild confusion and body electricity for a few hours then there was some afterglow, but not MDMA-like in my opinion.  Maybe I just need to take more...", "replies": {"firym2s": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firym2s/", "is_submitter": true, "created": 1582702585.0, "body": "I mean, that's sort of the similarities I was talking about. The stimulation, tactile enhancement, vision enhancement and music appreciation.", "replies": {"firzidh": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firzidh/", "is_submitter": false, "created": 1582703157.0, "body": "The euphoria and empathetic qualities are just not there for me to consider it in the same category as MDMA though.", "replies": {"fisyyqr": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisyyqr/", "is_submitter": false, "created": 1582726580.0, "body": "I feel the same way. I’ve gone up to 18 mg and didn’t enjoy it. No euphoria. Barely any visuals. Not an enjoyable body load. I love euphoria from pyschs and feel like everyone’s description makes it sound fucking great", "replies": {}}}}}}}}, "fisg4f5": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisg4f5/", "is_submitter": false, "created": 1582713002.0, "body": "Interesting to see a 10/10 on baclofen. I got a pretty solid amount recently; I've been interested in it because of my love for phenibut. I've only tried it a few times, and it seems to feel quite nice. How much do you usually take at a time?\n\nHave you tried plain kratom powder? I used capsules at first, but I soon realized it was cheaper and easier to just use powder. I've even come to like the taste.", "replies": {"fit0ap2": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fit0ap2/", "is_submitter": true, "created": 1582727985.0, "body": "I don't measure out my doses consistently but I take less then 10mg to sleep on a sober night and maybe 20mg or so for comedowns. I really use it as like a sleep supplement and not a sleep medicine if that makes sense, like a sprinkle of it to help me sleep.\n\nIf you like phenibut look into f-phenibut, it's like a mix between phenibut and baclofen.\n\nI have kratom powder, I make my own capsules. I have tried consuming the powder before and done so quite a bit in the past but for me personally I like the capsules better.", "replies": {"fit1yv5": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fit1yv5/", "is_submitter": false, "created": 1582729875.0, "body": "Cool, yeah I've been testing 12.5 mg baclofen at a time, as I got 25 mg tablets. So I've done F-phenibut before, but I wasn't a big fan of it. It felt too stimulating and made me anxious. Maybe I'd like it if I tried it again; it's been years now.", "replies": {}}}}}}, "fir819f": {"score": 4, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fir819f/", "is_submitter": false, "created": 1582688007.0, "body": "Why go out of 10 when your lowest rating is a 6?", "replies": {"fira7os": {"score": 3, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fira7os/", "is_submitter": false, "created": 1582689251.0, "body": "Not too many drugs are *bad*.\n\n\nI an name a few that'd get a 0/1, depending on what the lowest rating is, but that's only a handful out of my 76", "replies": {}}, "firg9xw": {"score": 3, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firg9xw/", "is_submitter": true, "created": 1582692626.0, "body": "I haven't tried too many I actually HATED, some are not my personal style/I won't probably consume them again but it doesn't mean I did not enjoy my time with them or regret it.\n\nHell even with bad experiences such as LSA (HWBR Seeds) I would try it again, my experience with it was a 10/10 for 2-3 hours and then 8 hours of absolute nausea and stomach cramps. I'd still rate it a 6/10 cause of the absolute blast of fun I had before it turned sour.", "replies": {}}}}, "fira38b": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fira38b/", "is_submitter": false, "created": 1582689182.0, "body": "Oddly enough I agree with these ratings.\n\n\nI wasn't expecting to, but I do recognize your username too\n\n\n25e-nboh squad represent. Sitting on 5g lolol", "replies": {"firfof2": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firfof2/", "is_submitter": true, "created": 1582692302.0, "body": "Real recognize real, I've seen you around a lot as well.\n\n I am sitting on a stupid amount of 25E-NBOH as well :) truly one of my favorite research chemicals.", "replies": {}}, "firvc7i": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firvc7i/", "is_submitter": false, "created": 1582700700.0, "body": "Wow, that will last you a lifetime, will it not?  I just got my first g.  How do you use it from powder, do you make a solution or do you make blotters?  You must take sublingual, correct?", "replies": {"fis3kft": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fis3kft/", "is_submitter": false, "created": 1582705793.0, "body": "I don't try to lay blotter, rather drip out doses", "replies": {"fispzq9": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fispzq9/", "is_submitter": false, "created": 1582719068.0, "body": "What do you make the solution of (eg, what liquid and what strength), and how long does it usually last?  You just hold the liquid under your tongue?", "replies": {"fitg66a": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fitg66a/", "is_submitter": false, "created": 1582747730.0, "body": "I still put it on paper and let it dry. The strength of your solution depends on how many drops you ultimately want to put. 10mg/ml isn't bad though", "replies": {}}}}}}}}}}, "fircmy8": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fircmy8/", "is_submitter": false, "created": 1582690630.0, "body": "Nice review man...opened my eyes to some newbies that I’d like to try...also would love if you threw your “imo” details of the effects...some of them i dont know what “class” they’d be in...", "replies": {"firgozz": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firgozz/", "is_submitter": true, "created": 1582692854.0, "body": "You are right, some of these are probably more unrecognizable then others. \n\n1P-LSD through DPT are all psychedelics. \n\nJWH-018 and 5F-ADB are synthetic cannabinoids.\n\n3-HO-PCP through DXM are dissociatives.\n\nClonazolam through GBL are GABA agonists.\n\n2-Methyl-AP-237 is a opioid.\n\nN-Ethylhexedrone through 3-FPM are stimulants.\n\n6-APB is an empathogen.", "replies": {}}}}, "fis032j": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fis032j/", "is_submitter": false, "created": 1582703525.0, "body": "Which would you think is easier on the mind/body for a night out: NEP or a-PHP?  Easier comedown and less compulsive redosing.", "replies": {"fis0dwy": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fis0dwy/", "is_submitter": true, "created": 1582703721.0, "body": "I think a single dose of A-PHP either orally or intranasally can last an entire night out so I'd probably choose A-PHP but it's much rarer then NEP. The come down from both aren't horrible.", "replies": {"fisrcu1": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisrcu1/", "is_submitter": false, "created": 1582720048.0, "body": "all i can think about when i heard a-php is john mcafee rants on twitter and face eating florida man lol", "replies": {}}}}}}, "fis30uh": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fis30uh/", "is_submitter": false, "created": 1582705445.0, "body": "MDMA  alternatives?", "replies": {"fisretw": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisretw/", "is_submitter": false, "created": 1582720090.0, "body": "6apb, but i've only done mdma  a couple times years ago.  but to me, it felt very similar.", "replies": {}}}}, "fisr5tx": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisr5tx/", "is_submitter": false, "created": 1582719905.0, "body": "6-apb is prob my fav RC so far. would love to research more in the future!", "replies": {}}, "fit579z": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fit579z/", "is_submitter": false, "created": 1582733764.0, "body": "Thank you for your research", "replies": {}}, "fj4uxn2": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fj4uxn2/", "is_submitter": false, "created": 1583046285.0, "body": "Did you feel that the 2MAP was toxic or did you read that somewhere? I'm testing it currently and have been for the past two nights with no side effects or issues.", "replies": {"fj4vn0f": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fj4vn0f/", "is_submitter": true, "created": 1583046768.0, "body": "I felt it was toxic to my intestines/kidneys/liver. Very obviously darkened urine. It is caustic as well.\n\nThere has been quite a good bit of proof of its toxicity at this point other than my own experiences. Infrequent use of it (3x a month) is my advice.", "replies": {"fj4vw97": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fj4vw97/", "is_submitter": false, "created": 1583046945.0, "body": "Damn I thought I did my due diligence and I did see something about it affecting the kidneys but didn't think much of that report.", "replies": {"fj4wx46": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fj4wx46/", "is_submitter": true, "created": 1583047660.0, "body": "As long as one doesn't seek to abuse this chemical frequently or with high dosages it 'appears' to be safe for infrequent use, I personally wouldn't use it more then 3x a month like I said.", "replies": {"fj4x6vu": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fj4x6vu/", "is_submitter": false, "created": 1583047849.0, "body": "Oh ok thanks for the feedback dude", "replies": {}}}}}}}}}}, "firh525": {"score": 0, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firh525/", "is_submitter": false, "created": 1582693097.0, "body": "Yea see I’m good on the stims cause I get 90 adderall script. And I get 60 bars so don’t need the gama. I don’t do opiates Anymore and I’m just still learning Ket good. I think I’ve only done 4-fdck sold as ket and etiz which didn’t impress me I guess cause I get bars. I’ve done dmt, nn dmt, but no 5-Meo-dmt yet...but I’m still interested in something new...the 2c-e you mentioned has my attention but i dont know if I should try c,d,e or i next...oh and I’ll pass on all the syn cabs...lol", "replies": {}}}}, "dtzk54": {"text": "Greetings all! Sorry for format, on mobile. \nFirst, I have to clarify a couple of things. Im currently on Suboxone 8/2 dosage and I stopped taking it 24 hrs before my research. I also got this for pain relief only and not for pleasure, even though this might not seem believable, it's truly the only reason I got it.\n    So I have chronic pain and have been on some sort of pain meds for over 9 years, so I've had them all, and this RC to me reminds me of Oxycodone, alot. Even though im not chasing the feels, it responded almost identical to it in my research. \n    It's caustic, I personally wouldn't take it any other way than oral. I had capsules and they worked alright, but I ended up just tossing and washing since it didn't seem to work as well. \n    As other researchers have stated, it doesn't have any legs really, about an hour for me. And if you have any tolerance at all over moderate, you'll go through it relatively soon. I ended up going through a gram in 6 day's. That's not to say that it's weak, and as always you should be extremely careful with it and have some sort of recovery method with you while taking these RC's! Always practice harm reduction!\n    So I would estimate that I was dosing 125-175mg a day over the course of 5-7 doses. This is with someone a high to very high tolerance, so be careful! For my pain it really wasn't that good, if you're looking for feels, it wasn't that bad.\n    My pain relief search continues! Take and be safe everyone!", "author": "throwawayaway911918", "score": 46, "flair": null, "created": 1573352277.0, "url": "https://www.reddit.com/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/", "num_comments": 47, "title": "My research results for 2-methyl-ap-237", "subreddit": "researchchemicals", "comments": {"f70uw31": {"score": 8, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70uw31/", "is_submitter": false, "created": 1573361573.0, "body": "Just want to give a tip, I heard you can increase Buprenorphines metabolism to Norbuprenorphine with Saint Johns Wart. It's a more potent painkiller apparently.\n\nAnd agree on 2-methyl-ap-237", "replies": {"f70wrkr": {"score": 5, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70wrkr/", "is_submitter": true, "created": 1573362303.0, "body": "Really?! I'll look into it. My only worry is that if I remember correctly, people with pre existing heart problems shouldn't take it, have you heard of that? Had a mild heart attack in June of 2016.", "replies": {"f70y2ky": {"score": 3, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70y2ky/", "is_submitter": false, "created": 1573362634.0, "body": "I haven't, sorry", "replies": {"f70ymok": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70ymok/", "is_submitter": true, "created": 1573362874.0, "body": "I'll do some reading, thanks again for the heads up.", "replies": {"f71c9af": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71c9af/", "is_submitter": false, "created": 1573367802.0, "body": "[removed]", "replies": {"f71ckix": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71ckix/", "is_submitter": true, "created": 1573367957.0, "body": "Not yet, im planning on ordering some soon. I've heard it last longer, which is what I want. I just hope it helps better for my pain.", "replies": {"f71dr13": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71dr13/", "is_submitter": false, "created": 1573368598.0, "body": "[removed]", "replies": {"f71fgyn": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71fgyn/", "is_submitter": true, "created": 1573369737.0, "body": "I know it's based off of tram, and that's it's in essence the metabolite of tram after it's processed in the liver, but does it have the same side effects as tram, ie. seizures?", "replies": {"f71l7rt": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71l7rt/", "is_submitter": false, "created": 1573372078.0, "body": "[removed]", "replies": {"f71mhbh": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71mhbh/", "is_submitter": true, "created": 1573372592.0, "body": "Good to know, thanks!", "replies": {"f72yzr9": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f72yzr9/", "is_submitter": false, "created": 1573413799.0, "body": "afaik one enantiomer is still capable of NE reuptake inhibition. so its less likely but i wouldn't completely rule out the possibility for seizures", "replies": {}}}}}}}}}}}}}}}}}}}}}}, "f705ojs": {"score": 7, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f705ojs/", "is_submitter": false, "created": 1573353472.0, "body": "I somewhat agree. My research showed that a solid dose for me was about 35mg oral. No legs and lasts 1 hour or so with a quick come up of about 15 mins.\n\nI used it as pre workout for a while lol (dont ask why) and it worked like a charm. If compulsive redosing can be avoided this chem can be taken a few times a week without side effects. It feels to me that half life is extremely short.", "replies": {"f707i5j": {"score": 4, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f707i5j/", "is_submitter": false, "created": 1573354068.0, "body": "Why?", "replies": {"f70bqtv": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70bqtv/", "is_submitter": false, "created": 1573355424.0, "body": "Why what?", "replies": {"f70egzh": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70egzh/", "is_submitter": false, "created": 1573356331.0, "body": "Why/how do you use it as a pre workout?", "replies": {"f70eyd9": {"score": 7, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70eyd9/", "is_submitter": false, "created": 1573356423.0, "body": "Take it right before u start your workout. It gives you a ton of motivation and energy.", "replies": {"f70f94r": {"score": 3, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70f94r/", "is_submitter": false, "created": 1573356553.0, "body": "Wouldn’t the downer side of opiates counter act that though? But i can see were youre coming from", "replies": {"f70hbd6": {"score": 9, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70hbd6/", "is_submitter": false, "created": 1573357206.0, "body": "Opiods can give you a significant energy boost. Much cleaner than uppers and without the shitty come down", "replies": {"f70j8lr": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70j8lr/", "is_submitter": false, "created": 1573357807.0, "body": "I don’t have much experience with them. But that does sound nice! I imagine this is in below nod doses right?", "replies": {"f70l780": {"score": 10, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70l780/", "is_submitter": false, "created": 1573358441.0, "body": "I’m not an opiate user, but I remember a while back when I broke my ankle and was prescribed Vicodin of which I would naturally take 2-3x the dose to get high. Most of the time I would get the typical downery, nodding opiate high, but sometimes paradoxically I’d get a bunch of energy to clean my house. Kratom, I take red/green Bali, has the same effect, sometimes I’m falling asleep/nodding, sometimes I get clean, natural feeling energy and motivation. It’s weird.", "replies": {"f70ykh5": {"score": 6, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70ykh5/", "is_submitter": true, "created": 1573362848.0, "body": "From the understanding I've acquired over the years on opiates, most semi synthetic opiates such as oxycodone, hydrocodone, oxymorphone, etc, are made using the alkaloid thebaine, which is a stimulant based opiate. Now that doesn't necessarily mean that everyone will have an energy boost, but explains why people do get that side effect when taking those pharms.", "replies": {"f714beg": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f714beg/", "is_submitter": false, "created": 1573364843.0, "body": "The thebaine is actually a pretty negative alkaloid. It is common in pods, and I fucking despise it.", "replies": {"f7171xq": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f7171xq/", "is_submitter": true, "created": 1573365883.0, "body": "Agreed, I self meditated with PST for a couple of years and the inability to control quality and dosage caused severe anxiety issues, most likely from the fluctuating thebaine amounts. Got etiz for my anxiety for a couple of months and OD'd from the combination in July. Hence why im now on Suboxone. But as soon as I stopped the seeds, my anxiety disappeared.", "replies": {"f717zl4": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f717zl4/", "is_submitter": false, "created": 1573366203.0, "body": "I actually always avoid talking about tea. During my 4 years using it I quit alcohol and all other substances. Yet now.. without tea, I am back to being a polysubstance addict. \n\nRan a discord server with hundreds of folks and helped many people. Always wanted to avoid wrong information. However, I quit it last year and use methadone now.\n\nI've lost all my friends... it seems like moving to methadone made me boring. \n\nEnded up giving the server away, nearly killed myself due to the depression and anxiety. No one seems to miss me,  so I guess it hurts me to know that I was only liked as a source of info. Never hid things. Helped many people. \n\nSuboxone is not my thing, but its great it worked out for you.", "replies": {"f71menr": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71menr/", "is_submitter": false, "created": 1573372561.0, "body": "were your friends using? If so its only natural they would disappear after you got on methadone.", "replies": {"f71omfx": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71omfx/", "is_submitter": false, "created": 1573373483.0, "body": "Nah, most of my friends did not know I did drugs... I was more honest when I went on methadone \nNo one knew I did drugs for the last 8 years. Most friends simply smoked weed and drank alcohol.\n\nSo many people think worse of me for getting clean and going on maintenance. \n\nPretending I didn't do drugs and being more functional made people like me.. \n\nIt kills me, man. My docs are the only people proud of me. My own mom is telling me to go back to heroin", "replies": {"f71wye4": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71wye4/", "is_submitter": true, "created": 1573378603.0, "body": "That's pretty fucked up that your mom is telling you to get back on heroin! That's why I used the initials, don't want people knowing what it is, let them figure it out. I was \"saved\" by PST when I first started it, pain management doc cut all his patients off, disappeared and left us hanging with our 1 month supply. Couple days before I ran out, looked up \"legal\" pain relief and found out about it. Worked great for a  year and a half, but started causing my issues. I'm really only glad about 2 things from not taking it, severe anxiety and $1400 a month cost. That's to bad about your friends treating like that, shitty situation. Take care brother!", "replies": {"f725g4q": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f725g4q/", "is_submitter": false, "created": 1573382682.0, "body": "Sadly that acronym is too obvious. I suggest calling it tea only.", "replies": {}}}}}}}}}}}}}}}}}}, "f70kpm2": {"score": 3, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70kpm2/", "is_submitter": false, "created": 1573358303.0, "body": "Yes", "replies": {}}}}, "f71dxr5": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71dxr5/", "is_submitter": false, "created": 1573368703.0, "body": "I used to love to pop 15-20 milligrams of oxycodone and go for a run. My body was in really great shape, but my cardio was fairly crappy. The meds really allowed me to set a time or distance goal and meet that goal without feeling like I was going to keel over.", "replies": {"f71nnef": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71nnef/", "is_submitter": true, "created": 1573373075.0, "body": "That's what I loved about oxycodone, it took away my pain and gave me the energy to get stuff done. I liked morphine the best for pain relief, but mellowed me to much.", "replies": {}}}}}}}}, "f70o0pz": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70o0pz/", "is_submitter": false, "created": 1573359363.0, "body": "My freind used to do that with percs but that blunts protein synthesis and muscle buidling so much its dumb as shit to workout on. Unless you're on anti cortisol and or anabolics that's a nice uphill battle lol", "replies": {"f70ptvq": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70ptvq/", "is_submitter": false, "created": 1573359979.0, "body": "I dont workout to build muscle mass. I do it to feel good. I dont do heavy weights usually high reps light weight, yoga and basketball.", "replies": {}}}}}}}}, "f70e8w2": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70e8w2/", "is_submitter": false, "created": 1573356257.0, "body": "[deleted]", "replies": {"f70kong": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70kong/", "is_submitter": false, "created": 1573358291.0, "body": "It feels that way", "replies": {}}}}}}}}, "f70uv6r": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70uv6r/", "is_submitter": false, "created": 1573361562.0, "body": "No legs?", "replies": {"f70wz73": {"score": 3, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70wz73/", "is_submitter": true, "created": 1573362393.0, "body": "Length of duration.", "replies": {}}}}, "f71j1rw": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f71j1rw/", "is_submitter": false, "created": 1573371209.0, "body": "Sounds similar to tianeptine.", "replies": {}}}}, "f708457": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f708457/", "is_submitter": false, "created": 1573354301.0, "body": "Have you tried O-DSMT?", "replies": {"f70gwg6": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70gwg6/", "is_submitter": false, "created": 1573357052.0, "body": "He has a high tolerance supposedly. doubt it would work.", "replies": {"f75dqdg": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f75dqdg/", "is_submitter": false, "created": 1573442903.0, "body": "O-DSMT will work with a high tolerance as it's a straight agonist, you just need to use more. Tramadol is a pro-drug, which is what gives it the ceiling dosage issues.", "replies": {"f785m2q": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f785m2q/", "is_submitter": false, "created": 1573514626.0, "body": "I know this but I can take a couple grams of the stuff and not notice anything. Its like codeine. Ungodly amounts might do something but it's not practical and honestly not safe as it could be toxic in these incredibly Supratherapeutic doses that have never been tested or reached with tramadol therapy.", "replies": {}}}}}}, "f70x6md": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f70x6md/", "is_submitter": true, "created": 1573362477.0, "body": "I have not yet. If the other person is correct about the strength, I'd have to take quite a bit. But I have contemplated getting it.", "replies": {}}}}, "f723pj9": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f723pj9/", "is_submitter": false, "created": 1573381853.0, "body": "This always seemed like a disappointment compared to what I was hoping. I hadn’t researched it but it doesn’t look to worthwhile with the reports. It’d be cool with something to come up that was on par with morphine all the way around. Not to weak or strong, good legs, good effects. But as of now, I’d probably have to put that in my pipe and smoke it.", "replies": {}}, "f7n5qcx": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f7n5qcx/", "is_submitter": false, "created": 1573914218.0, "body": "I have nearly zero tolerance (F, 90lbs) and took this stuff orally (apple sauce, don’t laugh, I’m inexperienced)... I also have no milligram scale... I eyeballed an amount on a plastic spoon (maybe 15mg?) and scooped out some apple sauce to get it all down. \n\nIt came on pretty damn fast, and I’m not prone to placebo (the opposite really, no depressants/benzos work for me). I just felt sleepy, like my whole body was slowly shutting down to sleep. \n\nMy problem is that it makes me VERY nauseous but only the next day(s)... I took it at night. The next morning I had this weird episode of high blood pressure (170-180/100-105) with a pulse of 30bpm. Has this happened to anyone?\n\nCan someone give me an indication on what 20mg looks like in this powdered form?", "replies": {"f7nm99q": {"score": 3, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f7nm99q/", "is_submitter": true, "created": 1573939013.0, "body": "First and foremost you need to practice harm reduction! Never take while you're alone and also have narcan with you! If you don't have a scale, don't just eyeball it!\n\nNow when I received mine it came as 1 gram(1000mgs) I also didn't have a scale,  so I divided it into 10's then divided one of the 10's into ten, so this should have been roughly 10 mg. \nI have a very high tolerance, so for me to get any effect, I needed at least 30 mg a dose. With no tolerance, 10mg would be more than enough! \nIf you're heart rate was 30 beats per minute, you had way to much! This is what roughly 10 mg looks like. https://imgur.com/a/1dVbhVy\nNow this is just salt in a O size capsule. Without a scale this could easily be 15-30 mg.", "replies": {"f7ozad1": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f7ozad1/", "is_submitter": false, "created": 1573966924.0, "body": "Thank you for your help, you’re absolutely right about the harm reduction. I’ve been hesitant to go to a pharmacy to ask for one but I may suck it up and do it. From the picture you sent (very useful, there’s no one in my life I can really ask), I would guess I’d take 10-12mg, but a few weeks ago I may have taken 10 + 10. Bad idea... Thanks for your help, there’s not much info about this RC and as someone inexperienced like me, not many places I can go to ask.\n\nEdited to add: I take this because it knocks me out good and fast, my tolerance for benzos is through the roof and my psych obviously has a short leash on me, I get one week’s supply at a time... \n\nOne question: generally are opiates dosed based on bodyweight?", "replies": {"f7p0af0": {"score": 2, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f7p0af0/", "is_submitter": true, "created": 1573967658.0, "body": "Go to the pharmacy and say your boyfriend/girlfriend is a user and want to make sure their safe. Im assuming you're over 18? So it shouldn't be an issue. Just understand that it's only useful if you're still conscious to take it! I'd rather you still had someone present though. Please be careful! Cheers!", "replies": {"f7p142m": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f7p142m/", "is_submitter": false, "created": 1573968259.0, "body": "Thanks, that’s a good idea...I was worried they’d put it in my file... I really appreciate your help and concern, thanks!", "replies": {}}}}}}}}}}, "f7wx1f2": {"score": 1, "link": "/r/researchchemicals/comments/dtzk54/my_research_results_for_2methylap237/f7wx1f2/", "is_submitter": false, "created": 1574069173.0, "body": "So just curious, anything else to report with this rc? Is this RC unpopular or just new since there’s very little written about it... \n\nI’ve since reduced my « dose » to 10mg (but with 2mg clonaz) and feel nothing... I’ve only taken this maybe a total of 3-4 times and only once a week or so... And zero opiates of any kind previously! \n\nAll those times, after the nausea subsided I felt high and more social (ie normal, not as depressed) than usual for a couple of days. But I had a discussion about this « method » of antidepressant with another person on reddit and agree it’s not recommended to use it that way. Not a terrible way to lose weight though, unless you cannot afford to. If nausea is a pretty common reaction and from other posts I read it almost seems like an accepted reality of using, is weight loss and/or being underweight common for regular users (therapeutic or not)?", "replies": {}}}}, "f0lh9v": {"text": "So I came across an interesting tidbit of information while reading about the metabolism of Glutethimide (Doriden) and apparently it has an active metabolite that's said to be equipotent to the parent drug called 4-Hydroxyglutethimide and I was thinking this would definitely be a viable RC as Glutethimide is considered a holy grail of the GABAergic sedative family much like some of the other well known nonbarbiturate sedatives like Methaqualone, Methyprylon, Ethchlorvynol, and Ethinamate. And some more nonbarbiturate sedatives would be nice to have as the Methaqulone analogues were shown some love and we've seen a few of them and some were nice but expanding the class of nonbarbiturate sedative RCs would be lovely especially for those who prefer sedatives like these instead of benzos.\n\nI hope it retains the parent compound's ability to be a strong CYP2D6 enzyme inducer so people can re-live the \"Dors and 4s\" combo thus making Tramadol, Codeine, Hydrocodone, Dihydrocodeine, and Oxycodone much more viable or possibly cause people to OD if they do something ridiculous like take an 80 milligram or 120 milligram Oxycontin with it for example. Or taking a 60 milligram, 80 milligram, 100 milligram, or even a 120 milligram Hysingla ER with it or like taking a 50 milligram Zohydro ER with it.\n\nNevertheless i'd be pretty excited to see this come to the market.\n\n&#x200B;\n\n[http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.882.648&rep=rep1&type=pdf](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.882.648&rep=rep1&type=pdf)\n\n[https://imgur.com/KzTse](https://imgur.com/KzTseCV)CV", "author": "pretty_boy_flizzy", "score": 11, "flair": null, "created": 1581159215.0, "url": "https://www.reddit.com/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/", "num_comments": 42, "title": "4-Hydroxyglutethimide aka 4-HO-Glutethimide", "subreddit": "researchchemicals", "comments": {"fgye94t": {"score": 5, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgye94t/", "is_submitter": false, "created": 1581211228.0, "body": "Doriden has always been a drug I’ve wanted to try. It’s unique enzyme inducing effects are also supposedly so strong that they can make codeine turn into morphine so fast that it’s closer to heroin than codeine itself.. this plus the euphoria that comes with combining certain barb-like drugs with opioids (such as soma and hydrocodone) creates an intense euphoria. I’d love to try it.", "replies": {"fh06zhq": {"score": 2, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh06zhq/", "is_submitter": true, "created": 1581229793.0, "body": "Same, some Glutethimide analogues are long overdue. I believe 4-HO-Glutethimide was once considered to be made into an anticonvulsant although I can't find that source... I seriously need to bookmark my sources more often. -.-\n\n4-HO-Glutethimide was also said to be equal to or twice as strong as Glutethimide in the rodent brain according to this source.\n\n[http://www.inchem.org/documents/pims/pharm/pim246.htm#SectionTitle:4.2%20%20Therapeutic%20dosage](http://www.inchem.org/documents/pims/pharm/pim246.htm#SectionTitle:4.2%20%20Therapeutic%20dosage)\n\n&#x200B;\n\nAccording to this source these 2 other Glutethimide analogues known as 4-Amino-2-ethyl-2-phenylglutarimide and 4-hydroxy-2-ethyl-2-phenylglutaconimide were said to possess the greatest activity compared to the parent drug but alas i'm not sure if they have enzyme inducing properties or not.\n\n[https://www.researchgate.net/publication/22003639\\_Synthesis\\_of\\_an\\_active\\_hydroxylated\\_glutethimide\\_metabolite\\_and\\_some\\_related\\_analogs\\_with\\_sedative-hypnotic\\_and\\_anticonvulsant\\_properties](https://www.researchgate.net/publication/22003639_Synthesis_of_an_active_hydroxylated_glutethimide_metabolite_and_some_related_analogs_with_sedative-hypnotic_and_anticonvulsant_properties)\n\nThis is the chemical structure of 4-Amino-2-ethyl-2-phenylglutarimide\n\n[https://imgur.com/a/BLKs1uT](https://imgur.com/a/BLKs1uT)\n\nAnd this is the chemical structure of 4-hydroxy-2-ethyl-2-phenylglutaconimide\n\n[https://imgur.com/a/A9Kvyam](https://imgur.com/a/A9Kvyam)", "replies": {}}, "fh0d5la": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh0d5la/", "is_submitter": false, "created": 1581231399.0, "body": "What you're talking about is Dors and 4's which I think was a big drug trend in the early 80s. With that kind of downer/codeine potentiation, you'd probably have the same effect taking fioricet/codeine which is a combo drug still prescribed I think. I was prescribed hydroxyzine and fioricet and even that combination completely knocked me on my ass. 100 mg of butalbital and 50 mg of hydroxyzine, to me felt like 5 shots of tequila without the discomfort and and an extra sensation of calm ambiance thrown in.", "replies": {"fh0esor": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh0esor/", "is_submitter": true, "created": 1581231946.0, "body": "First generation antihistamines like Diphenhydramine and Hydroxyzine also potentiate opioids really well so you had 2 other drugs intensifying the Codeine.", "replies": {"fh0qaqy": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh0qaqy/", "is_submitter": false, "created": 1581235219.0, "body": "Potentiators are no joke. The strong effect can really hit you unexpectedly too. Somas are otc in a certain place not too far from me so I might try that out for potentiation next. Gotta tread lightly with mixing CNS depressants though, especially downers with opioids.\n\nEdit: I'm not sure how much different doriden (or doriden analogs) would be from soma or butalbital in potentiating codeine or hydrocodone but I can imagine it would be very similar", "replies": {"fh18xrq": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh18xrq/", "is_submitter": true, "created": 1581240937.0, "body": "Theres a combination called the Las Vegas Cocktail that consists of 100 milligrams of Hydrocodone, 1050 milligrams of Carisoprodol (Soma), and 2 milligrams of Alprazolam (Xanax) that was heavily abused when all those drugs were alot easier to get in the USA. Another variation of that combination involved switching out the Hydrocodone for Oxycodone.", "replies": {"fh1qne0": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh1qne0/", "is_submitter": false, "created": 1581250182.0, "body": "I've heard of it but I wouldn't say that dosage is anywhere near neccessary. I'm sure it would be fatal for people who don't have a massive tolerance.", "replies": {"fh1ysfv": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh1ysfv/", "is_submitter": true, "created": 1581257319.0, "body": "I did it with little tolerance to all those drugs and it got me as messed up as good Heroin. \n\nOf course I've always needed to take 100 milligrams of Hydrocodone if I wanted to get high with no opioid tolerance. That combo and combining Hydrocodone with Glutethimide (Doriden) is the only way I can enjoy that lame ass overrated opioid anyways. 😒\n\nAlso another good first generation antihistamine that potentiates Hydrocodone really well is Chlorpheniramine so I'm told.\n\nI've also heard Hydroxyzine is really good with the synthetic opioids particularly Meperidine/Pethidine and it's analogues/derivatives.\n\nCyclizine is said to be really good with Methadone and it's derivatives as well.", "replies": {}}}}}}}}}}, "fh9phs4": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh9phs4/", "is_submitter": false, "created": 1581415465.0, "body": "I don’t think fioricet with codeine amounts to dors and Fors much at all. The doriden induced codeine metabolism to a large degree which is what made it very euphoric along w the fact that barbs and opiates have a lovely synergy. Ime butalbital isn’t the best to mix with opiates, carisoprodol is much better. If you mix hydrocodone with  carisoprodol on an Emory stomach you may get something similar to dors and fours but even then it may not be as good. Certainly not fioricet w codeine though.", "replies": {"fh9uexa": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh9uexa/", "is_submitter": false, "created": 1581418645.0, "body": "Now I'm intrigued. I was only under the impression that glutethimide wasn't as good as reported to be because of how obscure it is. Most of the old school non-benzo downers are near impossible to find but information about them isn't that obscure.", "replies": {"fh9us6h": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh9us6h/", "is_submitter": false, "created": 1581418890.0, "body": "From what I’ve heard from the many old timers I’ve spoken to dors and fours were one of the most euphoric highs of the 80s, it was called suburban heroin (at the time heroin was confined to inner cities not suburbs like today). This heroin-like rush makes sense since both codeine and heroin do turn into\nMorphine; but the doriden induces the CYP2D6 enzyme which makes much more codeine a much more potent prodrug. It had a huge heroin-like rush that was potentiated by the glutethimide which added the barbiturate effects. Great synergy. One of the ones I wish to try in my lifetime.", "replies": {}}}}}}}}}}, "fguwazi": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fguwazi/", "is_submitter": false, "created": 1581159662.0, "body": ">Glutethimide is considered a holy grail of the GABAergic sedative family\n\nBy whom? You realize that it hasn't been around for decades?\n\n50 year old experience reports are often...not too great. It's not like people back then had that many drugs to compare it to (benzos, ghb etc).", "replies": {"fguwyb7": {"score": 4, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fguwyb7/", "is_submitter": true, "created": 1581160095.0, "body": "Alot of people that know about it consider it up there with Methaqualone and Ethchlorvynol. \n\nGlutethimide was also widely known for it's \"Dors n 4s\" combo where 1000 milligrams of Glutethimide was taken with Codeine specifically Tylenol 4s and was said to produce a strong Heroin like high.\n\nAlso it's still available in Bulgaria as a prescription drug called Glutethimid produced by Balkanpharma.", "replies": {"fgux6y1": {"score": -2, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgux6y1/", "is_submitter": false, "created": 1581160255.0, "body": ">Alot of people that know about it\n\nGlad for those 3 dudes, but I'd want some 1) recent and 2) numerous reviews before being convinced that it's actually good.", "replies": {"fgv08wx": {"score": 3, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgv08wx/", "is_submitter": true, "created": 1581162361.0, "body": "I found a few people that have tried them on this Bluelight thread but they aren't the most detailed trip reports.\n\n[https://www.bluelight.org/xf/threads/glutethimide-any-experiences.638898/](https://www.bluelight.org/xf/threads/glutethimide-any-experiences.638898/) \n\nI made this post just to talk about new potential nonbarbiturate sedative RCs, especially because most of the current nonbarbiturate sedative RCs are Methaqualone analogues and a change would be nice. If you're skeptical of this drug then you can be, I just think this one has potential is all.", "replies": {"fgv2tf8": {"score": -1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgv2tf8/", "is_submitter": false, "created": 1581164339.0, "body": "Those opioid + glutethimide reports are kinda worthless unless you have a death wish. You'd have to compare that to opioids + benzos (also death wish) or opioids + GHB (again, you're kinda dead) for a fair comparison anyway...\n\nSo, first off, you'd have to take that substance in isolation, without anything else in your system, and preferably without a large tolerance to that group of substances so your dosage isn't entirely useless for anyone interested in the substance.", "replies": {"fgz7383": {"score": 2, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgz7383/", "is_submitter": true, "created": 1581220226.0, "body": "While I agree it's indeed a dangerous combination it would most likely be alot more euphoric than combining benzos with opioids because barbiturates and nonbarbiturate sedatives like Carisoprodol (Soma) are alot more physically euphoric than benzos. Read Dr Quaabarbital's comment because he gets it.\n\nPlus on it's own it could be fun due to that physical euphoria unique to these GABAergic sedatives as well as an effective sedative/hypnotic.", "replies": {"fgz8yub": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgz8yub/", "is_submitter": false, "created": 1581220727.0, "body": ">Read Dr Qauubarbital's comment because he gets it.\n\nWith that username, it sounds about as useful as reading retarded DPH lovers comments in /r/DPH :P\n\nN=1 not too useful either way.\n\nDoesn't take a genius to realize that just about everything is more euphoric than benzos, for people without mental illnesses (including anxiety) at least.", "replies": {"fgzun6q": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgzun6q/", "is_submitter": true, "created": 1581226593.0, "body": "Yeah I only find Clonazolam to be a fun benzo, the rest just keep me calm and functional. While stuff like 2M2B, Carisoprodol, and Chloral Hydrate do the same thing but they're physically euphoric at the same time.\n\nI wonder if you don't like this potential RC because of your dislike for Clomethiazole. :P", "replies": {}}}}}}}}}}, "fipij2i": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fipij2i/", "is_submitter": false, "created": 1582636795.0, "body": "I did Dors and 4's many times and they were incredibly euphoric but Doriden is no longer available.  By themselves they were lackluster but the combo was indeed \"Suburban Heroin\"", "replies": {"fipje7w": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fipje7w/", "is_submitter": false, "created": 1582637565.0, "body": "How old are you, 50+?", "replies": {"fj8xt6l": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fj8xt6l/", "is_submitter": false, "created": 1583154077.0, "body": "yes 60 this month. Have to mention that Dors and 4's were fairly lethal.  My first OD was Dors and 4's plus benzo's. Plenty of deaths back then although nothing like the Fentanyl action that we see today...The problem seemed to be that once you had even a slight Dor/4 habit that the amount that you needed for a great buzz and the lethal amount seemed to constrict to a smaller zone. Just a thought that I had a the time and I was pretty strung at the time so take it for what its worth........Felt heavier than Ludes, Different than Tuinal.....closest to strong heroin or perhaps Demorol in feel although its seems that Demorol has disappeared as well", "replies": {}}}}}}}}}}, "fgwudk1": {"score": 4, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgwudk1/", "is_submitter": false, "created": 1581194705.0, "body": "Everyone who like ludes", "replies": {"fgxyevb": {"score": -1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgxyevb/", "is_submitter": false, "created": 1581206558.0, "body": "Also happy for those 3 other dudes. The RC analogues all kinda sucked apparently.", "replies": {}}}}}}, "fgxobc3": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgxobc3/", "is_submitter": false, "created": 1581203750.0, "body": "Yeaaa, i was always interested in old sedatives. Id love to see an analogue of this be sold as an rc. But Id also buy ethchlorvyol distraneurin or secobarb derivatives....", "replies": {"fgy79ly": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgy79ly/", "is_submitter": true, "created": 1581209026.0, "body": "Clomethiazole is already sold as an RC and I've tried it and still have some left. It's sedative effects were ok but it had this nasty histamine release that made your eyes water and your sinuses burn.\n\nAs for Ethchlorvynol the only analogue or relative I can think of that could be sold would be Methylpentynol.\n\nAs for a Seconal analogue I don't think we'll get to see many barbiturate analogues because most countries prohibit any 5,5-disubstituted derivative of barbituric acid so that's why there's never been any barbiturate based research chemicals.", "replies": {}}}}, "fj8y9tl": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fj8y9tl/", "is_submitter": false, "created": 1583154477.0, "body": "just to add to the discussion a bit.    Seconal was generally received as fabulous...Tuinal as well being a little stronger given the additional Amytal.   Placidyl or Ethchlorvynol however....they were ok although when you are talking euphoria. Quaaludes/Sopor/Seconal/Tuinal and even Dors & 4's .....Placidyl simply just didn't have the same euphoria. I had stacks of scripts I never even bothered to fill.   Potency however- it would kick your ass but that was part of the problem. It just put you out. Ludes and Sopors were King", "replies": {"fj9fgti": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fj9fgti/", "is_submitter": true, "created": 1583174933.0, "body": "I've heard some people found Placidyl to be fun and euphoric while I've also heard it would also knock you the fuck out as well. I'd likely still try it out just for kicks, same with the lesser known Ethinamate.", "replies": {}}}}, "fjfzpsc": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjfzpsc/", "is_submitter": false, "created": 1583334293.0, "body": "During the time that Dor's & 4's were popular I did a lot of experimenting with other drugs to try to create that fabulous synergism and I have to tell you that I came up empty.\nBeing a vendor and heavy rec user at the time I had pretty much everything at my disposal and it was kind of frustrating because what you had was two sort of mildly appetizing to weak drugs( Doriden/Codeine) however when u combined them together it was like a euphoric explosion- and yet when I substituted Oxycodone or Hydrocodone for the Codeine it didn't work... I substituted Tuinal for the Doriden for sure....can't remember if I substituted Ludes for the Dor's due to the timing....no Ludes in my area after 1984.   I just remember that nothing worked.  You had to take Doriden and Codeine- the stronger drugs mixed together didn't synergize as well", "replies": {"fjifdqu": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjifdqu/", "is_submitter": true, "created": 1583395220.0, "body": "I find that hard to believe because Hydrocodone and Oxycodone are metabolized by the same enzyme that metabolises Codeine into Morphine.\n\nIt'll be hard to study that combination as well unless you travel to Bulgaria where Glutethimide is still a prescription drug or hope that this active metabolite of Glutethimide becomes a research chemical and retains the parent drug's CYP2D6 enzyme inducing properties. \n\nOn another note I bet both Glutethimide and 4-HO-Glutethimide would go well with French Tussipax tablets because they contain 10 milligrams of Codeine and 10 milligrams of Ethylmorphine which are both metabolized into Morphine by the CYP2D6 enzyme.", "replies": {"fjlbm79": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjlbm79/", "is_submitter": false, "created": 1583472494.0, "body": "Yes, I remember it to be  frustrating at the time. I would mix stronger drugs but not get the same effect.\nThat is why Dors and 4's were a thing. They had a specific synergism that hit like a brick and other combo's simply didn't measure up.\n\nI get excited every time I see the work Tussipax because it reminds me of Tussionex ......\n Tussipax would be great with any form Glutethimide I would think.\nHave you done any Tussionex?\nAlso there has to be vendors from Bulgaria on the darkweb. If Doriden is still available there then I am wondering why it isn't  popping up. I heard of a couple clandestine labs that were producing Doriden of course I only heard of them after they were shut down.\nBrings back good memories of when there were Methaqualone labs all over the U.S. in the late 70's.   Pharma actually became kind of rare by the end of the decade in a relative sense because there were do-it-yourself labs everywhere. I know there were many in my city and it was just medium-sized midwest. Of course the Colombians were going full bore at that time.\nI will be interested to hear if anyone can come up with some Doriden.", "replies": {"fjltn7p": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjltn7p/", "is_submitter": true, "created": 1583482985.0, "body": "No I haven't done Tussionex because I find Hydrocodone to be an incredibly overrated and lame opioid and despite the synergy from the Chlorpheniramine I highly doubt it would be worth my while because it takes 100+ milligrams of Hydrocodone to actually get me high even with no opioid tolerance. I'd likely only enjoy Hydrocodone with Glutethimide. I believe Doriden was discontinued in the USA back in 1993 and that was a couple years before Oxycontin and Hydrocodone became commonly prescribed in 1995 which must be why we don't hear much about Glutethimide being used alongside Hydrocodone and Oxycodone. Alot of people on Bluelight suspect bad things would happen to people if both were simultaneously available.\n\nAs for why there are no Bulgarian DNM vendors selling Glutethimide, It's probably not commonly prescribed in Bulgaria much like how Dipipanone (Diconal, Wellconnal) is infrequently prescribed in the UK and South Africa. I've heard Amobarbital is still a prescription drug that's prescribed in Bulgaria still as well.", "replies": {"fjpqeqh": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjpqeqh/", "is_submitter": false, "created": 1583586978.0, "body": "Hey, one misconception needs cleared up and probably a  lot of people fall into this trap since Oxycontin became such a huge thing post 1998.\nThere was tons of Oxycodone and Hydrocodone available during the 70's and 80's in the U.S.     It was freely available and very commonly abused. You just don't hear about it because fatality rates were low.   Personally I was getting both of them from multiple doctors every week and their waiting rooms were packed. The U.S. was flooded with hydro and oxycodone not contin in the 80's\nBtw, it was also very available in quantity on the street. I was 15 years old and someone sold me 500 Percodans.. I tried them and really didn't like them because they felt nothing like Quaaludes.\nI think you would be surpised by Tussionex\nIt wasn't until 9 years later that I discovered their allure", "replies": {"fjr1jkx": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjr1jkx/", "is_submitter": true, "created": 1583609135.0, "body": "I knew Percodan was around back then and I thought the most commonly used opioid at that time was Meperidine/Pethidine. I highly doubt I'd be surprised by Tussionex because like I said it takes 100+ milligrams of Hydrocodone to actually get high and drinking that much Tussionex would likely have me in an anticholinergic delirium. Sadly I have a jacked up opioid tolerance courtesy of street Fentanyl... 😒😑 Even if my tolerance goes away I'll still never be able to enjoy Hydrocodone. Likely because Hydrocodone is derived from Thebaine more than Morphine and as a result is a more stimulating opioid.", "replies": {"fjumg1h": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjumg1h/", "is_submitter": false, "created": 1583646950.0, "body": "Yes, back then Percodan, Percocet, Tylox, Oxy with APAP, Vicodin, Hycodan and Anexia D were all heavily prescribed.\nMeperidine was also very heavily prescribed but since it was stronger it was prescribed less than most of the ones I listed above.\n\nI still think you would liked Tussionex. It was a different breed of hydro. Had to have had something to do with the mix.", "replies": {"fjw23fd": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjw23fd/", "is_submitter": true, "created": 1583662396.0, "body": "What makes you think I'd like Tussionex? I'm just curious since I have a massive tolerance and have a preference for sedating opioids and Codeine derivatives like Hydrocodone and Oxycodone haven't really done much for me because they aren't capable of making me nod.\n\nI do however recommend that people who take Hydrocodone and enjoy it take it with Chlorpheniramine. Currently I'm looking into some of the Benzimidazole based opioids like Isotonitazene and Etodesnitazene because they seem promising and more euphoric than Fentanyl and fentalogues", "replies": {"fkpj480": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fkpj480/", "is_submitter": false, "created": 1584440168.0, "body": "Every experienced opiate user that I ever met loved Tussionex. Some complained a little bit when they tweaked the formula in the 90's but I have to say that Tussionex was universally loved.", "replies": {}}, "fmpte2v": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fmpte2v/", "is_submitter": false, "created": 1586315791.0, "body": "I may have already responded but if not....I have never met an Opiate user who didn't love Tussionex. It is possible I guess just never heard anyone say that. Many fall in love.\nAs an aside, my pcp wrote me Hycodan yesterday which isn't that big of a deal however he doesn't ever write opiates so I was shocked.", "replies": {"fmqx6eh": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fmqx6eh/", "is_submitter": true, "created": 1586337800.0, "body": "I'd probably like the combination/synergy of the Hydrocodone and Chlorpheniramine but in my case I'd likely need 2 50 milligram Zohydro ER or 1 100 milligram Hysingla ER or better yet the 120 milligram one and an hour after taking Hydrocodone I'd just throw in the max daily dose of Chlorpheniramine (which is 32 milligrams) and see what happens. \n\nMost Hydrocodone users like taking small amounts to enjoy the slight buzz but I shoot for getting hella faded and like to be nodding and borderline incoherent. 😂 Btw they make pill forms of Tussionex called TussiCaps that contain both Hydrocodone and Chlorpheniramine however I have no clue how often they're prescribed. \n\nhttps://www.drugs.com/imprints.php?action=search&drugname=tussicaps\n\nAlso in Canada the Tussionex they have doesn't have Chlorpheniramine as the antihistamine in it and instead they use the antihistamine Phenyltoloxamine which is usually used alongside Tylenol, other NSAIDs, and other various weaker opioids like Codeine and Dihydrocodeine and is rarely available on it's own.\n\nYou're right about doctors not writing scripts like that anymore due to the increasing hate by the normies and government around opioids.", "replies": {}}}}}}}}}}}}}}}}, "fjlc7l0": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjlc7l0/", "is_submitter": false, "created": 1583472825.0, "body": "just reread your statement and yes I can guarantee you that oxycodone and hydrocodone did not work as well as Codeine with the Dors......not even close.\n\nBelieve me, we were all running doctors back and everyone had plenty of Perc and Hydros. If they would have worked Codeine would not have been the other half of a Set.\nFrom a scientific standpoint I can't tell you why they didn't work however from my own experience and the observation of others Oxy, Hydro...etc could not be substituted.\nI also tried substituting out the Doriden to no avail", "replies": {"fjluk11": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjluk11/", "is_submitter": true, "created": 1583483589.0, "body": "Now that I think about it it's possible that Hydrocodone and Oxycodone could be too stimulating when used with Glutethimide but if they were being converted into Hydromorphone and Oxymorphone which are much more euphoric and sedating than their Codeine based counterparts then that wouldn't be an issue... I remember one time I combined 40 milligrams of Oxycodone with 1050 milligrams of Carisoprodol and the stimulating effects of the Oxycodone were able to override the sedating effects of the Carisoprodol and I had to snort 12.5 milligrams of Doxylamine to catch a nod. \n\nStill more research needs to be done on this combination to if the Codeine conversion into Morphine is perhaps the best way as I could see how that combination could be similar or better than Heroin.\n\nOn another note, since you said you tried using Methaqualone alongside opioids and it wasn't as good as using Glutethimide, I still imagine that combo to be a fun one, hell if I get the chance I want to combine Dipipanone (Diconal, Wellconnal) with Methaqualone if I ever visit South Africa. I bet that combination would be amazing.", "replies": {"fjpw2kb": {"score": 2, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjpw2kb/", "is_submitter": false, "created": 1583590820.0, "body": "I am sure the Methaqualone/opiate combo will be good. I mixed them many many times( mostly oxy and Dilaudid) but I really don't remember...that was mainly1978-81..prior to 78 I  only used opiates sporadically since I didn't like them at first", "replies": {}}}}}}}}}}}}, "hk8rkq": {"text": "[Reagent test results from an hour ago.](https://www.reddit.com/r/ReagentTesting/comments/hk6bel/european_new_batch_hexen_nethylhexedrone_results/)\n\n&#x200B;\n\nSo after an allergy test with 5mg, I insufflated 40mg and the effects are jitteriness, anxiety, I started picking on my skin and I'm nauseous. I am also under the influence of 1mg of alprazolam and 60mg of oxycodone, so enough to 'take the edge off' in my opinion.\n\n&#x200B;\n\nNever done Hexen before. Is smoking it a better experience?", "author": "FUCK_YOU_FUCK", "score": 4, "flair": null, "created": 1593763890.0, "url": "https://www.reddit.com/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/", "num_comments": 27, "title": "Is it me, or this Hexen just sucks?", "subreddit": "researchchemicals", "comments": {"fwrpd92": {"score": 6, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwrpd92/", "is_submitter": false, "created": 1593775191.0, "body": "for HEX/NEP (all caths ime) vaping the substance is less \"Dirty\" and \"rushy\", in the  bad way, than up the nose. I like vaping  ROA better for the effect, but you pay the price for how fucking hard it is to stop, and how long the fun lasts. Takes some serious willpower to end a cath binge, so be warned. not many ppl can have these in their stash for long at all. Try both to really know. But vaping a few bowls and then trying a line you'll really understand which one is better lol. Line turns you off right away, just comes with too much negatives. Just be prepared to sweat this shit out your skin like you can't believe.", "replies": {"fwstppe": {"score": 4, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwstppe/", "is_submitter": false, "created": 1593809385.0, "body": "Can confirm\n\nBought 4gs of NEP, snorting it burned like glass shards in my nose and oral sounded underwhelming for recreation. Vaped it is... I couldn't stop even though I wasn't getting any more good effects after ~2hours of nonstop vaping. Had to give the remainder of the bag to a friend, still haven't gone in for round 2. Losing control scares me and I lose it too fast with these caths", "replies": {"fwtxm9y": {"score": 1, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwtxm9y/", "is_submitter": false, "created": 1593831495.0, "body": "idk i have allergies and putting stuff up my nose is ughh...only take it (nep) in capsules and I'm not a stim head so 50mg gets me where I wanna b (depending on tolerance it can get just a tiny bit overstimulated). I dont have a vape and dont think it'll b worth it especially when it's so fiendish", "replies": {"fwz9650": {"score": 1, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwz9650/", "is_submitter": false, "created": 1593962621.0, "body": "I vaped it off foil, much better (and so much worse) that way. Don't think I'll be doing it again though, I'll have to give a 50mg oral dose a shot for milder less fiendish effects", "replies": {}}}}}}}}, "fwr8l4w": {"score": 3, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwr8l4w/", "is_submitter": false, "created": 1593764777.0, "body": "Vaping is my roa but shit if you dont like it now you might now like it vaped but you'll keep doing it. Its fiendish", "replies": {}}, "fwrb0bt": {"score": 2, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwrb0bt/", "is_submitter": false, "created": 1593766240.0, "body": "I hated snorted hexen. Never tried vaping it as I didn't need to binge the rest of the gram.", "replies": {}}, "fwuhzea": {"score": 1, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwuhzea/", "is_submitter": false, "created": 1593842775.0, "body": "It's a question of vaping, no?  I'm not sure of the current Hexen, but 'foiling it became an unholy nightmare that I dare risk repeating.   NEP is coming along as well.", "replies": {}}, "fx9t6qe": {"score": 1, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fx9t6qe/", "is_submitter": false, "created": 1594203675.0, "body": "hexen is the shittiest", "replies": {}}, "fwr9qxu": {"score": -5, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwr9qxu/", "is_submitter": false, "created": 1593765473.0, "body": "[removed]", "replies": {"fwr9yhd": {"score": 1, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwr9yhd/", "is_submitter": false, "created": 1593765602.0, "body": "[removed]", "replies": {"fwrahx5": {"score": -3, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwrahx5/", "is_submitter": false, "created": 1593765931.0, "body": "[removed]", "replies": {"fwraxsw": {"score": 3, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwraxsw/", "is_submitter": false, "created": 1593766198.0, "body": "[removed]", "replies": {"fwrb1w6": {"score": 1, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwrb1w6/", "is_submitter": false, "created": 1593766267.0, "body": "[removed]", "replies": {"fwrbjwp": {"score": 2, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwrbjwp/", "is_submitter": false, "created": 1593766570.0, "body": "[removed]", "replies": {}}, "fwrbdby": {"score": 1, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwrbdby/", "is_submitter": false, "created": 1593766460.0, "body": "[removed]", "replies": {}}}}}}, "fwrbiev": {"score": 2, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwrbiev/", "is_submitter": false, "created": 1593766546.0, "body": "[removed]", "replies": {"fwrcmor": {"score": 1, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwrcmor/", "is_submitter": false, "created": 1593767230.0, "body": "[removed]", "replies": {"fwrcnyi": {"score": 2, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwrcnyi/", "is_submitter": false, "created": 1593767251.0, "body": "[removed]", "replies": {}}}}}}, "fwrb59o": {"score": 1, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwrb59o/", "is_submitter": false, "created": 1593766325.0, "body": "[removed]", "replies": {"fwrcp1u": {"score": 1, "link": "/r/researchchemicals/comments/hk8rkq/is_it_me_or_this_hexen_just_sucks/fwrcp1u/", "is_submitter": false, "created": 1593767270.0, "body": "[removed]", "replies": {}}}}}}}}}}}}, "ho283h": {"text": "Hey all! This is my fist time reviewing a chemical here so bare with me. I received AP 238 yesterday and have been researching it over the last 24 hours. \n\nThere isn’t much to say other than it works! I highly recommend this chemical to anyone who wants a classical opioid experience. Compared to 2-methyl-ap-237, this has much more of a distinct hug and warmth to it comparable to that of oxycodone and stronger. The crack-like rush of 237 is present if not better, and the euphoria is greater however this  chemical does less for pain. \n\nWith a decent opioid tolerance ~30mg~ up the nose has me feeling remarkably cozy for around an hour to an hour and a half, a slight increase in duration compared to 237.\n\nThe causticity doesn’t seem noticeably less however, this chemical actually burns MORE via insufflation than 237, and I sniffed that for months...\n\nAsk me anything related to this chemical, I’ll be doing the same with this.", "author": "acidmannn", "score": 13, "flair": null, "created": 1594326566.0, "url": "https://www.reddit.com/r/researchchemicals/comments/ho283h/ap_238_report/", "num_comments": 24, "title": "AP 238 Report", "subreddit": "researchchemicals", "comments": {"fxf2kvt": {"score": 4, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxf2kvt/", "is_submitter": false, "created": 1594328557.0, "body": "I envy your studies. That chemical sounds amazing aside from the burning sensation. A cocaine-esque front end and oxy backend? Sign me up lol. Do you ever use IV or do you only use orally/intranasally?", "replies": {"fxf5yj1": {"score": 12, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxf5yj1/", "is_submitter": true, "created": 1594330628.0, "body": "I want to add to that, I am severely opiated right now. \nI did not mean to say 237 has a greater rush in general however in terms of stimulation, it feels almost tweaky while insufflating at first. \n\nAP238’s rush is the better in my opinion as it has the intense cozy feeling that you are a giant penis being inserted into the warmest vagina.", "replies": {"fxg1org": {"score": 4, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxg1org/", "is_submitter": false, "created": 1594346365.0, "body": "How long would you say the total experience, rush to finish lasts? Saying your severely opiated, is 30 mg a high dose for a semi opiate tolerant person?", "replies": {"fxgle39": {"score": 2, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxgle39/", "is_submitter": true, "created": 1594355631.0, "body": "I was redosing via 10-15mg bumps insufflation. 30mg is a decent dose to start with, however if you have a tolerance you may want more. The total duration before i started to notice a decrease in effects was around a little over an hour less than an hour and a half.", "replies": {}}}}}}, "fxf59bc": {"score": 5, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxf59bc/", "is_submitter": true, "created": 1594330208.0, "body": "I use insufflation with this chemical. I imagine even with the reportedly “reduced” causticity it would tear you up. Interesting you mention a cocaine like front end. 238 has a weird area numbing sensation I relate to cocaine. \n\nFor opioids these two chemicals, more so the 237, have in my experiences a unique rush to them unlike any opioid I have experienced. I would compare it the most to quality H honestly. Hence why I mention crack like nature. These chemicals are the “crack” of the current opioid scene right now with an insanely TOO GOOD feel in my opinion, and a short duration.\n\n238 is definitely more of a sedative/downer than 237, while they both have this 237 had more of a pronounced stimulating/uplifting effect before it gradually just became a general sedation.", "replies": {"fxf6lu0": {"score": 3, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxf6lu0/", "is_submitter": false, "created": 1594331007.0, "body": "I appreciate the in depth description.", "replies": {"fxf7tfn": {"score": 2, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxf7tfn/", "is_submitter": true, "created": 1594331702.0, "body": "I would relate 238 more to quality H, in my opinion it has that warmth feeling more and less of a dirty feeling I got from 237. I’m always happy to research in depth when a new RC pops up! I previously did the same with 2map237 when it started showing up in the states. I used that chemical for about 5 months, only doing a gram a week every 2 weeks or so. I managed to come out of that with no issue (HEAVY cannabis use I should mention might’ve helped) and had a little over a month clean before researching this 238. \n\n237 being in line with morphine potency wise and 238 being around 4x (I would say that is accurate), with \nheavy use of course they will cause dependency. However it hasn’t been that intense in my research and the greatest factor you should be aware of is the urge to redose, going along with the short duration/potency of these chemicals I am not afraid to admit that once I start I keep going until I’m out! \n\nDue to this, with chemicals like this I limit myself to only a gram purchase each time I research.", "replies": {"fxflbuw": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxflbuw/", "is_submitter": false, "created": 1594338644.0, "body": "I would approach use in a similar way as far as limiting the amount purchased. I've had problems with opiates in the past so now I limit my use to once a month and don't use a syringe if I partake. I may have to look into obtaining some 238 sometime. That and some 4-aco-DMT.", "replies": {}}}}}}, "fxf6ios": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxf6ios/", "is_submitter": false, "created": 1594330955.0, "body": "My interest in RC's usually pertains to the tryptamine class, but my interest is piqued. Do these chemicals cause dependency at the same intensity and rate as say H or Fent? I quit \"heroin\" because everything on the street is pretty much fent, and to me H is 1000x better. I want warmth and euphoria, not to be incapacitated.", "replies": {}}, "fxg1vpy": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxg1vpy/", "is_submitter": false, "created": 1594346452.0, "body": "have you tried U47700? That one had a rush that felt like a truck hitting you. zero to sedation in 1 second. unreal. one small line and you're gone, thinking \"i want more\" because the rush is already over.", "replies": {"fxgm73y": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxgm73y/", "is_submitter": true, "created": 1594356037.0, "body": "I was a little late and unfortunately did not get that one. I hear it has an even shorter duration than both of these?", "replies": {"fxh0mzc": {"score": 2, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxh0mzc/", "is_submitter": false, "created": 1594363230.0, "body": "yes, even more compulsive, even more dangerous, similarly caustic. im glad its gone, in retrospect it was a constant dance with death.", "replies": {}}, "fxivn0q": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxivn0q/", "is_submitter": false, "created": 1594412555.0, "body": " Nah, u4 lasted like 3-4 hrs.", "replies": {}}}}}}}}}}, "fxiuenf": {"score": 3, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxiuenf/", "is_submitter": false, "created": 1594411631.0, "body": "Thanks for the report. I just received my AP238 today and I'm curious what the experience will be like.", "replies": {}}, "fxgu4cd": {"score": 2, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxgu4cd/", "is_submitter": false, "created": 1594359909.0, "body": "[removed]", "replies": {"fxguj20": {"score": 2, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxguj20/", "is_submitter": true, "created": 1594360115.0, "body": "AP 238 just recently entered the states within the last month or two as far as I know. Some vendors are picking up on it.", "replies": {}}}}, "fxhwx9s": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxhwx9s/", "is_submitter": false, "created": 1594382211.0, "body": "Have you ever examined odsmt? Do you know what about 100mg odsmt = in AP238? I’ve heard between 5-10mg", "replies": {"fxi0sxq": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxi0sxq/", "is_submitter": true, "created": 1594384857.0, "body": "That sounds about correct. 5-10mg is an appropriate starting dosage as well for those without a significant tolerance.", "replies": {}}}}, "fy490rd": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fy490rd/", "is_submitter": false, "created": 1594820988.0, "body": "Any recommendation for oral ROA?", "replies": {}}, "g18newn": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/g18newn/", "is_submitter": false, "created": 1597285137.0, "body": "Thanks for the report! Have you tried this chem orally yet?? If so, how was it?", "replies": {}}, "fxgq318": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxgq318/", "is_submitter": false, "created": 1594357927.0, "body": "Is vaping an effective roa?", "replies": {"fxguo1w": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxguo1w/", "is_submitter": true, "created": 1594360184.0, "body": "I would advise against it as the causticity is still not very good, this chemical burns more than 237 from my experience.", "replies": {"fyrgv2h": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fyrgv2h/", "is_submitter": false, "created": 1595366360.0, "body": "Why is it so caustic? Is it innately so or is it due to poor purification practices?\n\nAre any pharma opioids considered caustic or is this why these drugs never made the varsity squad and got bench and then kicked off the team?", "replies": {}}, "fxgwpmj": {"score": 1, "link": "/r/researchchemicals/comments/ho283h/ap_238_report/fxgwpmj/", "is_submitter": false, "created": 1594361211.0, "body": "Ahh yeah that makes sense. Good advice, thanks", "replies": {}}}}}}}}, "jcd3a2": {"text": "Best for euphoria, and high strength? I had a very high tolerance to opioids in the past but now it's just medium I use about 90 mg of oxycodone to get pretty high nowadays, so I'm looking for the strongest and most euphoric legal opioids on the market currently since I have been out of the RC  game for 4 years or so...\n\n\nGo ahead and list below the various RC opioids going around right now if you feel like it, I'm currently aware of and will be testing these soon:\n\nPhenibut (edit-it's not technically an opioid at all, does not act on either three of the opioid receptors)\nTianeptine\nAP238\nPossibly AP 237 if I can get my hands on it and that's it for now I passed on odsmt it just doesn't sound like it's for me\n\nI ordered some phenibut and tianeptine to try.\n\nAlso just found out about the ap's still going to try and grab those now\n\nOh also feel free to let me know what you thought of each opioid – like RC you have tried. \n\nIf at all possible I would like to be able to IV now and then one of them if it's not too caustic etc\n\nLet me know guys what else other chemical am I missing that I JUST HAVE to try as a fellow opioid aficionado?!?!?", "author": "Reasonable_Golf1185", "score": 8, "flair": null, "created": 1602894678.0, "url": "https://www.reddit.com/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/", "num_comments": 23, "title": "Best current rc opiods available around? I'm not asking for vendors I'm just asking about the substances themselves thanks!! Read the post and comment please :)", "subreddit": "researchchemicals", "comments": {"g90pu79": {"score": 10, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g90pu79/", "is_submitter": false, "created": 1602896926.0, "body": "Phenibut is not an opioid\n\nAp237 and ap238 are caustic af and you shouldn't even take them for this, so many horror stories of tissues damage on reddit\n\nTianeptine is great but can give worse wd than H\n\n\nActually the best one around now is O-dsmt: lots of scientific research for that (metabolite of tramadol) and great high", "replies": {"g90sy7n": {"score": 5, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g90sy7n/", "is_submitter": false, "created": 1602898482.0, "body": "Can anyone link some like ncbi articles or something related to RCs being “caustic”? I’m not asking you to cite your sources, specifically, I just see that word thrown around and want to know where to start my research on this property of the chemicals I consume.", "replies": {}}, "g98pzvw": {"score": 2, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g98pzvw/", "is_submitter": false, "created": 1603072496.0, "body": "tissue damage is not a problem If you use these substances only rarely and dont do crazy high doses", "replies": {}}, "g92nn5c": {"score": 1, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g92nn5c/", "is_submitter": true, "created": 1602936850.0, "body": "Yes I realize phenibut is not an opioid I thought I used the word opioid – like or basically I meant chemicals that work on the opioid U receptors..", "replies": {"g96q7av": {"score": 2, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g96q7av/", "is_submitter": false, "created": 1603028630.0, "body": "Phenibut doesn’t affect opioid receptors at all", "replies": {"g972377": {"score": 2, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g972377/", "is_submitter": false, "created": 1603037491.0, "body": "It's a Gaba and it effects the opiod receptors at higher doses- just bought some and did alot if reading on this one lately ✌💯", "replies": {"g977wb7": {"score": 1, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g977wb7/", "is_submitter": true, "created": 1603041909.0, "body": "Well from current trials and medical literature I cannot find anything that says it works on either 3 opiate receptors. \n\nYes it's a gaba but for some reason in higher doses it acts very similar to an opiate and can cause withdrawal symptoms when stopped abruptly after taking it for a while so I'm honestly not sure on the receptor part of this debate, however honestly does it really matter?\n\n I ordered some too earlier this week and I will be experimenting with it a bit, at the very least I hope it has pain killing properties and the ability to get rid of normal opiate withdrawal symptoms, some euphoria would be a bonus, we shall see.\n\nFrom what I've read on multiple people's experiences with it it should do all three of the above, we shall see.", "replies": {}}, "g978csi": {"score": 1, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g978csi/", "is_submitter": false, "created": 1603042283.0, "body": "I was thinking of tianeptine - I ordered them both as well -so will find out soon the effects !✌", "replies": {}}}}, "g9781cw": {"score": 2, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g9781cw/", "is_submitter": true, "created": 1603042030.0, "body": "I stand corrected, like I mentioned below you are correct there is no literature that says that it does, my mistake!", "replies": {}}}}}}}}, "g90v2oy": {"score": 4, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g90v2oy/", "is_submitter": false, "created": 1602899547.0, "body": "Etazene", "replies": {"g93m9va": {"score": 1, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g93m9va/", "is_submitter": false, "created": 1602969490.0, "body": "Yes", "replies": {}}, "g9782h2": {"score": 1, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g9782h2/", "is_submitter": true, "created": 1603042054.0, "body": "Yes it sounds absolutely wonderful however it is completely illegal so that makes things a bit more complicated", "replies": {}}}}, "g913yz6": {"score": 5, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g913yz6/", "is_submitter": false, "created": 1602904053.0, "body": "Not sure if you are a member already, but we have a sub for RC opioids /r/Opioid_RCs (Shameless self plug as I'm a moderator there :D )\n\nIn my opinion Neither 2ME-AP237 nor AP238 are anything that special.\n\nThen there are the stronger opioids, which are Benzamidazoles. Out of these the best ones currently available are Metonitazene (Around 70x Morphine strength, 7 hour duration, medium euphoria) and Etazene, AKA Etodesnitazene (Around 30-35x Morphine potency, only 1-1.5h duration, high euphoria.\n\nThese Benzamidazole opioids are very good bang for your buck, but please don't mess around with pure powder is you don't know what you are doing, but rather go straight for a ready made Nasal spray.\n\nI must say though, they do raise your tolerance quickly.", "replies": {"g91xcgc": {"score": 2, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g91xcgc/", "is_submitter": true, "created": 1602919452.0, "body": "Yeah I actually just found your guys's subreddit yesterday after I posted this hha\nBut yeah I got some crazy experience and a decent tolerance at the moment although nothing like back when I was fucking around with pure Carfent years ago now that was a trip that stuff would fuck your tolerance up so quick it was crazy even after a week of using CF when I would switch back to oxy or something I could take 10 and not feel anything but anyways glad those days are behind me humans are definitely not supposed to be taking CF everyday for months in the size of doses that would kill 10 elephants in each shot lmfaoo, but yeah microgram scale, starting slow, poison test, I know the whole regimen whenever I try something new so no worries", "replies": {"g92gs72": {"score": 3, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g92gs72/", "is_submitter": false, "created": 1602931911.0, "body": "I used to do 500 μg every 12 hours for half a year (or more?) of carfentanil. I used almost 250 mg I guess so a bit longer than half. That was messed up. Glad those days are over. I know exactly what you mean. 99.79% purity. Lol. Was nuts. I was nuts. \n\nThe fact I’m ALIVE is nuts. Glad you’re still here too, pal. I have a balanced that weighs 2.1 g capacity to 0.1 μg. Was helpful weighing doses to add to bacteriostatic water for injection to carefully measure out a lot of exact doses. 0.5 mL was 500 μg. Easy to remember and easy to do. It’s probably the only reason I am living lmao.", "replies": {"g92ngyb": {"score": 1, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g92ngyb/", "is_submitter": true, "created": 1602936724.0, "body": "Same same bacteriostatic water and microgram scale although my tolerance got so high I was able to it out I think I was probably using like 2 to 5 mg per shot at one point and then my tolerance would reset when I would run out and go a week or two without it and I would be able to use like two or 300 micrograms and nearly OD some wild shit carfent was haha", "replies": {"g92ox77": {"score": 2, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g92ox77/", "is_submitter": false, "created": 1602937811.0, "body": "Yeah it’s wild. I kept it so I wouldn’t have to redose constantly. I’m not an addict. Im not shaming them either, just making a statement. I never redosed before redose time. Which was every 12 hours. One dose every 12 hours. \n\nI had a friend who was using 1 g every 3 weeks. I used 250 mg in 250 days. Blows my mind. The amount I used could kill so many people by itself. His 250 days? Holy shit. I don’t think they even legally produce that much yearly for veterinary use lmao 😂", "replies": {}}}}}}}}}}, "g90za6y": {"score": 2, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g90za6y/", "is_submitter": false, "created": 1602901659.0, "body": "At one point 2MAP-237 used to be pretty decent. This latest batch going around is total crap. Useless. It used to be a perfect crystal that has a fungus type taste. Now it is waxy blob of crap that smell like cinnamon and vomit. 238 is also completely useless. I would not spend a dime on either of them.", "replies": {}}, "g9786fh": {"score": 2, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g9786fh/", "is_submitter": false, "created": 1603042141.0, "body": "I must be thinking of another one then - maybe tianeptine - but I got both ordered too so I'll find out ! Lol", "replies": {"g978no8": {"score": 2, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g978no8/", "is_submitter": true, "created": 1603042513.0, "body": "I just received my tia oday trying it right now I have a very large tolerance so I have no idea what dosage I'll need so I started with 100 mg, waited awhile, and about 30 minutes ago I took about 350 mg or so, I definitely feel energy and pain relief, talkative hmm, not as much euphoria/warm opioid glow as I would have liked but not a big deal, maybe I shall try a larger dose next time, I did notice it definitely helped withdrawal symptoms.\n\nI'm going to go ahead and assume for an opioid-naive individual they would experience much more euphoria and it would be much more pleasant especially since I have heard that this specific chemical can be more addictive and have worse withdrawals than heroin in certain individuals. \n\nTherefore if you are not already opioid dependent it is definitely not something you want to get hooked on or take multiple times a day everyday etc which would make you dependent for sure.\n\nBe safe!", "replies": {"g97a851": {"score": 1, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/g97a851/", "is_submitter": false, "created": 1603043840.0, "body": "You be safe as well - I read the dosage on wiki - and I think I'll be around the 100 or so mark- been taking odsmt for about a week ,a few oxy 30 and some 238 as I ran out of kratom and I'm in Wisconsin where kratom is illegal! Can't even get it shipped except black market - but I'm glad to hear your ok and it's not super strong - I've been tapering down alot", "replies": {}}}}}}, "gagu99u": {"score": 1, "link": "/r/researchchemicals/comments/jcd3a2/best_current_rc_opiods_available_around_im_not/gagu99u/", "is_submitter": false, "created": 1603982709.0, "body": "O-DSMT last for quite awhile but isn't quite as euphoric or warm as oxy. I found that 2MAP though very caustic is similar to roxicodone or any oxycodone immediate relief. It burns quite a bit with a gassy like drip but the euphoria hits within a few minutes with a warm hug thats a bit stimulating and chatty. Then kind of fades into a little bit of a nod especially in higher doses. 2MAP only last about 2 hours with the first hour being the most euphoric. It does vary per batch on the quality and purity and some batches can be very caustic. When 2MAP is good it's really good.", "replies": {}}}}, "jk9av8": {"text": "Looking for the names of alternatives too\n\nOxycodone\n\nStimulants\n\nKetamine \n\nPsilocybin Alternative\n\nBenzos\n\nAny help would be amazing thank you!! new to research chemicals and want to do some researching ;) Thank you :p", "author": "7bottlesdeep", "score": 0, "flair": null, "created": 1604004166.0, "url": "https://www.reddit.com/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/", "num_comments": 22, "title": "What are some good research chemicals?", "subreddit": "researchchemicals", "comments": {"gahgikf": {"score": 6, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahgikf/", "is_submitter": false, "created": 1604004494.0, "body": "FAQ", "replies": {"gahhpva": {"score": 22, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahhpva/", "is_submitter": false, "created": 1604005266.0, "body": "If PsychonautWiki came in powder form I would definitely boof it.", "replies": {"gaijz5i": {"score": 2, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gaijz5i/", "is_submitter": false, "created": 1604023500.0, "body": "word on the street is that shit fireee", "replies": {}}}}}}, "gahlsan": {"score": 6, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahlsan/", "is_submitter": false, "created": 1604007622.0, "body": "Not gonna give you alternatives to your list because of my lack of experience, but my overall favorite research chemical thus far is : 5-MeO-MiPT.  \nI get beautiful visuals, music and touch enhancement. Really cool to paint while tripping.\nBut 5-Meo-MIPT truly shines when you eat or when you fuck. 10/10", "replies": {}}, "gahhp7p": {"score": 3, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahhp7p/", "is_submitter": false, "created": 1604005255.0, "body": "There is no opioid out there in the rc section to reach oxy.\nO Dsmt is not Bad (i dont like it it's way too speedy for me, feels like a speedball but in an unconfortable way imo)\n2 methyl ap 237 - caustic and after 2 hours nothing ( U 47 in shit Version)\n\n\n\nO Dsmt exoerience is only i.v", "replies": {"gahii0b": {"score": 1, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahii0b/", "is_submitter": true, "created": 1604005749.0, "body": "thanks for that :)\n\nwill look into ap 237", "replies": {}}}}, "gahr199": {"score": 3, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahr199/", "is_submitter": false, "created": 1604010370.0, "body": "Opiates: kratom, tianpetine, ap238, 0-DSMT and 2MAP and more but those are the easiest to get and they're all solid af in each's own right. You can snort and shoot up ap238, 2MAP and 0-DSMT hypothetically speaking.\n\nStimulants: (depends what kinda stimulant you want) but there's 2FA, 2FMA, 3FMA, 4FMA, 3MMC, NEP, HEXEN, etc...\n\nDissociatives: 3-meo-PCP, deschloroketamine, MXE, DXM, 2FDCK, etc...\n\nTryptamines: 4-HO-MET, 4-ACO-DMT, 4-ACO-MET, 4-HO-DET, etc...\n\nLysergamides: ALD52, 1PLSD, 1BLSD, ETH-LAD, AL-LAD...\n\nBenzos: Clonazolam, Etizolam, Flualprazolam, Flubromazolam, Flunitrazolam etc...", "replies": {}}, "gahhd9p": {"score": 1, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahhd9p/", "is_submitter": false, "created": 1604005043.0, "body": "Oxycodone - possibly o-dsmt, though have no personal experience with opiates.\n\nStimulants, depends on what you're looking for, recreational or functional.\n\nKetamine, I'm personally a fan of DCK\n\nPsilocybin alternatives, 4-ho-met is really good though doesnt have the headspace at medium-low dose. 4-aco-dmt. \n\nBenzo, not a fan of this class of drugs either but etizolam will work.", "replies": {"gahi7uq": {"score": 1, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahi7uq/", "is_submitter": true, "created": 1604005577.0, "body": "o-dsmt looks promising from what i've heard so far\n\nin the stimulant category looking for recreational/study stimulants :)\n\nWill look into both of those psychadelic rc's thank you\n\nand for the ketamine, is that the only ketamine alt out there? cant find anything else\n\netizolam is massive in australia and im not a fan of it personally, looking for a euphoric benzo rc that relieves anxiety but can still function on", "replies": {"gahlcs4": {"score": 4, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahlcs4/", "is_submitter": false, "created": 1604007390.0, "body": "I personally wouldn't go for benzos if euphoria and stress relief is what you're looking for tbh\n\nKratom maybe?", "replies": {}}, "gahrbxs": {"score": 2, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahrbxs/", "is_submitter": false, "created": 1604010519.0, "body": "Bro Etizolam is very euphoric idk what you're talking about. But Clonazolam is really euphoric as well. Take an opiate with the etizolam and you'll definitely be in a good place.", "replies": {"gahsxgn": {"score": 1, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahsxgn/", "is_submitter": false, "created": 1604011317.0, "body": "be careful with clonazolam. I take benzos occasionally to sleep after a trip, or if i took too much of a psychedelic, not a regular user. have had xanax and now use etizolam. one time I took 500mcg clonazolam at night I was like a walking zombie the entire next day with no memory of it, and constantly falling and banged up my legs. my boyfriend was with me luckily but was convinced to never take this drug. another time I took it during a 13 hr flight/layover, and again kept falling at the airport and missed my connection. I took it at home when very depressed one day and slept for 20 hrs and again no memory of the next 12 or so hrs. xanax and etizolam on the other hand are great to sleep and blunt a trip if needed. \n\nclonazolam is very strong and lasts too long to be practical. I assume it’s for people that are addicted with major tolerance.", "replies": {"gahtwtc": {"score": 0, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahtwtc/", "is_submitter": false, "created": 1604011800.0, "body": "I have a lot of experience with benzos though. I was a heavy user for years and I still use occasionally. But yeah I've blacked out plenty of times on clonazolam. Once I binged on it for about a week and in that week I scratched my face off and did all types of hilarious and dumb shit around the house. I got arrested once on it cause I tried to sell some to some kids at McDonald's and I was very fucked up. Like my mugshot looked hilarious I was so fucked up. I remember basically everything though cause I had a high tolerance at this point. I love it though. If you got some and dont want it DM me I'll definitely take it off your hands", "replies": {}}}}}}, "gahm2zd": {"score": 1, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahm2zd/", "is_submitter": false, "created": 1604007781.0, "body": "For the ketamine analogues search for arylcyclohexylamine. There's plenty, some of the newer ones are mxpr, mxipr, dmxe.\n\nFunctional stim for me is isopropylphenidate, very subtle, no euphoria, no energy rush, just some subtle focus enhancement. Works better then ritalin or dextroamphetamine for my ADD.\n\nI dislike benzo's, I've tried etizolam and clonazolam. If you don't like etizolam don't bother with clonazolam. I've used them as a trip killer which works, but I feel off the next day so I dont bother with them anymore.", "replies": {"gahri2v": {"score": 0, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahri2v/", "is_submitter": false, "created": 1604010604.0, "body": "Gotta do benzos by themselves with some weed bro. Add some kratom to it and you'll be feeling very nice", "replies": {"gahu3tu": {"score": 1, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahu3tu/", "is_submitter": false, "created": 1604011896.0, "body": "Different strokes for different folks, I never liked alcohol too. Stims are also boring imo. Too scared of opiates to try them..\n\nI'll just do the weed ;)", "replies": {"gahukew": {"score": 0, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahukew/", "is_submitter": false, "created": 1604012125.0, "body": "Take like 15gs of some red vein kratom in 7.5g doses spaced out by 2 hours and see how that makes you feel. Since you're too scared to try opiates it'll give you a very opiated high. Euphoric af like heroin and it last for a very long time too, very worth it. I'd put it in a fruit smoothie its easiest to get down like that cause it tastes like fruit and it's easier on your stomach too.", "replies": {"gahvh8s": {"score": 2, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahvh8s/", "is_submitter": false, "created": 1604012574.0, "body": "Yes, but I dont want an opium high. It scares me. I much rather do some heroic lsd or shroom trips then take an opiate.", "replies": {"gahvsra": {"score": 1, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahvsra/", "is_submitter": false, "created": 1604012732.0, "body": "I did a bunch of morphine and took like 6 tabs of acid and had a fucking crazy trip watching doctor strange and some other shit, out of body experiences and I was in a different dimension of reality it was my favorite trip on acid I've ever had. Never on shrooms though, only weed or other psyches with shrooms. Kratom worth a try though", "replies": {}}}}}}}}}}}}}}}}, "gain14q": {"score": 1, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gain14q/", "is_submitter": false, "created": 1604024739.0, "body": "There are few opioid RCs out there, and the good ones are nigh on impossible to acquire. There are plenty of stims - pyros are the fiendiest and rushiest of the lot, cathinones are a bit more serotoninergic and come in all sorts of flavours (4MMC being the holy grail). Ketamine has a few close analogues (DCK, 2-FDCK) but the PCx family are awesome if a little manic and hard to dose (<10mg doses). There are lots of tryptamines - 4-AcO-DMT is almost exactly the same, and 4-HO-MET is considerably more visual but less overwhelming for the brain. Benzos you have the lighter therapeutic stuff like diclazepam, and the obscenely heavy 'do stupid shit' variety (clonazolam).", "replies": {}}, "gahuirz": {"score": 1, "link": "/r/researchchemicals/comments/jk9av8/what_are_some_good_research_chemicals/gahuirz/", "is_submitter": false, "created": 1604012102.0, "body": "O-DSMT is nice although I have never tried oxycodone so I can't compare the two (O-DSMT is the only opioid I ever tried). 2-FDCK is almost identical to ketamine, and DCK is like longer lasting ketamine that is more potent by weight. Psilocybin alternatives are 4-AcO-DMT (this is most similar to shrooms) or 4-HO-MET or any other 4-substituted tryptamine. Back when I used to take benzos quite a bit I liked etizolam and clonazolam the best (pls watch out with benzos though especially clonazolam it is extremely potent). 'Stimulants' describes a large variety of drugs but I'll tell you some of my favourites: 3-FA (very similar to amphetamine), 3-MMC (very euphoric, kinda like coke + MDMA), 2-FMA is good for productivity/studying and finally 5-MAPB is like a less stimulating, more sedating MDMA. Also try psychonautwiki.org", "replies": {}}}}, "hzoxlr": {"text": "Lets go through the list:\n\nPotency - useful but not too strong \nPrice - cheap as fuck\nDuration - 3-8h perfect\nROA - oral smoked snorted vaped \nCausticity or anything like that - non existent\nForm - powder\nTaste - neutral to slightly bitter\nVapeability - slim to no residue with HCL Salt, instantly vaporizes\nMuscle relaxation - very pronounced \nSedation - pretty sedating, but not too much\nEuphoria - not as good as Oxycodone, but almost as good as morphine\n\nI don‘t see why its not being praised more, allegedly some people find it to be not very euphoric but I think thats not the case. Only downside for me is slight nausea sometimes. Its certainly better than any other rc opioid atm and better than some pharma opioids. \nUnless one really dislikes opioid sedation I dont see the neg. sides\n\nEdit: Do not ask me for a source, I‘d rather report the sourcing request than answer", "author": "G1nnnn", "score": 9, "flair": null, "created": 1596005421.0, "url": "https://www.reddit.com/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/", "num_comments": 21, "title": "Whats with all the brorphine hate ?", "subreddit": "researchchemicals", "comments": {"fzkgnt7": {"score": 6, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzkgnt7/", "is_submitter": false, "created": 1596009199.0, "body": "People don't like fentologues", "replies": {"fzkq86e": {"score": 6, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzkq86e/", "is_submitter": false, "created": 1596014537.0, "body": "especially fentalogs pitched as non-fentalogs that would still fall under the analogue act for a typical American prosecutor", "replies": {"fzofx4k": {"score": 2, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzofx4k/", "is_submitter": false, "created": 1596097475.0, "body": "Of course, the name sounds like morphine If you Look at its structure, it is pretty obvious that it is Not a analog of morphine. I dont see it as an evil trick of the sellers as long as they dont explicitly say that it is a morphine analog or that the structure does not have similartys with that of Fentanyl", "replies": {}}}}, "fzldkex": {"score": 4, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzldkex/", "is_submitter": false, "created": 1596029000.0, "body": "Atleast fentanyl has a well established saftey profile and a history of human use. A modification of the structure is unlikely to dramatically change the saftey profile. All of the harms of fentanyl can be mitigited with proper saftey procedures. Anyone remeber AH-7921? How about MT-45? These chemicals are so far away from any known opiod that the saftey profile cannot accuratly be predicited. The chemical itself could be toxic or cause seizures. Users of these two substances reported some very concering side effects such as hearing problems and hair loss. As well as dysporia, cauaticisty and hallucinations. Most likely due to kappa antagoism but the binding profile remains complely unknown. Now we have 2map and ap-238 which are an improvment on mt-45 for sure and they have seen clinical use. But for anyone who is tolerant / dependant these chems are of little use. The dose required is in the 100s of miligrams and for the price its just not economical. They serve ok for the opiod naive but even then O-DSMT is far superior. Its saftey profile is well established and potency is on par with morphine. I know that it is likely going to be gone from the market soon and 2map and friends are a reasonable replacement for the opiod naive market. Its unfouratant that the options are either insanly potent such as fentanyl and the nitazene compounds. Despite the extreme potency these compounds lack the euphoria that heroin, oxy, and others have. The short duration and heavy sedation are undesiriable as well. Then on the other side we have compounds like 2map, ap238 and odsmt that are generally good compounds for the opiod naive. They are essentially useless for the fentalog consumers and fentalogs are far too risky for the naive. So until the market gives us a compound that works for both of these groups eg oxycodone fentalouges and etonitaze based compounds will continue to be the best option for depentant users. The closest we ever got to this was u47700. The potency was not to weak and not to strong. The duration and causticy were drawbavks but overall this was the best compound to hit the market", "replies": {"fzoeljx": {"score": 2, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzoeljx/", "is_submitter": false, "created": 1596096755.0, "body": "A minimal change in the structure can completly change the pharmacology. Often, the pharmacology of drugs with a similar structure is somewhat similar too but there are also not few cases, where that isnt the case at all so allways be careful about new rcs", "replies": {}}}}, "fzlpki1": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzlpki1/", "is_submitter": true, "created": 1596040009.0, "body": "I see the US law part, but fentalogues like acetylfent were pretty popular. Anyways - I see people who complain about all opioids allegedly being „flesh eating“ when brorphine is widely available....", "replies": {}}}}, "fzkoa8v": {"score": 3, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzkoa8v/", "is_submitter": false, "created": 1596013432.0, "body": "Nobody seems to be able to describe the dose or the solubility. How is anyone vaping a drug which is active at 1mg and won't dissolve in any common and safe solvent?", "replies": {"fzlpi1o": {"score": 3, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzlpi1o/", "is_submitter": true, "created": 1596039939.0, "body": "It dissolves fairly well in pg/vg if you heat it or in water with citric acid - just gotta leave it over nights", "replies": {}}, "fzof7ax": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzof7ax/", "is_submitter": false, "created": 1596097084.0, "body": "It is soluble in pg and also in water(at least 1mg/ml), If you add a small amount of an acid, heat it and stirr it for 30-45min. I also vaped it a few times without making a solution first but i have access to a very accurate laboratory scale. I would not recommend to weigh single doses with a cheap scale even If it has a Resolution of 1mg. At auch small   doses those scales are not accurate at all.", "replies": {}}}}, "fzkqd6z": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzkqd6z/", "is_submitter": false, "created": 1596014616.0, "body": "You're about the first person I've seen who thinks its particularly euphoric at all. I think that's the reason why. Also even with fent level tolerance, it seems to have induced some weird blackouts in people when overdoing it.", "replies": {"fzlpn2m": {"score": 2, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzlpn2m/", "is_submitter": true, "created": 1596040080.0, "body": "I also saw nobody liking it, thing is, 5 people I know tried it and they all like it just like I do", "replies": {"g899y04": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/g899y04/", "is_submitter": false, "created": 1602308716.0, "body": "i know what this is. we just be in the same boat, along w the five people. m box 30s?Ⓜ️these east coast dealers sell them as oxy and really cut them with fentalogues. we like bro bc it gives us the high we associate with “percs”. I know i definitely only buy fetty presses because real oxy doesn’t even come close for me.", "replies": {"g89a7an": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/g89a7an/", "is_submitter": true, "created": 1602308866.0, "body": "excuse me what ? I dont get what you're trying to say at all\n\n&#x200B;\n\nI live in germany, Oxys are 3-4€ here and theres no such thing here as cut/pressed pills except for alpraz bars but they still have alpraz in them. So what did you want to say ?\n\nI was talking about brorphine not 30s american fentanyl oxys", "replies": {"g9hcet8": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/g9hcet8/", "is_submitter": false, "created": 1603260490.0, "body": "lol okay man. i’m just saying that people like bro because it gives them the feeling of their DOC. And cmon dood ur kidding me if you think “press’s 30s don’t exist in Germany” lol. you can buy a pill press and dies online for 20 bucks.", "replies": {"g9iojhs": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/g9iojhs/", "is_submitter": true, "created": 1603291753.0, "body": "I kid you not dude, of course there is some person who might press these things but the real deal oxycodones in germany are easy as fuck to spot (because they have a certain coating and its not the same colour all the way through) and I've never in my life seen a pressed Opioid pill here in germany, its always originals, usually even in original packaging.\n\nI could see presses of american pills going round in Berlin or so but in the smaller cities you only really get the real deal and for a decent price if you know the right people.\n\nAs I said, the only presses that are somewhat common are xanax bars but those are usually pressed with the german 1mg alpraz so they just press 2 of those into one bar because bars sell way better.\n\nWhile I have bought more morphine or other weaker opioids than oxy's I've still yet to come across a pressed one", "replies": {}}}}, "g9hchek": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/g9hchek/", "is_submitter": false, "created": 1603260522.0, "body": "and honestly i think this was on the wrong post. and i was ducked up while typing lmao. sorry lad if i was unclear.", "replies": {}}}}}}}}}}, "fzmcxzg": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzmcxzg/", "is_submitter": false, "created": 1596059384.0, "body": "Effects in comparison to kratom and odsmt or more benzo like", "replies": {"fzmdmzq": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzmdmzq/", "is_submitter": true, "created": 1596059788.0, "body": "Its an opioid so odsmt/kratom", "replies": {}}}}, "fznquyv": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fznquyv/", "is_submitter": false, "created": 1596084479.0, "body": "Fucks with nociceptin receptors which can do weird shit with your body supposedly. Blackouts are also connected to that. Feels like rushless fentanyl to most people. I dont hate just summarizing what i've read on forums.", "replies": {"fzo8tt8": {"score": 2, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzo8tt8/", "is_submitter": true, "created": 1596093641.0, "body": "Actually I could not manage to find anything negative on the Noiciceptin agonism.... what do you know ?", "replies": {"fzpcbs2": {"score": 1, "link": "/r/researchchemicals/comments/hzoxlr/whats_with_all_the_brorphine_hate/fzpcbs2/", "is_submitter": false, "created": 1596118022.0, "body": "In the very least it can cause hyperalgesia after prolonged use", "replies": {}}}}}}}}, "isqde2": {"text": "Which research chemicals are closest in relation to oxycodone or hydrocodone? \nI know there is plenty fentanyl analogs but are there any hydrocodone, oxycodone analogs?", "author": "PDPLondon", "score": 2, "flair": null, "created": 1600135647.0, "url": "https://www.reddit.com/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/", "num_comments": 20, "title": "Research chemicals close to Oxy?", "subreddit": "researchchemicals", "comments": {"g59ghvj": {"score": 6, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59ghvj/", "is_submitter": false, "created": 1600136482.0, "body": "I know its not popular but tianeptine is really similar in my experience but as Im sure you know that substance has a whole host of w/d problems and such so be very careful. I have a report about it you can find looking at my account :)", "replies": {"g59jwx3": {"score": 3, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59jwx3/", "is_submitter": true, "created": 1600137663.0, "body": "Lol but this is not an analog this is an antidepressant", "replies": {"g5a1vu5": {"score": 4, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5a1vu5/", "is_submitter": false, "created": 1600143525.0, "body": "[deleted]", "replies": {"g5ad4f9": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5ad4f9/", "is_submitter": true, "created": 1600147328.0, "body": "No way is it on clear web", "replies": {"g5b6tik": {"score": 3, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5b6tik/", "is_submitter": false, "created": 1600161472.0, "body": "Dude just go to nootropics depot and get 5 grams Its everywhere because its considered a \"nootropic\"", "replies": {}}, "g5agcwi": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5agcwi/", "is_submitter": false, "created": 1600148627.0, "body": "I would also want to know .... Is it on clear web.", "replies": {}}}}}}, "g59l1lb": {"score": 4, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59l1lb/", "is_submitter": false, "created": 1600138053.0, "body": "I know but it is a legal chemical that you can buy, I mean people consider etiz a rc when its a pharm so idk. Also there are no morphine or fentanyl analogs anymore on the clear web and tianeptine actually isnt an antidepressant there were studies that came out showing it had very little action on serotonin and most of its antidepressant qualities come through its modulation of the opioid receptors. Its very strong stuff at least for me.", "replies": {"g5ad6fa": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5ad6fa/", "is_submitter": true, "created": 1600147351.0, "body": "How safe would you say this is compared to regular oxy? Can this cause serotonin syndrome", "replies": {"g5agicd": {"score": 2, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5agicd/", "is_submitter": false, "created": 1600148682.0, "body": "No it can't your fine. (Joking but fr it's not that bad, I've stolen it from people and yeah it's hella good\nHence why I want to buy it on clear web hehe)", "replies": {}}, "g5b6qxm": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5b6qxm/", "is_submitter": false, "created": 1600161432.0, "body": "It is not as safe if used a lot. If you can control your use and wont develop a tolerance it should be just as safe also oral is the only ROA. Also if your not using any other serotonin agonist drugs there will be no risk of serotonin syndrome. Finally I've actually found that I can control my use with it much better then with oxy because it tastes so fucking bad and can be hard to consume", "replies": {}}}}}}}}}}, "g5euz8v": {"score": 6, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5euz8v/", "is_submitter": false, "created": 1600238627.0, "body": "ODSMT or 2-M-AP-237 are your best bets bud 🖖", "replies": {}}, "g59rus7": {"score": 5, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59rus7/", "is_submitter": false, "created": 1600140272.0, "body": "Defenetely 2-Methyl-AP-237 or SP-238, almost same potency & Effects but only lasts fo maximum of 1,5-2 hours oral\n\n&#x200B;\n\nis also very caustic", "replies": {}}, "g59hnu0": {"score": 2, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59hnu0/", "is_submitter": false, "created": 1600136887.0, "body": "Just do kratom dude", "replies": {"g59jnfq": {"score": 2, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59jnfq/", "is_submitter": true, "created": 1600137574.0, "body": "It’s not a hydrocodone analog I’m not looking for a methadone supplement", "replies": {}}, "g59jpa4": {"score": 2, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59jpa4/", "is_submitter": true, "created": 1600137591.0, "body": "I’m looking for a hydrocodone analog or sum thing of the sort", "replies": {"g59klmy": {"score": 8, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59klmy/", "is_submitter": false, "created": 1600137900.0, "body": "You won't find anything like that. The feds have been all over rc opioids due to the opioid epidemic, I'm sure the situation is similar in the UK as well. Kratom extract can be as good as 10-15mg of hydrocodone, it's not bad stuff. The only other thing I can think of that isn't a toxic derivative of cancer medication is O-desmethyltramadol, if you can find it. Good luck and please be more polite in the future.", "replies": {"g59kuel": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59kuel/", "is_submitter": true, "created": 1600137985.0, "body": "Sorry I just thought you were sarcastically telling me to eat Kratom to get off opiates", "replies": {"g59lh16": {"score": 4, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59lh16/", "is_submitter": false, "created": 1600138197.0, "body": "Ah, that makes more sense. I'm no moralist and would do no such thing. The reality of being dependent on opiates is harsh enough, no further criticism is warranted. I'm in kratom withdrawal myself rn. Feels like my body is made of concrete with bad rls, not too pleasant, but since I'm tapering it really isn't bad at all compared to harder stuff.\n\nKratom + phenibut or gabapentin is probably the best thing you're gonna be able to get.", "replies": {}}}}}}}}, "g59jlrs": {"score": -2, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59jlrs/", "is_submitter": false, "created": 1600137558.0, "body": "[deleted]", "replies": {"g59qpzm": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59qpzm/", "is_submitter": false, "created": 1600139957.0, "body": "Legal, easy to get, feels similar, etc.", "replies": {}}}}}}, "g59qo5p": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59qo5p/", "is_submitter": false, "created": 1600139937.0, "body": "Closest you'll get is O-DSMT or kratom but still not like oxys", "replies": {}}, "g60alxe": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g60alxe/", "is_submitter": false, "created": 1600654181.0, "body": "237", "replies": {}}}}, "fambbp": {"text": "I've seen a lot of posts (mostly negative) about 2-Methyl-AP-237 recently so I decided to give it a go.\n\nI have basically no tolerance to opioids. i use kratom occasionally and get effects from 2-3 grams and been researching o-dsmt recently, but no more than 40mg at a time so far. so I'm guessing I'm pretty close to none to very mild tolerance.\n\nCapped up 10mg as a test 2 hours ago, and made sure to take it with food since the reports have said it's harsh on your stomach (zaxby's fried chicken!) and a beer. waited an hour and was definitely feeling a slight opioid warmth/high, but probably comparable to 5mg oxy or 10mg hydro, and maybe close to 15-20mg of O-DSMT .\n\n1 hour later....All's well, so capped up 20 more mg's and had that about 30 mins ago with a 2nd beer. Definitely feeling a strong opiate high, that's basically on par with oxycodone. I'm really itchy and feeling great! no stomach pains or any other side effects so far. the itchiness is about as bad as i've ever experienced with any opioid though....it's kindof annoying, but no big deal because i was expecting horrible nausea.\n\ndon't plan on redosing anymore tonight, but figured I'd give you guys a quick report since there seems to be a lot of interest in this chemical. so far so good! and honestly, not a bad price. esp compared to street drugs and o-dsmt.\n\n&#x200B;\n\n3hrs later... tried a few more bumps.  almost no burn, seem very neutral compared to lots of other RC's i've snorted.  this shit is good! \n\n10/10 so far! only downside is the itching!", "author": "420--420", "score": 18, "flair": null, "created": 1582880149.0, "url": "https://www.reddit.com/r/researchchemicals/comments/fambbp/2methylap237_report/", "num_comments": 21, "title": "2-Methyl-AP-237 report", "subreddit": "researchchemicals", "comments": {"fiz1ve2": {"score": 7, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fiz1ve2/", "is_submitter": false, "created": 1582880969.0, "body": "Take an anti histamine like Benadryl and it takes away all itching. Personally I love the itching", "replies": {"fize42j": {"score": 3, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fize42j/", "is_submitter": true, "created": 1582889312.0, "body": "thanks! i'll try that", "replies": {"fizenss": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fizenss/", "is_submitter": false, "created": 1582889689.0, "body": "No problem opiates release a histamine reaction so that’s why an anti histamine works", "replies": {}}, "fj00pdy": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fj00pdy/", "is_submitter": false, "created": 1582912361.0, "body": "Antihistamines also add to the opioid high.", "replies": {"fs2b1pr": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fs2b1pr/", "is_submitter": false, "created": 1590676580.0, "body": "The best antihistamine for opiates/opioids by far is hydroxyzine (Vistaril or Atarax) Vistaril is capsule form and the pamoate salt and atarax is a  tablet with the hydrochloride salt. Vistaril- hydroxyzine pamoate is far far superior than any other antihistamine for this purpose. It also inhibits an enzyme that makes it a bit stronger and isnt overly sedating compared to other antihistamines.", "replies": {}}}}}}, "fj0gf00": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fj0gf00/", "is_submitter": false, "created": 1582928153.0, "body": "What dose would you recommend to prevent itching?", "replies": {"fj0gilb": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fj0gilb/", "is_submitter": false, "created": 1582928221.0, "body": "25mg if that doesn’t work dose another 25 but make sure to wait before redosing. IMO it can make the high feel “dirtier” but that’s just me. And I enjoy the itching so I don’t use.", "replies": {"fj0h9ns": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fj0h9ns/", "is_submitter": false, "created": 1582928734.0, "body": "Thanks! Do you take it simultaneously with the opioid, or do you take the benadryl an hour or so before the opioid?", "replies": {"fj0hbbw": {"score": 2, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fj0hbbw/", "is_submitter": false, "created": 1582928765.0, "body": "It depends if you want to make sure you have no itching take before the opioid", "replies": {}}}}, "fs2bxzv": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fs2bxzv/", "is_submitter": false, "created": 1590677333.0, "body": "Vistaril- hydroxyzine pamoate doesn't feel dirty at all and inhibits an enzyme which makes the high a bit stronger. It's quite relaxing obviously and they prescribe it for anxiety. But make sure its vistaril and not atarax, which is the hydrochloride salt. The BEST for opiate/opioid itching/nausea/potentiation", "replies": {"fs2cg1p": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fs2cg1p/", "is_submitter": false, "created": 1590677760.0, "body": "I have had vistaril but I do not find it much better. Any anti histamine makes the opiate high worse for me.", "replies": {}}}}}}, "fs2b9ys": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fs2b9ys/", "is_submitter": false, "created": 1590676771.0, "body": "Tell a doctor you're having anxiety and ask for vistaril, its hydroxyzine pamoate and is the best antihistamine for opioid related itching/nausea. It also inhibits an enzyme (cant remember which one) that makes it a bit stronger. And it isnt overly sedating unless you take 100mgs or so for an extra enjoyable nod. And it doesn't give you hangovers either", "replies": {}}}}}}, "fiz87h4": {"score": 4, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fiz87h4/", "is_submitter": false, "created": 1582885257.0, "body": "I'm aroused by your appropriate opioid use", "replies": {}}, "fiz861n": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fiz861n/", "is_submitter": false, "created": 1582885230.0, "body": "Is IV safe for this one?", "replies": {"fiza94r": {"score": 3, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fiza94r/", "is_submitter": false, "created": 1582886631.0, "body": "Quoting it from my other post:\n\nDon't push fast, and make sure you let your shot cool down before you do it. And don't miss. I've never missed with 2map237, but I missed with u4 back in the day.. Lord you don't know pain till you miss with that shit.\n\nIt is water soluble, I found I had to heat the water after adding it in. I probably could have heated the water beforehand and stirred it in but, frankly, I was being impatient.\n\nAlso, since you will invariably get some of the solution on the tip of the needle, rinse the needle off before you stick it in your arm. Otherwise you'll be burying a caustic solution into your skin along with that needle. The tracks will take forever to heal.\n\nAll of this said, be careful. Dose low and slow, and use good shooter hygiene. Clean needles, Micron filters, etc. If you have questions, please ask. It's not super rushy, so try not to chase that rush.. You'll wake up laying on the floor with a major headache if you're lucky. \n\nPlease don't die. Stay safe.", "replies": {}}, "fiza4f4": {"score": 2, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fiza4f4/", "is_submitter": false, "created": 1582886543.0, "body": "I posted about that's recently, let me see if I can find it", "replies": {}}, "fize844": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fize844/", "is_submitter": true, "created": 1582889389.0, "body": "can't help ya there bud.  never IV'd anything. but i will tell you this isn't even the slightest bit caustic.  no stomach or nasal issues so far...", "replies": {}}, "fjxfuza": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fjxfuza/", "is_submitter": false, "created": 1583700529.0, "body": "Idk about safe but I did it, worked fine", "replies": {}}}}, "fizfvok": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fizfvok/", "is_submitter": false, "created": 1582890560.0, "body": "The itching is the best!!!  \n\n\nWhen you just smoked the dope of the foil and you know its good stuff.... you hit it... the warmth comes, you get a little  get nausea and finally the nose starts to tingle and itch and you just grub that motherfucker and your dick gets a little hard, because some people (me included, especially on H IVed or boofed) can fuck little animals on opiats.. and Iam pretty much in charge when I want to cum. \n\n \n\nDont eat an anti histamine.. some of them                                                                                                                                                                                                                                                  ,", "replies": {"fjm3qke": {"score": 1, "link": "/r/researchchemicals/comments/fambbp/2methylap237_report/fjm3qke/", "is_submitter": false, "created": 1583489717.0, "body": "H IVed haha", "replies": {}}}}}}, "j0wdaj": {"text": "I acquired a gram of 4homet a while ago and have trialed it trice till now twice on oxycodone and once on clonazolam \nTill now I've yet to experience any worthwhile effects which mayve been to blame to the oxycodone /clonazolam idk.\nDid some yesterday whit 40mg nasal oxycodone and didn't got much from it...\n\nTempted to do like 30mg tonight whit a low dose of phenibut the phenibut purely in case I overshoot my tolerance and get in for a wild ride.\nBut it's probably just bunk...\n\nAnyone that knows how tolerance 2irks whit this chem?\nIs it like the other tryptamines or more in the range if lsd tolerance?\nAnd would oxycodone and clonazolam nullify the experience?", "author": "benzoboss0", "score": 3, "flair": null, "created": 1601260982.0, "url": "https://www.reddit.com/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/", "num_comments": 10, "title": "4homet tolerance and clonazolam oxycodone combo?", "subreddit": "researchchemicals", "comments": {"g6vj4aw": {"score": 4, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vj4aw/", "is_submitter": false, "created": 1601262250.0, "body": "I don't know about opiates but benzos will seriously dull a trip.\n\nWait two full weeks and try 4-HO-MET on its own. Also, how are you taking it? If you're snorting in then you're likely wasting a lot of the product.", "replies": {"g6vjadz": {"score": 2, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vjadz/", "is_submitter": false, "created": 1601262332.0, "body": "[deleted]", "replies": {"g6vjk16": {"score": 2, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vjk16/", "is_submitter": false, "created": 1601262462.0, "body": "If you took 4-HO-MET yesterday then taking more of it today will be a real waste. I don't think even 30mg will be enough. You really owe it to yourself to wait a week or two to really give the drug the best opportunity to work.", "replies": {"g6vkdcq": {"score": 0, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vkdcq/", "is_submitter": false, "created": 1601262827.0, "body": "[deleted]", "replies": {"g6vkknf": {"score": 3, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vkknf/", "is_submitter": false, "created": 1601262915.0, "body": "Nope. Tryptamine tolerance builds almost immediately and takes 1-2 weeks to reset to baseline.\n\nPhenethylamines are a little different. 2C-B mostly works the next day with only a little bit more necessary to achieve the same effect.", "replies": {"g6vkre8": {"score": 0, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vkre8/", "is_submitter": false, "created": 1601262988.0, "body": "[deleted]", "replies": {"g6vktop": {"score": 2, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vktop/", "is_submitter": false, "created": 1601263013.0, "body": "So, you're going to do it anyways?", "replies": {"g6vkz4j": {"score": 3, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vkz4j/", "is_submitter": false, "created": 1601263075.0, "body": "[deleted]", "replies": {"g6vl7s5": {"score": 4, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vl7s5/", "is_submitter": false, "created": 1601263171.0, "body": "Seems a little weird that you make a post asking why a drug isn't working for you and then when someone explains what you're doing wrong you decide to not take their advice.\n\nIs there a reason that you don't want to wait for a proper tolerance reset?", "replies": {"g6vndfp": {"score": 1, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vndfp/", "is_submitter": false, "created": 1601264167.0, "body": "[deleted]", "replies": {"g6vr8ni": {"score": 1, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vr8ni/", "is_submitter": false, "created": 1601265656.0, "body": "Once again, you're not giving yourself enough time to reset your tolerance. Don't be surprised if you're not happy with 2C-E.", "replies": {"g6vzsh4": {"score": 1, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vzsh4/", "is_submitter": false, "created": 1601269763.0, "body": "[deleted]", "replies": {"g6wwyhk": {"score": 1, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6wwyhk/", "is_submitter": false, "created": 1601287961.0, "body": "Well, I'm glad it's working for you. Have fun!", "replies": {}}}}}}}}}}, "g6vmkmd": {"score": 2, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vmkmd/", "is_submitter": false, "created": 1601263788.0, "body": "Bad idea. Wait a week AT LEAST! You’re fucking up your tolerance for no reasons! If you just want to try it one time to see if it’s active, i guess take 35mg and have a benzo on hand in case (still not a great idea!). You should have high tolerance so the effect could be minimal!", "replies": {"g72lqqn": {"score": 1, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g72lqqn/", "is_submitter": false, "created": 1601423454.0, "body": "[deleted]", "replies": {"g76cvrh": {"score": 1, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g76cvrh/", "is_submitter": false, "created": 1601506456.0, "body": "Dosage?", "replies": {}}}}}}}}}}}}}}}}}}}}}}, "g6vgleh": {"score": 1, "link": "/r/researchchemicals/comments/j0wdaj/4homet_tolerance_and_clonazolam_oxycodone_combo/g6vgleh/", "is_submitter": false, "created": 1601260985.0, "body": "[removed]", "replies": {}}}}, "ho4gn8": {"text": "My opi tolerance is permafucked thanks to a history of IV heroin use and dependence. I’ve also used kratom daily for the last 2 years. For reference, I haven’t used an opiate (excluding kratom) in over a month, but would still need 60 mg oxycodone to feel a buzz and at least 90 to nod. If I’m using more regularly, I might take 150 mg at a time. \n\n\n&nbsp;\n\n\nIs it even worth it for me to try rc opioids? Or is my tolerance just too high? I’ve heard o-dsmt is less caustic than 2map237, but will it be strong enough in reasonable doses? Have also heard that 2map and brorphine are more dangerous bc of overdose, but I’ve been around the opiate block and am less concerned about accidental OD.", "author": "discjam20", "score": 3, "flair": null, "created": 1594335219.0, "url": "https://www.reddit.com/r/researchchemicals/comments/ho4gn8/opioid_tolerance/", "num_comments": 17, "title": "Opioid Tolerance", "subreddit": "researchchemicals", "comments": {"fxgyri7": {"score": 3, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxgyri7/", "is_submitter": false, "created": 1594362259.0, "body": "well the fentalogues like brorphine are probably your best bet... not that i recommend them. but I also think kratom blocks opioid receptors. if you manage to go a week without Kratom you probably don't need as much oxy. but i find kratom more pleasant than any RC opioid i have tried tbh. doesn't make you nod without alcohol or promethazine but its just a very nice feeling", "replies": {"fxh6zz3": {"score": 1, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxh6zz3/", "is_submitter": true, "created": 1594366648.0, "body": "Interesting. My oxy tolerance was that high even before the kratom though. Although I’m sure it’s not helping and I’m kinda sick of taking it. It’s sad but I don’t think I’ve actually felt kratom since I started taking it daily. Maybe once or twice. I’m slowly tapering off, down to about 5-7 grams a day now. Just being a baby about wds and it does help immensely with cravings.", "replies": {}}, "fxhxxkg": {"score": 1, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxhxxkg/", "is_submitter": false, "created": 1594382877.0, "body": "I don’t think kratom has a blocking effect? Just slight tolerance on the mu and k receptors? I never noticed any.", "replies": {}}, "fxi1ica": {"score": 1, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxi1ica/", "is_submitter": true, "created": 1594385357.0, "body": "Do you have experience with brorphine? I’m reading that it’s insanely potent and sedating, and is awesome for pain relief but not much euphoria. Does this match your experience? I don’t have chronic pain, so I prioritize euphoria over analgesic effects", "replies": {}}}}, "fxfq3ht": {"score": 2, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxfq3ht/", "is_submitter": false, "created": 1594340945.0, "body": "I've seen a lot of people say that o-dsmt doesn't do much for them because of high opioid tolerance. I have only tried one opioid, o-dsmt, and only twice. A light-moderate dose hit me hard. But the general consensus seems to be that o-dsmt doesn't do much for people with high tolerance. I have never tried or read up on the other ones you mentioned, so this is all I can tell you.", "replies": {"fxgphm7": {"score": 1, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxgphm7/", "is_submitter": true, "created": 1594357634.0, "body": "Word, thanks. Yeah that’s kinda what I figured, unfortunately", "replies": {"fxudxst": {"score": 2, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxudxst/", "is_submitter": false, "created": 1594601874.0, "body": "Dude I have a much larger habit than you, not bragging or anything. I do over 10mg of pure fentanyl a day now. I recently bit the bullet and got metonitazene, etazene, and flutonitazene. The flu was disappointing, but the metonitazene (10x morphine) has helped me drop my fent dose a ton. The etazene is even more potent (25x morphine). \n\n\nIt’s not all a waste, people just haven’t tried everything. I’m glad I didn’t give up on RCs because those two are saving me right now.", "replies": {}}}}}}, "g3l5xb7": {"score": 2, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/g3l5xb7/", "is_submitter": false, "created": 1598997115.0, "body": "I know it's been a month, but dont let people fool you about 2map. 2map hits hard, you just have to take like 200 mg. Most the recommended doses for opies are folly because most people using RC opies already have a high tolerance. A high dose of 2map will give you that warm blanket buzz. Cant speak to fent analogs though, I wager people should follow recommended doses on those. But 2map or ODSMT if you're a veteran psshh go for 200 MG. I also have a daily kratom habit and these were my dosages. And 238 is not like 2map. 2map is better. 238 is good for getting off of things like tianeptine. Good binding, but lackluster compared to 2map", "replies": {"g3lltnv": {"score": 2, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/g3lltnv/", "is_submitter": true, "created": 1599003083.0, "body": "Ugh FUCK tianeptine. Haha been down that road. This is awesome info, thank you!", "replies": {"g3m1chh": {"score": 1, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/g3m1chh/", "is_submitter": false, "created": 1599008739.0, "body": "Nothing else has overpowered tia WDs than 2map/238 in my experience. Its good info to have!", "replies": {}}}}}}, "fxhixhg": {"score": 1, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxhixhg/", "is_submitter": false, "created": 1594373621.0, "body": "uh I am not too experienced with rc opiates, having only tried o-dsmt and 2-methyl-ap-237. 2map is meant to be fairly similar to oxy. It was nice. Not as good as oxy of course. But in regards to 2map and ones like u477 & u488 these RCs are pretty caustic and coupled with a high tolerance you may find yourself getting negative effects of having to take a decent amount of them. You'll fuck your nose. IV is meant to fuck your veins and oral seems the only way and even then, with your tolerance you'd be taking a lot of it, but hey if it's a once a month thing I can't see too much harm. I got away with snorting 2map since I only needed like 10-15mg to get high.", "replies": {"fxi1ydr": {"score": 1, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxi1ydr/", "is_submitter": true, "created": 1594385679.0, "body": "Yeah I managed to walk away from the spike life, so I’m looking for something I can snort or vape. Oral is fine as long as onset isn’t longer than an hour. Might give that a try", "replies": {}}}}, "fxhy3q8": {"score": 1, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxhy3q8/", "is_submitter": false, "created": 1594382991.0, "body": "Congrats on kicking back to kratom from harder opiates, that shit is not easy.", "replies": {"fxi12xj": {"score": 2, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxi12xj/", "is_submitter": true, "created": 1594385055.0, "body": "Thanks homie. Kratom absolutely saved my life", "replies": {"fxi29aj": {"score": 1, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/fxi29aj/", "is_submitter": false, "created": 1594385904.0, "body": "Fosho. Hell yeah man it’s great. I hope you obtain sobriety from opiates all together if that’s your end game. I’ve got 2.5 years clean from narcotics right now and haven’t been this happy In so long. Be careful, bropiate.", "replies": {}}}}}}, "g02kulb": {"score": 1, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/g02kulb/", "is_submitter": false, "created": 1596386560.0, "body": "Sorry for the dump question, just getting into this from oxy, what’s caustic mean? Thanks", "replies": {"g04sg6x": {"score": 1, "link": "/r/researchchemicals/comments/ho4gn8/opioid_tolerance/g04sg6x/", "is_submitter": true, "created": 1596424778.0, "body": "able to burn or corrode organic tissue by chemical action", "replies": {}}}}}}, "ije2fa": {"text": "So I know that brorphine isnt well liked anyways - but I really thoroughly enjoy it as much as real oxycodone. It is however an hERG Potassium Channel blocker which means risk for long qt syndrome, cardiac arrest, general cardiotoxicity etc. \n\nNow other commercial medical opioids also allegedly have this property, however I could not find anything regarding the extent of this.\n\nDoes anybody have info on how serious this is or does anybody know anyone who had problems with this ? If I understood it correctly lots of medical drugs for people with cardiac problems also block these channels so im assuming it cant be too bad but I figured id ask anyways. You guys always have good Ideas and knowledge. \n\nPlease help a fellow researcher out. Cheers.", "author": "G1nnnn", "score": 11, "flair": null, "created": 1598828601.0, "url": "https://www.reddit.com/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/", "num_comments": 17, "title": "Brorphines Cardiotoxicity", "subreddit": "researchchemicals", "comments": {"g3d1qqc": {"score": 2, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g3d1qqc/", "is_submitter": false, "created": 1598829596.0, "body": "There used to be an opioid for sale called dextropropoxyphene that did such a good job blocking hERG that it was used for euthanasia! I believe it has since been taken off the market, but drugs like loperamide and methadone are still on the market and those inhibit hERG as well. I don’t think anyone can tell you just how strong brorphine’s hERG inhibition is, but thankfully it’s a potent drug so not much is needed. I’m willing to bet it’s affinity for MOR is way greater than for hERG.", "replies": {"g3d9vpj": {"score": 2, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g3d9vpj/", "is_submitter": true, "created": 1598833290.0, "body": "Thanks for the response, its MOR activity probably is way bigger however I still was somewhat concerned because the only phrase regarding this that made a clear point said its a potent hREG blocker, however other meds are alleged „potent“ blockers too. And brorphine definitely has been consumed for some time by me and others however I am still afraid of long term damage due to idk hERG upregulation or whatever.", "replies": {}}}}, "g3dfsrw": {"score": 2, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g3dfsrw/", "is_submitter": false, "created": 1598836055.0, "body": "can you give a source on brorphine herg activity", "replies": {"g3dqcab": {"score": 2, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g3dqcab/", "is_submitter": true, "created": 1598840562.0, "body": "Either was this https://academic.oup.com/jat/advance-article-abstract/doi/10.1093/jat/bkaa094/5879253?redirectedFrom=fulltext\n\nOr https://link.springer.com/article/10.1007/s00204-020-02855-7 this i dont remember", "replies": {"g3e1lb5": {"score": 0, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g3e1lb5/", "is_submitter": false, "created": 1598845329.0, "body": "i checked those 2 articles but no mention or hERG.\n\nlow accuracy but i mapped brorphine on swiss target projection and hERG activation looked negligible.", "replies": {"g3e1slf": {"score": 1, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g3e1slf/", "is_submitter": true, "created": 1598845414.0, "body": "Really ? Sorry I need to find it later im on mobile currently", "replies": {}}, "g6p6bm5": {"score": 1, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g6p6bm5/", "is_submitter": false, "created": 1601168156.0, "body": "so would you say its fairly safe ?", "replies": {}}}}}}}}, "g3gt1jg": {"score": 1, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g3gt1jg/", "is_submitter": false, "created": 1598911074.0, "body": "I’ve been wanting to learn more about brophine, my collection of RC is insane but brophine is one I Havnt added to it. Would you chose it over all other opiates if not for the health issue? Would you say it’s potency is on par with oxy?", "replies": {"g3guq5f": {"score": 3, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g3guq5f/", "is_submitter": true, "created": 1598911765.0, "body": "Potency is definitely much much higher, more than buprenorphine. Without tolerance 1mg is a really good dose. \nIf not for the health issue, I'd rank it somewhere along morphine. It has a less natural feel to it (like the difference between fully synths and opiates but more extreme) but I dont mind it really its not much difference. \nHowever its pretty sedating and it does not kick fast, 8h duration tho. But then there's a gamechanger - smoking. Orally its just a good opioid, I'd rank it alongside oral Morphine. Smoked it kicks in an instant, still lasts about as long as oxy and is en par in terms of euphoria however ´these are just my findings (however all my mates felt like that too except one guy but he does not like any other opioids either) - most people on reddit claim its shit - im guessing maybe their batches sucked ? Mine was awesome", "replies": {"g8905kq": {"score": 1, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g8905kq/", "is_submitter": false, "created": 1602303261.0, "body": "At least you gave some decent details about it compared to other people. So it lasts as long as Methadone when taken orally eh? How long does it last when smoked? Also did you smoke it in a Meth pipe or off of tin foil?", "replies": {"g890yzz": {"score": 1, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g890yzz/", "is_submitter": true, "created": 1602303700.0, "body": "So after trying some more, also with tolerance, smoked lasts not nearly as long. I‘d say 1-3 hours depending on your tolerance and amount smoked.\n\nI smoke it off foil, if freebased before efficiency is raised by around 20-30%, meth pipe probably is more efficient tho.\n\n\nBut you might wanna check out my somewhat recent post regarding brorphines toxicity, its something every consumer should know about because its nothing to play with (if you dont care about your body, its neurotoxicity thats of concern too)", "replies": {"g8937x3": {"score": 1, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g8937x3/", "is_submitter": false, "created": 1602304934.0, "body": "I’ve seen your posts about it and read about it on Wikipedia so I’m aware of it, it sounds like Methadone, Dextropropoxyphene, and Levacetylmethadol in that regard.\n\nBrorphine even though people hate on it is an opioid I wouldn’t mind trying just to write up a good detailed trip report on so people would have something to go by and not ask about if it’s good or not all the time.", "replies": {"g8963ea": {"score": 2, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g8963ea/", "is_submitter": true, "created": 1602306527.0, "body": "Actually good Idea, you know what im gonna do that right now\n\nBut regarding that you said its similar to methadone in that regard, methadone might be a hERG antagonist (which im not even sure of but im assuming it is because it seems like thats what you want to say) but its not a ORL-1 Agonist and therefore not possibly additionally neurotoxic and more tolerance forming than normal opioids", "replies": {"g89874r": {"score": 1, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g89874r/", "is_submitter": false, "created": 1602307711.0, "body": "Is the ORL-1 responsible for the nociceptor agonist effects that I’ve been hearing about? I’m not sure what that receptor even does tbh. \n\nAren’t the nociceptor agonist effects why tolerance develops pretty fast for it? As I’ve heard that’s also why it has stronger painkilling effects than other opioids, it sounds promising for dealing with chronic pain like fibromyalgia.\n\nI’m looking forward to your trip report on it.", "replies": {"g898g2u": {"score": 2, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g898g2u/", "is_submitter": true, "created": 1602307853.0, "body": "ORL-1 = \"Noiciceptin Receptor\"\n\nresponsible for lowering the effects the Opioid has whilst still creating the same amount of tolerance, also aggravates certain types of neurotoxicity (therefore possibly making it an indirect neurotoxin for humans) by about 64% in certain animals\n\nit is a really good painkiller for that reason tho too. But I think Noiciceptin Antagonists have more potential, mainly because they are neuroprotective rather than toxic", "replies": {"g899wjs": {"score": 1, "link": "/r/researchchemicals/comments/ije2fa/brorphines_cardiotoxicity/g899wjs/", "is_submitter": false, "created": 1602308692.0, "body": "That I didn’t know about the Noicicepin receptor or rather noicicepin agonists (at least the neurotoxic effects of them).\n\nI just remember reading that the agonists have potential as powerful non addictive painkillers while the antagonists show promise for Parkinson’s disease and depression at least that’s what I understood from reading this article on Wikipedia. Unless there was something I missed.\n\nhttps://en.m.wikipedia.org/wiki/Nociceptin_receptor", "replies": {}}}}}}}}}}}}}}}}}}}}, "iomc05": {"text": "I am well aware of the many dangers and issues this pseudo opioid drug has. A quick search here on Reddit will render hundreds of posts discouraging use and telling tales of the horrid withdrawal but after reading so much about it I had to try it out for myself and to be completely honest I am pretty amazed. \n\nDOSE: 150mg of Tianeptine sodium Orally, dissolved in water (no opioid tolerance) \n\nNOTE: Tianeptine tastes horrendous, possibly the most bitter thing I have ever consumed \n\n\\--REPORT--\n\n0:10 - Feel a slight relaxation hitting me, placebo? Not sure at this point.\n\n0:15 - Suddenly feel a strong opioid effect coming over me, I'm begging to zone out looking at my screen and a strong sensation of warmth is spreading from head to toe.\n\n0:30 - Wow the rush was incredible, I have gone from completely sober to extremely high within the span of only about 20 minutes, I feel a strong \"stoned\" sensation in my head and have all of the classic opioid effects that one would expect from a strong opiate narcotic like oxycodone or hydrocodone (If not even stronger looking back). However the sedation aspect isn't quite there, I do feel spaced out and heavy-eyed, however I have been unable to catch a nod thus far.\n\n1:00 - After my previous entry I got in bed for the next half hour. Although still feel extremely \"opiate high\" and have now nodded off a few times the Euphoria is begging to fade. \n\n1:30 - Effects are still very strong and subtle itching is begging to set in. Although I feel incredibly sedated and disconnected from my body I haven't been able to nod as much as I normally would off other classic opiates. My body almost feels as if its sinking into my bed, really nice actually.\n\n2:00 - I'm begging to return to baseline. Although I still feel some pretty decent opioid effects I'm definitely past the peak and am actually starting to nod a little harder then before, possibly because the other non-opioid aspects of the drug are wearing off? The euphoria is pretty much gone however yet physically, I still feel amazing. \n\n3:30 - The effects are almost gone now. I still have a lingering opioid sensation through out my body but I am no longer nodding and mentally I feel very tired and still slightly spacey but almost baseline other then that.\n\n5:00 Effects are totally gone, although I barely still feel a slight comfort through out my body, mentally I am completely sober and ready to go to sleep.\n\nConclusion: \n\nWow for a legal RC this is amazing. Its by far the best legal opioid I have ever tried and kicks kratom's ass if you want a classic full agonist high. Its definitely not as \"clean\" feeling as morphine/fentanyl derived opiates but its damn close. For me It felt like a mix between tramadol and oxycodone, leaning far more towards oxy if not being even stronger in some aspects. Although the peak and overall duration is short It has an incredible rush and feels no different then a strong narcotic I would expect to be given by a doctor. \n\nHowever despite my praise this drug is not all good, as I'm sure many of you know it has awful withdrawals and due to its short duration is incredibly fiendish. This is mostly because although the bodily opiate effects linger about as long as oxycodone the euphoria fades rapidly within less then 2 hours and possibly shorter as tolerance builds. \n\nIn conclusion tianeptine sodium provides a slightly dirtier and shorter but arguably stronger oxycodone like high. It feels no different from a classic opioid and I believe the potential for abuse is no less. If you can see yourself having problems with opiate use or have been dependent in the past stay far away from this drug because although the high is good it will smash all classic opioids in terms of withdrawal and tolerance. None the less I am happy to have tried this chemical out and hope that you have found this report useful.", "author": "throwawa96", "score": 34, "flair": null, "created": 1599564685.0, "url": "https://www.reddit.com/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/", "num_comments": 17, "title": "Tianeptine review and experience report (sodium and recreational use)", "subreddit": "researchchemicals", "comments": {"g4etpzp": {"score": 25, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4etpzp/", "is_submitter": false, "created": 1599567487.0, "body": "Tianeptine is not a research chemical, it's a pharmaceutical used in europe as an anti depressant (Stablon, Coaxil). This is a very well written report but this isn't the right forum for it: r/drugs , r/opiates or even r/nootropics (but they might ban you since it's use as a nootropic is now looked down upon/negatively viewed) would be the closest thing because again, this is an anti depressant that has been used for many years in europe. Regardless of the off label use to get an opioid high, still wouldn't count as a research chemical. One could argue that one of the analogues (a few exist) could be considered and RC, but calling Tianeptine sodium an RC is like calling DXM an RC. \n\nLooking forward to any future trip reports or information you provide as again, this is very well written and detailed. It would not be surprising if this was removed though.", "replies": {"g4fum78": {"score": 11, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4fum78/", "is_submitter": false, "created": 1599601225.0, "body": "Etizolam gets called an RC all the time, and it’s a prescribed medication in some countries (Italy, I think?) as well.", "replies": {}}, "g4g4xiy": {"score": 6, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4g4xiy/", "is_submitter": true, "created": 1599607024.0, "body": "I am aware that its not a research chemical but the people that would likely be using this drug recreationally the way I am, are likely people in this forum who like to experiment with legal alternatives which tianeptine sodium is. Just thought the most people would find it useful here as most people in other drug forums have never even heard of this chemical in their life.", "replies": {"g4gko3z": {"score": 1, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4gko3z/", "is_submitter": false, "created": 1599615060.0, "body": "That is a totally fair point, and as another poster said etizolam is occasionally accepted in this subreddit but that has more to do with the fact that it is an unscheduled thienodiazepine and it gets some acceptance because RC benzos are popular on this forum, as well as the way etizolam is discussed. Even then, people aren't writing trip reports or providing info about etizolam, they just note that it exists or recommend it for certain uses like reducing bad trips or coming down from RC stimulants.Again, not trying to bash you at all, and your report was fantastic. If it doesn't get removed then that's great and any information provided for people in the future to search/read up on is a great help to drug education and society. Looking forward to reading anything else you have to post about other compounds in the future.", "replies": {}}}}, "g4ezdxy": {"score": 2, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4ezdxy/", "is_submitter": false, "created": 1599572067.0, "body": "Agreed! Fantastic trip report but not an RC. Good job though!! I feel like your dosage info etc was fantastic. I would actually try this chem based on your trip report however I avoid opiate like drugs simply because they are so addictive. Thank you for sharing even if it’s not an RC", "replies": {"g4f0x22": {"score": 6, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4f0x22/", "is_submitter": false, "created": 1599573410.0, "body": "This is a drug that actually has worse withdrawals and negative effects than even a traditional opiate. Since it's a tricyclic anti depressant it works on multiple systems, only one of which is the mu opioid receptors. Normal prescribed doses are 12.5 mg 3x daily, so recreational doses are roughly 10 times a singular dose. The issue with that is that a lot of the other mechanisms (serotonin reuptake enhancement, glutamatergic system downregulation) do not scale in the same way as the opioid effects.\n\nThis means that to get the desired opioid effects, people have to take massive doses that end up raising tolerance/activating other pathways really quickly and aggressively. This means that while normal withdrawal from opiates can be uncomfortable, withdrawal from tianeptine is like withdrawing from an opiate, an antidepressant, and a benzodiazepine/tranquilizer all at the same time, and after a shorter period of use than a typical opioid. It would be especially strong because of the doses being 10x+ the therapeutic effect as well, meaning someone unlucky enough to kick a tianeptine habit will be in for:\n\nrunny nose, achy bones, no energy, hot/cold flashes, stomach cramps/explosive diarrhea, increased pain sensitivity, extreme restless leg syndrome, extreme feelings of sadness/depression/hopelessness, akathisia, extreme anxiety.\n\nPeople should be able to choose what they do/put in their bodies, as long as it doesn't harm others. Drug education/awareness and freedom are extremely important and hopefully attainable in our lifetimes.  That said, this is a very powerful drug intended to be used in small amounts that works on a lot of systems in a not very targeted way. Consider this: if you enjoy it, will you not want to do it more? If that is the case, those withdrawals are a very probable future outcome. That combination of symptoms sounds pretty nasty, and a very risky roll of the dice.", "replies": {"g4f80gw": {"score": 4, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4f80gw/", "is_submitter": false, "created": 1599580442.0, "body": "Well. That was amazing reading that. Any single doubt I had of trying tianeptine just completely vanished after reading that. Another example drug education is key.", "replies": {}}, "g4fk5pg": {"score": 3, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4fk5pg/", "is_submitter": false, "created": 1599593637.0, "body": "Yeah I had heard all of that before. Thanks for the reminder!! Anytime I want an “opiate” I reach for kratom. Seems MUCH safer", "replies": {}}}}}}, "g4fhse9": {"score": 2, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4fhse9/", "is_submitter": false, "created": 1599591383.0, "body": "Why is it’s use as a nootropic looked down upon?", "replies": {"g4gjxx7": {"score": 2, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4gjxx7/", "is_submitter": false, "created": 1599614697.0, "body": "Because of the abuse and dependency liability. One anecdote I heard was that when a certain vendor sold out or discontinued it people got really upset/sent tons of emails because they were physically addicted and didn't have a source anymore. Can't blame them at all, especially if they didn't realize the ramifications of chronic high dose use. Generally nootropics are supposed to be cognitive/life enhancing without being in the same category as drugs that get you \"high\" (which is why phenibut has a lot of warnings around it on nootropics posts currently).\n\nIt's a weird situation because there are no firm categorizations, it ends up coming down to perception. Things that are perceived as cognitive enhancing/making people more productive/healthier/happier/not associated with typical drug abuse behaviors = nootropic, anything where the verbage/associations change to be more like traditional drugs the community tends to shun. \n\nFor that reason people are generally more accepting of the Sulfate form of Tianeptine as a nootropic because it has a very long duration of action, very little peak, maintains a lot of the mood lifting/cognition enhancing/anxiolytic effects without more extreme euphoria, and doesn't facilitate compulsive redosing.", "replies": {"g4i039y": {"score": 1, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4i039y/", "is_submitter": false, "created": 1599640986.0, "body": "Thanks for that info and clarify that! Makes sense", "replies": {}}}}, "g4figyb": {"score": 1, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4figyb/", "is_submitter": false, "created": 1599592060.0, "body": "My guess is because it's addictive.", "replies": {"g4fks8n": {"score": 1, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4fks8n/", "is_submitter": false, "created": 1599594188.0, "body": "makes sense. is sulfate seen the same way? i don't think that one is abused as much as sodium", "replies": {}}}}}}}}, "g4f5sz5": {"score": 4, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4f5sz5/", "is_submitter": false, "created": 1599578081.0, "body": "I can get tianeptine OTC in my country lol", "replies": {}}, "g4hbnml": {"score": 2, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4hbnml/", "is_submitter": false, "created": 1599628569.0, "body": "When I wanted to try a \"big\" dose of tianeptine sodium I took around 70-85mg. It completely fucked my life up, wish I never touched the stuff.\n\n\nDosed it May 23rd last year and I haven't been the same since.\n\nI have really bad anxiety now. It has gotten better tho, but I'm far from being my normal self :(", "replies": {"g4iafi2": {"score": 3, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4iafi2/", "is_submitter": true, "created": 1599646785.0, "body": "was it that single dose that left you with lingering problems or did that start a cycle of use? As I feel perfectly fine 2 days later", "replies": {"g4ih66u": {"score": 1, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4ih66u/", "is_submitter": false, "created": 1599650809.0, "body": "That dose was all it took for me to get fucked up. On the bright side, it made me go for a sober life :)", "replies": {}}}}}}}}, "et3qq5": {"text": "Hello sorry I know this is not the right place to ask but there are a lot of very intelligent individuals on the pharmacology subject in here and quite simply my brain is just zapped from sleep deprivation and I can't seem to find the awnser I'm looking for.\n\nI suffer with insomnia, now the normal route would be to look towards benzodiazepines to help with this but I am prescribed oxycodone for my chronic pain and benzos are out the question! \nBut what about the \" z-drugs \" zopiclone etc etc do they have an adverse effect with opiods?\nWould just like a bit of scope on this subject before seeing my doctor.\nThank you", "author": "junkyjesus2020", "score": 2, "flair": null, "created": 1579861189.0, "url": "https://www.reddit.com/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/", "num_comments": 17, "title": "Just need a little help I cant find by googling.", "subreddit": "researchchemicals", "comments": {"ffe0tzr": {"score": 5, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe0tzr/", "is_submitter": false, "created": 1579862578.0, "body": "I believe most sleep drugs that act on GABA cause respiratory depression and shouldn't be mixed with opiates. \n\nThe correct sleep aids to take with a respiratory depressant, are called H1 antagonists. They are used for insomnia and allergies. Hydroxyzine is the go-to for insomnia and sleep due to it having a longer duration than Benadryl(diphenhydramine), but Benadryl works as well.", "replies": {"ffe19gw": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe19gw/", "is_submitter": true, "created": 1579862893.0, "body": "Thank you very much I knew there would be some helpful information on this thread. I will have a look in to H1s", "replies": {"ffe1fvu": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe1fvu/", "is_submitter": false, "created": 1579863019.0, "body": "Doctors regularly prescribe them since they aren't classified as addictive,so it's very easy to acquire some to try out. For me it was as simple as telling my doc I'm tired at work and toss and turn and that was all he needed to know to give me a months script to try out of 25mg hydroxyzine.", "replies": {"ffe1pzh": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe1pzh/", "is_submitter": true, "created": 1579863217.0, "body": "I have a big history with heavy meds with the doctor and a I have a respiratory problem also so they are very weary of what to prescribe me, but the biggest issue is finding a doctor that is happy to discuss what out there with you. Most get there back up when you start questioning what they recommend and most are not willing to discuss your ideas or reasoning to why you want to try x y or z", "replies": {"ffe1ux7": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe1ux7/", "is_submitter": false, "created": 1579863320.0, "body": "If you have a compromised respiratory system, then anything the produces sedative effects will increase the chance of respiratory side effects. I'd imagine this is related to brain wave patterns being inhibited while on a sedative.", "replies": {"ffe1xng": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe1xng/", "is_submitter": true, "created": 1579863373.0, "body": "I have sleep apnea so it's an issue during sleep. \nIt's an odd one as sleep apnea can cause insomnia", "replies": {"ffe256y": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe256y/", "is_submitter": false, "created": 1579863531.0, "body": "That's a tough situation you're in. Sleep apnea, on opiates, and having trouble sleeping... \n\nI think the only risk free option here would be supplementing light things like magnesium or melatonin as a sleep aid, as well as exercising to increase physical exhaustion at night, not eating before bed time, etc.", "replies": {"ffe2f9x": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe2f9x/", "is_submitter": true, "created": 1579863737.0, "body": "Yeah it's a right fuckery!!!!.\nI have tried most natural sleep aids with no real benefit and I have had to stop working due to an extremely bad patch with my back and this has knocked any exercise on the head too. You can see.my predicament now!!! Motorbikes are all fun and games till a car takes you out at 60 And flips your life upside down lol", "replies": {}}}}}}}}}}}}}}, "ffe1dvw": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe1dvw/", "is_submitter": true, "created": 1579862981.0, "body": "Only red flag I see is promethazine on the h1 list", "replies": {"ffe1moc": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe1moc/", "is_submitter": false, "created": 1579863150.0, "body": "Promethazine is actually most commonly used, along side of an opiate.. in the form of Codeine cough syrup.  And they use promethamize in hospitals alongside IV'd opiates to combat the nausea produced by the opiate.", "replies": {"ffe1udi": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe1udi/", "is_submitter": true, "created": 1579863308.0, "body": "Amazing as it's a massive potentizer for opiates", "replies": {"ffe1z4o": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe1z4o/", "is_submitter": false, "created": 1579863404.0, "body": "Indeed it is. Most street heroin that's been stepped on contains H1 antagonists, typically Benadrylas it's so easy to acquire. Many junkies even cut their own heroin with Benadryl to stretch out their doses.", "replies": {"ffe249v": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe249v/", "is_submitter": true, "created": 1579863512.0, "body": "That's what they call \" cheese \" If my memory surves me correctly.\n\n\nBut if they are happy to prescribe a potentizer like the H1, why not benzodiazepines.\nThey heighten the effect of opiates in the same way if I'm not mistaken. Seems odd", "replies": {"ffe298s": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe298s/", "is_submitter": false, "created": 1579863613.0, "body": "Lol yeah I do believe I've heard it called that once or maybe twice. \n\nThe difference between benzos and H1 antagonists is publicity. Benzos have a bad rep. And they also are much more addictive than H1 antagonists.", "replies": {"ffe2o9z": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffe2o9z/", "is_submitter": true, "created": 1579863923.0, "body": "\"Hey dope boy have you got that cheader?\" Lol\nAh so the addictive element might be the catalyst in this.\nBut a issue I come across doctors seem to think I'm drug hunting because I walk in with specific drugs to discuss", "replies": {}}}}}}}}}}}}}}, "ffea0sn": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffea0sn/", "is_submitter": false, "created": 1579869656.0, "body": "Yup i found this to be the money knock you out at any time combo, well benzos, bud, diphenhydramine and or melatonin. Suprisingly melatonin works lovely albeit, i’ve been stimmed out and have had psychosis like dreams! I have to do a dream report. That shit was heavy. And i rarely remember dreams without melatonin it’s nice, feels like I have more experiences and time alive when i dream, Otherwise i feel like I’m losing 8-10 hours of my awake time", "replies": {"ffjpnhs": {"score": 1, "link": "/r/researchchemicals/comments/et3qq5/just_need_a_little_help_i_cant_find_by_googling/ffjpnhs/", "is_submitter": true, "created": 1580032600.0, "body": "Thank you for your input, I have found promethazine now to be very helpful! And also gives the oxycodone a lil boost that's always welcome", "replies": {}}}}}}}}, "fy6lgx": {"text": "Hey r/RCs, I'm feeling really good off ~15mg of this substance, taken intranasally. It feels really good, reminds me of when I chewed up tiny pieces of a fentanyl patch. It's on par with oxycodone honestly. My only issue was the burn from snorting it and what I've read about it's toxicity/caustic properties. For reference, I've never been addicted to opioids and have no tolerance to them right now, and I definitely feel this. I've tried most opiates -- codeine, hydrocodone, oxycodone, morphine, heroin, fentanyl -- just for reference. This one is definitely a worthy opiate. Short duration though. I'm open to ROA suggestions, I heard sublingual is the best.\n  \nEdit: Redosed 30mg like 25 minutes ago. Nodded really hard but have come out of it already, still feeling good. This drug requires frequent redosing to maintain nod, but the nod was so fucking good. I'm pretty happy with my purchase.", "author": "silverexe", "score": 4, "flair": null, "created": 1586515448.0, "url": "https://www.reddit.com/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/", "num_comments": 15, "title": "2-Methyl-AP-237 Initial Thoughts", "subreddit": "researchchemicals", "comments": {"fmyt9qc": {"score": 3, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmyt9qc/", "is_submitter": false, "created": 1586523890.0, "body": "Nice. Too bad it's too caustic to boot or iv", "replies": {"fmz77qi": {"score": 2, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz77qi/", "is_submitter": false, "created": 1586537927.0, "body": "Its really not to caustic to boof", "replies": {}}, "fq587kt": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fq587kt/", "is_submitter": false, "created": 1589124581.0, "body": "I actually doesn’t burn IV assuming you don’t miss", "replies": {}}}}, "fn3ymto": {"score": 3, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fn3ymto/", "is_submitter": false, "created": 1586659302.0, "body": "It’s more euphoric than the afghan Heroin but the duration sucks. Can’t touch china white #4 tho...", "replies": {}}, "fmyxh5r": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmyxh5r/", "is_submitter": false, "created": 1586527646.0, "body": "Have you tried it orally?", "replies": {"fmyzkcy": {"score": 2, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmyzkcy/", "is_submitter": true, "created": 1586529707.0, "body": "No, I didn't make myself as clear as I could have. This is my first time ever taking this substance. I was able to maintain a pretty nice nod by redosing 20-30mg lines every 30 minutes. I'm done for the night though, don't wanna go too far. I feel like I went a little hard for having no opiate tolerance, but man it felt great, and I was with a friend in case I over did it. Haven't felt the nods like this since snorting heroin a few years ago.", "replies": {"fmz5kd5": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz5kd5/", "is_submitter": false, "created": 1586536054.0, "body": "Ok that has me very excited to try it out soon. Have you used ODSMT before? I imagine even if you had it doesn't compare to many of the other opiates you have used. I recently got a gram of both 2methylap237 and ODSMT so I am trying to compare and figure out ROA's and dosage.", "replies": {"fmz7apb": {"score": 2, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz7apb/", "is_submitter": false, "created": 1586538022.0, "body": "For the best effects i would snort 2map237. Its a fuckin insane euphoric high. But i would not suggest to snort it that often.", "replies": {}}, "fmz75o6": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz75o6/", "is_submitter": false, "created": 1586537862.0, "body": "boof odsmt, 2map i'd just eat.", "replies": {"fmz76g9": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz76g9/", "is_submitter": false, "created": 1586537886.0, "body": "Makes sense considering how caustic I have heard 2map is.", "replies": {"fmz77jh": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz77jh/", "is_submitter": false, "created": 1586537922.0, "body": "down it with milk and or ice cream, its lipophilic.", "replies": {"fmz7dde": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz7dde/", "is_submitter": false, "created": 1586538107.0, "body": "Is that to make it more effective or to counteract the caustic nature of it?", "replies": {"fmz7hsh": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz7hsh/", "is_submitter": false, "created": 1586538243.0, "body": "helps the causticity, and probably a bit of effectiveness but I have no proof. But damn did it sure help my stomach doing it that way! Felt just cleaner all around.", "replies": {"fmz7lnc": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz7lnc/", "is_submitter": false, "created": 1586538366.0, "body": "Ok cool sounds interesting. What would you recommend as a good first time dose?", "replies": {"fmz7ptl": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz7ptl/", "is_submitter": false, "created": 1586538495.0, "body": "zero tolerance to any opi/kratom? and possibly low low experience?   \n7-10mg. You can always take more and you will, that will give you a base of how you react (after allergy test) and how much more or not you want. At 10mg it was quite noticeable for me. So much so I thought i may have over did, this was long long ago when no info was out.", "replies": {}}}}}}}}}}}}}}}}}}}}}}, "hnqlg1": {"text": "Most reviews on 2MAP237 I have seen are from users who have little to no tolerance so thought I'd share my opinions.\n\nI am a 200 LB male who has been using some form of Opioid for the last decade or so. For the past year I have been taking about a red solo cup worth of high quality Poppy seeds daily -- I would guestimate this would be equivalent to around 15mg of Oxycodone. To get a nice buzz and a bit of a nod from the seeds I take 2-3 solo cups worth or 40-50mg of Oxy.\n\nI got my first gram of 237 a few days ago and have been really pleased with the results. I have been dosing 100-150 mg orally at a time and it gives me a nice classic opiate high. Effects come on about 30 mins after ingestion and then starts to taper off around an hour or so after but still have a nice glow for 2-3 hours.\n\nIt would be nice if it had longer legs, I have been reading a new compound called AP 238 lasts a bit longer but has a little different high - has anyone tried this yet?\n\nI have had no issues with my stomach or anything like I have read about. Mine doesn't smell like gasoline but I guess would have the cheese smell as others have mentioned.\n\nAnyways I have been pleasantly surprised with this compound and look forward to further testing.  I plan to continue the seeds since they are pretty cheap and a single dose lasts 24 hours but 237 is nice to have on hand", "author": "LsDmT", "score": 16, "flair": null, "created": 1594274510.0, "url": "https://www.reddit.com/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/", "num_comments": 15, "title": "Thoughts on 2-Methyl-AP-237 from a daily Opioid user", "subreddit": "researchchemicals", "comments": {"fxdhz46": {"score": 9, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxdhz46/", "is_submitter": false, "created": 1594285020.0, "body": "Be careful with this shit, it seems to be insanely caustic. The problems associated with how damaging it is seem to come on extremely fast and seemingly out of nowhere, so while it may seem like it hasn’t caused any problems it very well still could have. \n\nA friend of mine used some a few different ROAs, also a batch without that gasoline smell that seems relatively clean (as far as one can possibly tell from smell and appearance) and just two uses nasal left his nasal cavities looking terrifying and a few oral uses caused severe gastric pain. These problems have gone away since stopping use but they came on so fast and so strong it was worrying.\n\nJust be careful is all!", "replies": {"fxgzc9a": {"score": 2, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxgzc9a/", "is_submitter": true, "created": 1594362557.0, "body": "Yup, only oral for me.  Still no stomach issues so far.", "replies": {}}}}, "fxd8xvr": {"score": 5, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxd8xvr/", "is_submitter": false, "created": 1594279873.0, "body": "yeah 238 is nice can't compare it to anything, don't use opiates\n\nmade a post about it", "replies": {}}, "fxdejwt": {"score": 3, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxdejwt/", "is_submitter": false, "created": 1594283062.0, "body": "I prefer 2map237. 238 just doesn’t have much rush for me.", "replies": {}}, "fxdgfkg": {"score": 2, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxdgfkg/", "is_submitter": false, "created": 1594284136.0, "body": "map237 has that RUSH 238 not so much, and lasts maybe an hour longer.", "replies": {"fxdwg15": {"score": 4, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxdwg15/", "is_submitter": false, "created": 1594293476.0, "body": "so combine 237 and 238 and you have a great legal opiate cocktail.", "replies": {}}}}, "fxgz5dh": {"score": 1, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxgz5dh/", "is_submitter": false, "created": 1594362458.0, "body": "When You dose 100-150mg per time. What amount of time do you let go by to where you can redose with close to the same effects?  \n\nI’m finding that if I measure 120mg and add 30-40mg every 20mins or so a few times it gets me where I need to be. I haven’t tried just researching one dose in the morning and waiting to dose again at like 4pm and seeing if that might be more effective", "replies": {"fxgz9fk": {"score": 1, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxgz9fk/", "is_submitter": true, "created": 1594362517.0, "body": "I've been taking the dose around 8AM and then the next around 3PM", "replies": {"fxgzddf": {"score": 1, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxgzddf/", "is_submitter": false, "created": 1594362573.0, "body": "Ok cool. And that timeframe makes the effects have roughly the same impact?\n\nEdit- sometimes redosing too soon doesn’t really add much so I’m trying to figure out when the optimal time would be", "replies": {"fxgzg7q": {"score": 1, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxgzg7q/", "is_submitter": true, "created": 1594362613.0, "body": "Yup, although today after the 3rd day in a row I can tell tolerance is building.  I think it's time to take a few days break.", "replies": {"fxgzohc": {"score": 1, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxgzohc/", "is_submitter": false, "created": 1594362730.0, "body": "Have you  figured out a rough half-life of this compound? I know the effects window is a few hrs. But as far as elimination half life do we have any ideas?\n\nThx again 👍", "replies": {"fxh00bx": {"score": 1, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxh00bx/", "is_submitter": true, "created": 1594362901.0, "body": "No idea but its gotta be short.", "replies": {"fxh09xw": {"score": 1, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fxh09xw/", "is_submitter": false, "created": 1594363042.0, "body": "Ya that’s what I was thinking as well. Be good to have a number on it tho even if it’s just an estimate", "replies": {}}}}}}}}}}}}}}, "fy9wbvq": {"score": 1, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/fy9wbvq/", "is_submitter": false, "created": 1594950623.0, "body": "I have tried ap-238 and 237. The 238 imo is not worth the extra money. It is more euphoric but lacks pain relief and sedation. It barely has a longer duration and potency is only a bit higher. If you like opioids that are stimulating this like oxy you might like this one more but I enjoy ones with higher pain relief and sedation like morphine", "replies": {}}, "g7awb6q": {"score": 1, "link": "/r/researchchemicals/comments/hnqlg1/thoughts_on_2methylap237_from_a_daily_opioid_user/g7awb6q/", "is_submitter": false, "created": 1601599212.0, "body": "so- as both a seed user AND and oxy user- my question to you is- in the two months since you posted this, what was your experience?  Something that I might want to look into or.... not so much?  -Thanks", "replies": {}}}}, "i5krxx": {"text": "So I want to mix either 2fdck or dck with 2map237 and odsmt into a liquid syrup for sublingual/oral dosing.\nThe amount of dck or 2fdck will be very little. This is for a pain relieving syrup that surpasses normal pain relief all in one dose.\n\nMy planned amounts in the syrup \n25mg odsmt\n10mg 2map237\n5/10mg of dck or 2fdck\nAll mixed in 30ml (1flzo 2 tablespoons) of simple syrup with a small amount pg \n\nMy plan is to dose only 1 tablespoon so only 2.5/5mg dck or 2fdck, 12.5mg odsmt, and 5mg \n2map237 \n\nMy tolerance is 15mg oxycodone and with dxm its usually 450mg to 900mg depending on how deep I want to go. I have mixed dxm and opium or oxycodone multiple times.\n\nThe doses of dxm and opium was about 354mg to 450mg to 709mg to 900mg\nAnd oxycodone 10mg and 450mg to 900mg dxm \nI usually dose the dxm and opium at different times with various results but I always notice an increased amount of pain relieved at the normal opium/oxy dose. I also have gotten very positive results in using 60mg to 90mg of dxm an hour before a dose of opioids to potentate.\n\nWould it be safe in anyway to mix this small amount of dck or 2fdck (2.5/5mg) per dose with odsmt and 2map237", "author": "White_smoke2", "score": 3, "flair": null, "created": 1596858774.0, "url": "https://www.reddit.com/r/researchchemicals/comments/i5krxx/question_about_combos/", "num_comments": 14, "title": "Question about combos", "subreddit": "researchchemicals", "comments": {"g0psnxt": {"score": 4, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g0psnxt/", "is_submitter": false, "created": 1596859214.0, "body": "Sounds like a weird concoction...!!!   One that I would never attempt.....   but most likely you'll be ok with such a low dose....", "replies": {"g0pt36k": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g0pt36k/", "is_submitter": true, "created": 1596859416.0, "body": "Yeah I wanna keep the dose at bare threshold amounts because I know dissos make opioids stronger and they cause a decent amount of pain relief themselves but I just want to know how safe this would be considering they use ketamine with morphine during surgery", "replies": {"g0pthxh": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g0pthxh/", "is_submitter": false, "created": 1596859613.0, "body": "I'm no doctor..    but i would think you'd be fine", "replies": {"g0pw1ng": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g0pw1ng/", "is_submitter": true, "created": 1596860857.0, "body": "What is your experiences with dck or 2fdck alone and what doses do you find active", "replies": {"g0qyx22": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g0qyx22/", "is_submitter": false, "created": 1596881458.0, "body": "Not to hijack but I started with around 30mg 2fdck and it was definitely active. Like about as active as 2-3 shots of alcohol (no tolerance).", "replies": {"g10g4ei": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g10g4ei/", "is_submitter": true, "created": 1597108908.0, "body": "I've seen some take 1 shot of fireball (this dude's first time drinking) and about 15 minutes later he says \"I feel unicorns coming out of my penis.\" I laughed for at least half a hour", "replies": {}}}}}}}}, "g0rdtdj": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g0rdtdj/", "is_submitter": false, "created": 1596890782.0, "body": "Yes, but they have equipment to monitor your vital signs when they give you that in a hospital. They also can quickly fix the situation if you start struggling to breathe. You don't have and can't do all that.\nThey give you routinely fentanyl with midazolam in hospitals for minor procedures where you don't need general anesthesia. Doesn't mean it's safe to combine those two substances outside of a hospital setting. \nI'd tell someone what you plan to do just so you can have assistance quickly if any problems arise and stick to the lowest dosages you can. \nYou'll probably be ok but still practise harm reduction.", "replies": {"g0urgj9": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g0urgj9/", "is_submitter": true, "created": 1596969858.0, "body": "That's why my dose listen is at threshold amounts so I dont have any issues. And yes someone will know that I will be consuming this.", "replies": {}}}}}}}}, "g0r0jzk": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g0r0jzk/", "is_submitter": false, "created": 1596882399.0, "body": "I just got an order in of some 2map, odsmt, 2fdck, and ap238. I have combined them all. Not really all at once, but within hours and on my 2fdck comedown. I don't really feel any of those after the 2fdck honestly. I mean I guess it kinda helps with the comedown just slightly. My doses are wayyy higher tho. And I've tried every roa as well on all of them. Other night I did about 75mg 2map, 150mg odsmt, and 25mg ap238. All in one shot. IV. It's not super strong to me. I feel it for sure and tolerance is only 2mg/bupe daily right now, but haven't been taking it. About an hour after my shot. I did about 50mg 2dck, IV as well, just to try IV. I love it honestly, but other ROAs are good too. Overall fairly enjoyable. Also did another 75mg 2 map once the 2f wore off to help me get to sleep", "replies": {"g10fsyb": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g10fsyb/", "is_submitter": true, "created": 1597108755.0, "body": "Thanks for your report man and also I've always wondered what the \"rush\" of a disso would be like. I've only have iv in hospital but holy shit I love the rush of anything almost", "replies": {}}}}, "g0uadf7": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g0uadf7/", "is_submitter": false, "created": 1596960191.0, "body": "I don't know that you'd get much more out of mixing the o-dsmt and 2map together than just using an equivalent dose of one of them with the 2fdck. \n\nI'm sure if you're just going for pain relief using one of them would suffice and i'm sure in the right proportions you would get more pain relief with the addition of the 2f-dck. I'd be interested to hear how it goes.\n\nBut is simple syrup going to be able to distribute the substances evenly? I would be skeptical of dissolving such small amounts into something like syrup.", "replies": {"g0uraf8": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g0uraf8/", "is_submitter": true, "created": 1596969753.0, "body": "I have made a cannabis simple syrup before I normally give it a nice shake but I use alcohol in the simple syrups I make for substances", "replies": {"g0vg2yj": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g0vg2yj/", "is_submitter": false, "created": 1596988714.0, "body": "Cool. What are the proportions of sugar to water to alcohol that you use?", "replies": {"g10ffjd": {"score": 1, "link": "/r/researchchemicals/comments/i5krxx/question_about_combos/g10ffjd/", "is_submitter": true, "created": 1597108579.0, "body": "If I make 30floz total i would use 12floz water 10floz of 151 proof or higher and 8oz sugar", "replies": {}}}}}}}}}}, "j713kd": {"text": "I ordered a gram of ap238 and was wondering what you think of it compared to oxycodone/hydrocodone. I have no opioid tolerance and am completely new to this substance", "author": "1212googloo", "score": 0, "flair": null, "created": 1602139170.0, "url": "https://www.reddit.com/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/", "num_comments": 14, "title": "What do you think of ap238?", "subreddit": "researchchemicals", "comments": {"g821wza": {"score": 3, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g821wza/", "is_submitter": false, "created": 1602143155.0, "body": "Extremely caustic and you should've got ODSMT lol", "replies": {"g822kto": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g822kto/", "is_submitter": true, "created": 1602143547.0, "body": "That's what I was thinking but I wanted something that was going to knock my dick in the dirt", "replies": {"g822rz6": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g822rz6/", "is_submitter": false, "created": 1602143664.0, "body": "Then u got the wrong substance", "replies": {"g822u5u": {"score": 2, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g822u5u/", "is_submitter": true, "created": 1602143699.0, "body": "Odsmt for the future then?", "replies": {}}, "g8233v0": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g8233v0/", "is_submitter": false, "created": 1602143852.0, "body": "But isn't ap238 much stronger than odsmt", "replies": {"g823kgd": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g823kgd/", "is_submitter": true, "created": 1602144123.0, "body": "Damn, I wish I would have known that. Health over anything lol. Oh well, 1 gram cant do too much damage", "replies": {"g823o03": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g823o03/", "is_submitter": false, "created": 1602144181.0, "body": "Yeah u will be fine odsmt a banger tho", "replies": {"g823re3": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g823re3/", "is_submitter": true, "created": 1602144235.0, "body": "Bet. I'll try that in the future then!", "replies": {}}}}}}}}}}}}}}, "g825tnd": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g825tnd/", "is_submitter": false, "created": 1602145407.0, "body": "left me w some bloody boogers and dry sinuses for like 3-4 days after a couple doses in a night. i didnt really find the high to be anything worthy enough to outweigh the cons. will never buy another gram. \n\nlike other poster said, next time get some ODSMT to try", "replies": {"g8263gj": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g8263gj/", "is_submitter": true, "created": 1602145563.0, "body": "Yeah I'm talking it orally for sure but I was unaware it was so caustic", "replies": {"g826bkc": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g826bkc/", "is_submitter": false, "created": 1602145694.0, "body": "from what ive read and my own experience it wasnt AS damaging to some people. at least not as caustic as i wouldve made it out to be. theres also a post on here somewhere where a guy boofed his dose and got some rectal bleeding. i used the last little bit i had orally and didnt seem to have any issues from it", "replies": {"g826xnk": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g826xnk/", "is_submitter": true, "created": 1602146045.0, "body": "Yeah I just read on the website I was buying from \"medicine used in china\" and \"5x stronger than morphine\" and I just went Ooooo I gotta have some xD I've had tramadol before and I know that's a lighter opiate so that's why i went with ap thinking it was the stronger one. I definitely dont want to risk health over high though so this will probably be my first and last gram", "replies": {"g8299n2": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g8299n2/", "is_submitter": false, "created": 1602147379.0, "body": "You gotta do your research g. Odsmt would be perfect for someone in your shoes", "replies": {"g83xqyj": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g83xqyj/", "is_submitter": false, "created": 1602194595.0, "body": "That ap238 looks so promising though and then everyone says ita trash. I hear 2map237 is better but this particular batch is supposed to be trash too", "replies": {}}}}}}}}}}}}}}, "i1f307": {"text": "So the reason I need the advice is this: My dogs never used a synthetic opioid, but with real ones Codeine does not work at all for her, apparently her body does not convert it to Morphine also Oxycodone does not seem to have any real effect on her either, for example Percocet does nothing for her. What I know works for her well is Hydrocodine which Shes had in the form of Vicodin, and straight morphine has always helped while She’s been in the hospital.  She has a degenerative spinal condition that’s excruciating and I want to try this route, any recommendations for the info I’ve expressed would be greatly appreciated!", "author": "sntripod", "score": 3, "flair": null, "created": 1596256649.0, "url": "https://www.reddit.com/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/", "num_comments": 13, "title": "Need a little advice on which to get, AP-237, AP-238, O-DMST or O-AMKD?", "subreddit": "researchchemicals", "comments": {"fzwrlqk": {"score": 4, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/fzwrlqk/", "is_submitter": false, "created": 1596256794.0, "body": "I'm sure a vet can give ur dog pain meds, all these r bad options for dogs or humans. Well ODSMT isn't that bad for humans I guess.", "replies": {"fzx45qa": {"score": 3, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/fzx45qa/", "is_submitter": false, "created": 1596261092.0, "body": "[deleted]", "replies": {"fzxo0tm": {"score": 1, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/fzxo0tm/", "is_submitter": true, "created": 1596269283.0, "body": "Ok thank you for that info, but what if ACTUAL Tramadol is not effective? Would the O-DMST even work?", "replies": {}}}}}}, "fzxr7h5": {"score": 1, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/fzxr7h5/", "is_submitter": false, "created": 1596270881.0, "body": "If it’s an option, I would get 2-MAP(heard a lot of good reviews). But I would choose O-DSMT because it works fantastically according to a lot of reviews for Euphoria and possibly would do the same as Tramadol(which is used in a hospital setting) for pain, and is more widely recognized it seems than O-AMKD.", "replies": {"fzy3qly": {"score": 1, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/fzy3qly/", "is_submitter": false, "created": 1596278364.0, "body": "[deleted]", "replies": {"fzz50t6": {"score": 1, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/fzz50t6/", "is_submitter": true, "created": 1596310945.0, "body": "That’s my only concern about the O-DSMT, I’ve done a lot of research and asked around, and this seems to be the winner, BUT if Tramadol doesn’t work, will O-DSMT? Are they almost identical in structure? If they are technically the same, but Tramadol is ineffective, then wouldn’t O-DSMT also be ineffective?", "replies": {"g00t9yt": {"score": 2, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/g00t9yt/", "is_submitter": false, "created": 1596344350.0, "body": "[deleted]", "replies": {"g00yjv3": {"score": 1, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/g00yjv3/", "is_submitter": true, "created": 1596347353.0, "body": "Ok perfect man, that’s what I really was wanting to know.  How does it compare to let’s say Vicodin, or like 40 mg of Hydrocodone, if you have any ideA? Thank you too!", "replies": {"g00zfbr": {"score": 2, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/g00zfbr/", "is_submitter": false, "created": 1596347847.0, "body": "[deleted]", "replies": {"g012g2a": {"score": 1, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/g012g2a/", "is_submitter": true, "created": 1596349589.0, "body": "Oh ok great! Last question then, what would be the starting dose of O-DMST if not currently taking any opiates? If you have any idea.", "replies": {"g013ls8": {"score": 2, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/g013ls8/", "is_submitter": false, "created": 1596350262.0, "body": "[deleted]", "replies": {"g017owg": {"score": 1, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/g017owg/", "is_submitter": true, "created": 1596352667.0, "body": "Haha, thanks so much, I really appreciate all your help, I’m completely confident in this right now, thanks again!", "replies": {}}}}}}}}}}}}}}}}}}, "g06ptkn": {"score": 1, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/g06ptkn/", "is_submitter": false, "created": 1596468169.0, "body": "Maybe too late but idk if I’d risk this wirh my little dude. Mine actually takes a gram (he’s 50lbs) of kratom", "replies": {"g070my7": {"score": 2, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/g070my7/", "is_submitter": true, "created": 1596479348.0, "body": "Thanks man, and I think I already mentioned it, but yeah Kratom has been fantastic for the both of us for the last 5 years, unfortunately as of the last year or so it has only become effective in taking the edge off, but not even coming close to getting rid of the chronic pain.  No healthcare or anything for the both of us, so looking into this route!", "replies": {}}}}, "fzws28w": {"score": 1, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/fzws28w/", "is_submitter": true, "created": 1596256993.0, "body": "Lol, ok which is best for people than? O-DMST? Why?", "replies": {"fzxng5k": {"score": 1, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/fzxng5k/", "is_submitter": false, "created": 1596268999.0, "body": "O-DSMT probably. I've gone through a couple grams so far with no real bad effects. Tramadol is widely used and not especially dangerous, and O-DSMT is a metabolite anyway.\n\n2M-AP-237 seems too short acting and physically harmful. AP-238 is too new (and probably also bad in some ways). I also don't know much about O-AMKD.\n\nI feel like kratom is one of the best options for self-medicating pain as it's relatively safe, but some don't find it to be strong enough.", "replies": {"fzxo6en": {"score": 1, "link": "/r/researchchemicals/comments/i1f307/need_a_little_advice_on_which_to_get_ap237_ap238/fzxo6en/", "is_submitter": true, "created": 1596269361.0, "body": "Yes for Kratom!! Unfortunately it has only become effective for taking the edge off, but no real painkilling anymore!", "replies": {}}}}}}}}, "emr6f4": {"text": "I'm on ssris, and so far have been sticking to primarily dopaminergic stims like 2-fma and now 3-fpm. \n\nBut I'm wondering if meth is supposedly fine with ssris anecdotally with people, which one would be closer to meth and the least serotonergic?\nWould 4-fma or even 3-fma be just like in terms of taking meth on ssris with serotonin activity with those two?\n\n\nI know 2-fma and 3-fpm are for sure fine... And I like 3-fpm but I rather stick to amphetamine devrived molecules.\n\n\nWhich one out of the two should be fine to use on SSRIs? if meth is used with SSRI users.\n\n\nDrug interactions checker warns SS with general amphetamines, but the realistically it's quite rare,  same with oxycodone. Where tripsit doesn't consider it a practical concern.", "author": "guacatmole", "score": 3, "flair": null, "created": 1578693095.0, "url": "https://www.reddit.com/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/", "num_comments": 13, "title": "Which would be the least serotonergic? 4-fma or 3-fma?", "subreddit": "researchchemicals", "comments": {"fdql91s": {"score": 1, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdql91s/", "is_submitter": false, "created": 1578698166.0, "body": "It's possible, but you've got to do like 1 gram in 30 mins", "replies": {"fdqley0": {"score": 1, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdqley0/", "is_submitter": true, "created": 1578698277.0, "body": "So in general, both should be fine on an SSRI just as meth, 2-fma and 3-fpm is?\n\nObviously no heroic doses at once...", "replies": {"fdqt927": {"score": 2, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdqt927/", "is_submitter": false, "created": 1578703189.0, "body": "Apparently the risk of mixing serotonin releasers with SSRIs actually isnt that big and it's mainly MAOi's that put you at risk of SS\n\nGot into this with someone the other day and had most of my preconceieved notions disproven\n\n\n\nStart low but you should be fine with either of these", "replies": {"fdqu6ox": {"score": 1, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdqu6ox/", "is_submitter": true, "created": 1578703753.0, "body": "If I recall correctly though, 4-fma and 3-fma are not major serotonin releasers anyways that they should be fine with SSRIs? Similar to methamphetamine or general amphetamines. Mostly dopamine and NE?", "replies": {"fdquff6": {"score": 2, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdquff6/", "is_submitter": false, "created": 1578703873.0, "body": "Correct, their effect on sert should be negligable from what Ive read\n\n\n\nBut I was just saying that the common knowledge of \"SSRI+SRA=SS\" isnt backed up by science and Ive now seen several anecdotes saying that the former just blocks the latter like with psychedelics", "replies": {"fdqv069": {"score": 1, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdqv069/", "is_submitter": true, "created": 1578704006.0, "body": "Oh! so you were saying that on the side with stuff like MDMA ect?\n\nTIL! Thank you :)", "replies": {"fdqvvpk": {"score": 1, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdqvvpk/", "is_submitter": false, "created": 1578704410.0, "body": "Do your own research and use EXTREME caution, but yeah basically. My preconceived understanding still scares me too much to be like \"yyeaah its fiiine\" but it isnt a death sentence I guess", "replies": {"fdqwt64": {"score": 1, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdqwt64/", "is_submitter": true, "created": 1578704807.0, "body": "Definitely don't plan doing anything like that anyways.\n\nJust the safe ones like the ones in the post or amphs.", "replies": {}}}}}}}}}}}}}}}}, "fdztm7f": {"score": 1, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdztm7f/", "is_submitter": false, "created": 1578824303.0, "body": "Generally 3s are more seretogenic then 4s but neither of those have a lot of action on seretonin receptors. I'd go with 2-FMA or 4-FMA if you're using it regularly.", "replies": {}}, "fdr79d2": {"score": 1, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdr79d2/", "is_submitter": false, "created": 1578709280.0, "body": "3-fpm *is* a substituted amphetamine.", "replies": {"fdrfv9h": {"score": 2, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdrfv9h/", "is_submitter": false, "created": 1578712777.0, "body": "Kind of, how many rings can you close and add before it stops being an amphetamine? I mean lsd technically contains the amphetamine backbone too", "replies": {"fdsgenu": {"score": 1, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdsgenu/", "is_submitter": false, "created": 1578731012.0, "body": "You know, I have no idea how many changes it takes before a substituted drug becomes more than just the backbone it was based off of, but if you look at phenmetrazine or 3-fpm, they're like a cross between amphetamine/3-fa and pseudoephedrine/3-fluoropseudoephedrine except with a closed morpholine ring connecting the beta-methyl to the amine. Seems like it has similar MOAs as well leading me to believe 3-fpm's SAR is probably similar (but not exactly the same) as 3-fa.", "replies": {"fdslwbg": {"score": 2, "link": "/r/researchchemicals/comments/emr6f4/which_would_be_the_least_serotonergic_4fma_or_3fma/fdslwbg/", "is_submitter": true, "created": 1578733692.0, "body": "Didn't know phenmetrazine was that close to amphetamines!\n\nTIL! :)", "replies": {}}}}}}}}}}, "fm9jzk": {"text": "If so was it enjoyable? The concept of combining opioids with dissociatives interested me at some point but I never had my hands on any good dissociatives when I was using opioids more often, this particular idea of combining 3-meo-pcp with around 40mg of ER oxycodone came to me last night when my first shipment of 3-meo came in from the UK and I felt the smooth stimulation for the first time.", "author": "bored_4chan_user", "score": 3, "flair": null, "created": 1584794704.0, "url": "https://www.reddit.com/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/", "num_comments": 10, "title": "Anyone combine 3-meo-pcp with opioids?", "subreddit": "researchchemicals", "comments": {"fl35g4q": {"score": 3, "link": "/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/fl35g4q/", "is_submitter": false, "created": 1584798260.0, "body": "The danger of this is that it lowers your tolerance to opioids, making OD a lot more likely especially if someone doesn’t know about this. How much does it lower it? Don’t know. I’d probably be very careful using opioids with 3meopcp. It would probably just be best if they were enjoyed separately. I thought about this combo but, decided it wasn’t worth the risk", "replies": {"fl390py": {"score": 2, "link": "/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/fl390py/", "is_submitter": true, "created": 1584802122.0, "body": "Yes but 3-meo-pcp is a CNS stimulant and my tolerance is massive already, I'm pretty sure if anything the stimulating effects from the 3-meo would decrease chance of overdose, nevermind the NMDA moa", "replies": {"fl51esz": {"score": 1, "link": "/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/fl51esz/", "is_submitter": false, "created": 1584855111.0, "body": "[deleted]", "replies": {"fmh4pe4": {"score": 1, "link": "/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/fmh4pe4/", "is_submitter": false, "created": 1586095465.0, "body": "I think you're confusing 3-MeO-PCP with \n3-HO-PCP.", "replies": {"fmh4qis": {"score": 1, "link": "/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/fmh4qis/", "is_submitter": false, "created": 1586095493.0, "body": "Ope you're right my bad!", "replies": {"fmh8eyk": {"score": 1, "link": "/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/fmh8eyk/", "is_submitter": false, "created": 1586099036.0, "body": "No problem my dude.", "replies": {}}}}}}, "fl5wx0n": {"score": 1, "link": "/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/fl5wx0n/", "is_submitter": false, "created": 1584876655.0, "body": "3-MeO-PCP is not an opiate.  It's an NMDA antagonist, sigma 1 agonist, and a weak SRI.", "replies": {}}}}}}}}, "fl390cc": {"score": 3, "link": "/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/fl390cc/", "is_submitter": false, "created": 1584802109.0, "body": "Haha yea actually. 3meopcp and hydromorphone\n\nIt was decent, honestly wouldve been better off enjoying the 3meo and then doing a shot when its over/the next morning", "replies": {}}, "fl3kt29": {"score": 3, "link": "/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/fl3kt29/", "is_submitter": false, "created": 1584817438.0, "body": "just kratom and 3-meo-pcp, it made the 3-meo-pcp less scary in oral doses of 15-25 mg but not more enjoyable", "replies": {}}, "fl5wdlm": {"score": 2, "link": "/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/fl5wdlm/", "is_submitter": false, "created": 1584876247.0, "body": "Lift heavy weights on 3-MeO-PCP.  That feels pretty good with that endorphin feeling.  Tbh I think MXE was better though... I didn't expect to be able to lift weights as well as I could on MXE.", "replies": {}}, "fl3n4kh": {"score": 1, "link": "/r/researchchemicals/comments/fm9jzk/anyone_combine_3meopcp_with_opioids/fl3n4kh/", "is_submitter": false, "created": 1584820309.0, "body": "Subutex daily for 3 yrs", "replies": {}}}}, "ir0z5y": {"text": "AP-238 Dosing\n\nMy 1g of AP-238 just landed today and I’m very excited to begin researching. But this chemical has almost no dat available and from the limited information I could pull off several reddit trip reports none of them provided any substantial information on proper dosages. Most of them seemed to have massively high tolerances. \n\nI have almost no tolerance to opiates, in the last month I’ve used twice. (hydromorphone 4mg and oxycodone 7.5). So I’m bound to be a little more sensitive to these compounds. Can anyone recommend a good starting dose for me? Planning to use cap it, take orally.", "author": "everykissbeginswK", "score": 2, "flair": null, "created": 1599892897.0, "url": "https://www.reddit.com/r/researchchemicals/comments/ir0z5y/good_doses_for_ap238_newbie_here/", "num_comments": 6, "title": "Good doses for Ap-238? Newbie here", "subreddit": "researchchemicals", "comments": {"g4vj58m": {"score": 6, "link": "/r/researchchemicals/comments/ir0z5y/good_doses_for_ap238_newbie_here/g4vj58m/", "is_submitter": false, "created": 1599893690.0, "body": "Use scale that can weigh .000 start with like 10-20mg on a scale thats(.010 or .020) its honestly really hard to weigh out small dose like this unless you have an expensive scale, some scales have a bare minimum amount before the numbers start moving so just put a piece of paper or capsule on the scale dont tare it and then put the powder on, example with capsule on it would say like 1.0 on scale then add powder to make it say 1.020 then you would know thats 20mg dose", "replies": {"g4vjrlz": {"score": 4, "link": "/r/researchchemicals/comments/ir0z5y/good_doses_for_ap238_newbie_here/g4vjrlz/", "is_submitter": false, "created": 1599894050.0, "body": "I get the gem20 0.001 scale and it registers little as 5mg. But reweigh it 5 times and make damn sure it's calibrated. Sells for like 25 bucks.", "replies": {"g4vk9nh": {"score": 2, "link": "/r/researchchemicals/comments/ir0z5y/good_doses_for_ap238_newbie_here/g4vk9nh/", "is_submitter": false, "created": 1599894343.0, "body": "Yea safety first when its the first time with new substance and no tolerance you can always take more but u can't take less, also I've seen some people say that taking an anti acid like tums a little before can help with the caustic but idk how accurate that actually helps health wise", "replies": {}}}}}}, "g58525w": {"score": 3, "link": "/r/researchchemicals/comments/ir0z5y/good_doses_for_ap238_newbie_here/g58525w/", "is_submitter": false, "created": 1600117073.0, "body": "20 -30mg and all i use is kratom.", "replies": {}}, "g4w055g": {"score": 2, "link": "/r/researchchemicals/comments/ir0z5y/good_doses_for_ap238_newbie_here/g4w055g/", "is_submitter": false, "created": 1599903743.0, "body": "Seems to me that there is a ton of info on Ap238 and doses with variety of tolerances, from massive to hardly anything at all or low kratom use. I would recommend 25mg taken oral and go from there personally. I have a bit of a tolerance and went through a couple grams of 2map237 and odsmt in the weeks prior. So when I started with my AP238 I started at 50mg oral and it was underwhelming. Ended up bumping it up to about 200mg doses IV, I know.. not the smartest with this chem. And that seemed to do the trick for me, especially when mixed with Odsmt, usually about 100mg or so of that taken right with it, IV as well. Yes dumb, but not as dumb as iv 238", "replies": {"g585boc": {"score": 1, "link": "/r/researchchemicals/comments/ir0z5y/good_doses_for_ap238_newbie_here/g585boc/", "is_submitter": false, "created": 1600117253.0, "body": "Dude,if it does that to your nostrils.   Oh,boy!", "replies": {}}}}}}, "i6brge": {"text": "2MAP or 2-methyl-ap-237 in my opinion is incredible. Especially when taken orally. it feels like an oxycodone buzz and makes my game of red dead redemption 2 feel like an adventure lol. I suffer from back problems and find this substance helps with the pain. I have noticed even the afterglow numbs my pain although it loses its euphoria which to me is a good thing since what keeps me from doing things is pain.  The substance can be very addictive but I find value in it if I am in extreme pain. use should be limited to once a week or even less because the caustic properties of this substance could cause damage to one's internal organs.I do not recommend snorting it, only use it orally. Overall I would recommend this substance to try at least once. Some will like it some won't.\n\nFuture reviews coming are Bromazolam, Etizolam, and 3-FPM :)\n\n&#x200B;", "author": "Aware-Brain1645", "score": 7, "flair": null, "created": 1596968837.0, "url": "https://www.reddit.com/r/researchchemicals/comments/i6brge/2map_or_2methylap237_my_review_on_this/", "num_comments": 6, "title": "2MAP or 2-methyl-ap-237 my review on this pain-relieving substance.", "subreddit": "researchchemicals", "comments": {"g0uvbp8": {"score": 2, "link": "/r/researchchemicals/comments/i6brge/2map_or_2methylap237_my_review_on_this/g0uvbp8/", "is_submitter": false, "created": 1596972239.0, "body": "I agree got a gram shared with friends had blood in my snot had fun n won't use it again", "replies": {"g0uxcpo": {"score": 1, "link": "/r/researchchemicals/comments/i6brge/2map_or_2methylap237_my_review_on_this/g0uxcpo/", "is_submitter": true, "created": 1596973523.0, "body": "This one I can only recommend to take orally.", "replies": {"g0vb3qr": {"score": 1, "link": "/r/researchchemicals/comments/i6brge/2map_or_2methylap237_my_review_on_this/g0vb3qr/", "is_submitter": false, "created": 1596984067.0, "body": "[removed]", "replies": {"g0vb7bg": {"score": 3, "link": "/r/researchchemicals/comments/i6brge/2map_or_2methylap237_my_review_on_this/g0vb7bg/", "is_submitter": true, "created": 1596984153.0, "body": "Im sorry but sourcing would be breaking the rules.", "replies": {"g0vfjjh": {"score": 2, "link": "/r/researchchemicals/comments/i6brge/2map_or_2methylap237_my_review_on_this/g0vfjjh/", "is_submitter": false, "created": 1596988185.0, "body": "Thanks for helping by not breaking the rules! Gave you a little present as a thank you", "replies": {"g0vfpkq": {"score": 2, "link": "/r/researchchemicals/comments/i6brge/2map_or_2methylap237_my_review_on_this/g0vfpkq/", "is_submitter": true, "created": 1596988347.0, "body": "No problem. I am on this forum purely for information purposes :)", "replies": {}}}}}}}}}}}}}}, "i05arz": {"text": "I know its probably a silly question, but are those two different benzos or do people just call Flubromazolam, Bromazolam for short. Also how does Clonazolam compare to it? I don't wanna ever touch Clonazolam again, thats the only drug to ever make me black out in my life and I've done insane combos before with little to no amnesia. Like literally 4mg alprasolam, 20mg diazepam, 1mg clonazepam, 30mg oxycodone and followed by 3 24 ouncers of 9 percent malt liquor. No blackout from that and I had no gabageric tolerance at that point. The other day I binged like 10mg of clonazolam in 36 hours and dont even remember doing so, I remember taking like 500ug to potentiate my AP238 and then I took like 250ug more an hour or two later followed by another dose of AP238 (also was taking a ton of benadryl for potentiation and microdosing 2F-DCK for potentiation aswell) and after that point it got hazy and I woke up the next day not even knowing it was the next day, I thought I only slept like 2 hours and was pissed off.", "author": "roflfish", "score": 3, "flair": null, "created": 1596074449.0, "url": "https://www.reddit.com/r/researchchemicals/comments/i05arz/is_bromazolam_flubromazolam/", "num_comments": 4, "title": "Is Bromazolam, Flubromazolam?", "subreddit": "researchchemicals", "comments": {"fzn6fcj": {"score": 2, "link": "/r/researchchemicals/comments/i05arz/is_bromazolam_flubromazolam/fzn6fcj/", "is_submitter": false, "created": 1596074781.0, "body": "Flubromazolam has an identical structure to bromazolam with the addition of a single fluorine atom. They are different, but not nearly as much as other compounds", "replies": {"fzn6kcc": {"score": 1, "link": "/r/researchchemicals/comments/i05arz/is_bromazolam_flubromazolam/fzn6kcc/", "is_submitter": true, "created": 1596074847.0, "body": "I dont see a psychonaut page from regular Bromazolam. Do you know a site that has dosage information/duration and such for it?", "replies": {"fzn9c47": {"score": 2, "link": "/r/researchchemicals/comments/i05arz/is_bromazolam_flubromazolam/fzn9c47/", "is_submitter": false, "created": 1596076181.0, "body": "tripsit", "replies": {}}, "fzn9pg0": {"score": 2, "link": "/r/researchchemicals/comments/i05arz/is_bromazolam_flubromazolam/fzn9pg0/", "is_submitter": false, "created": 1596076356.0, "body": "[deleted]", "replies": {"fzof6wz": {"score": 1, "link": "/r/researchchemicals/comments/i05arz/is_bromazolam_flubromazolam/fzof6wz/", "is_submitter": true, "created": 1596097078.0, "body": "I think I'll go with Bromazolam, thank you. Also, whats your opinion in Pyrazolam?", "replies": {}}}}}}}}}}, "eeeb9w": {"text": "I don't have much experience with oxycode, does anyone know what the dosage for o-dsmt to equal 10mg oxycodone?", "author": "deekan12", "score": 4, "flair": null, "created": 1577097581.0, "url": "https://www.reddit.com/r/researchchemicals/comments/eeeb9w/odesmethyltramadol_oxycodone_equivalent_dosages/", "num_comments": 4, "title": "O-desmethyltramadol oxycodone equivalent dosages?", "subreddit": "researchchemicals", "comments": {"fbudefk": {"score": 2, "link": "/r/researchchemicals/comments/eeeb9w/odesmethyltramadol_oxycodone_equivalent_dosages/fbudefk/", "is_submitter": false, "created": 1577141234.0, "body": "Probably 30 to 50mg range of O-DSMT but it wont feel the same. Its a different compound after all.", "replies": {}}, "fbu64ya": {"score": 1, "link": "/r/researchchemicals/comments/eeeb9w/odesmethyltramadol_oxycodone_equivalent_dosages/fbu64ya/", "is_submitter": false, "created": 1577137274.0, "body": "Id say weigh out 10mg of ox", "replies": {}}}}, "gyqwqw": {"text": "I’ve recently acquired a few grams of 2 methyl ap 237 and want to report back what my experience was. I haven’t seen many posts on this RC so i thought I’d contribute. The 237 is great! I take about 50mg or so and i get a very nice buzz, head and body. I’ve never found an opioid so similar to oxy, about 50mg of the 2 methyl ap 237 is about the same as a 30mg instant release oxycodone, something i wasn’t expecting. My ROA if choice is oral, however i have insufflated (burned like hell) and plugged (also burned), both worked, but the best effects came from oral and lasted the longest. \nI’ve heard some people have horrible side effects from this RC, such as stomachs pains, loss of memory, WDs that last months etc. but i haven’t had any negative side effects and i stopped taking it a few days ago. I started taking 10mg just to make sure it didn’t kill me, and when i deemed it safe i decided to titrate my dose upwards. All in all i enjoyed this RC, but i would start small if you decide to try it because of all the horror story’s, maybe i just got a good batch and got lucky.", "author": "TheRabbit454", "score": 6, "flair": null, "created": 1591615103.0, "url": "https://www.reddit.com/r/researchchemicals/comments/gyqwqw/2_methyl_ap237_report/", "num_comments": 4, "title": "2 methyl AP-237 report", "subreddit": "researchchemicals", "comments": {"ftch74n": {"score": 2, "link": "/r/researchchemicals/comments/gyqwqw/2_methyl_ap237_report/ftch74n/", "is_submitter": false, "created": 1591627472.0, "body": "Do you think  it's too caustic to i.v", "replies": {"ftcjcr8": {"score": 4, "link": "/r/researchchemicals/comments/gyqwqw/2_methyl_ap237_report/ftcjcr8/", "is_submitter": false, "created": 1591629391.0, "body": "I would **not** do that.", "replies": {}}}}, "fvuwecs": {"score": 1, "link": "/r/researchchemicals/comments/gyqwqw/2_methyl_ap237_report/fvuwecs/", "is_submitter": false, "created": 1593040275.0, "body": "Proxi? I’m getting a gram today", "replies": {}}, "fvuydbo": {"score": 1, "link": "/r/researchchemicals/comments/gyqwqw/2_methyl_ap237_report/fvuydbo/", "is_submitter": false, "created": 1593041277.0, "body": "Kicking methadone I won’t use it til a 5 plus days thong got kratom and benzos tea anything else got 2-methyl-app-237", "replies": {}}}}}