{"j4abm0": {"text": "I wanna have a pill bottle of etizolam candies that look kinda like pills, and sweet tarts dont really have that look. Pez somewhat do, and im considering using those. Theyre almost like a small xanny. My question- Are there any plain, small, circular candies that you guys prefer to drop it onto to make tablets? I just want them to look nondescript. My storage bottle will be well labelled, mind you.\n\nAs to why I want them to look like this, its just something that satisfies my junkies psyche. Im not a bad drug abuser anymore like I used too, but the feeling of having something like etizolam pills satisfies my addict mindset and helps me appreciate it and not over do it. I need to feel like im doing something bad, kind of. Anyway, any help appreciated!", "author": "stupidjunkiethrowawa", "score": 5, "flair": null, "created": 1601731425.0, "url": "https://www.reddit.com/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/", "num_comments": 10, "title": "Best candies for dropping etizolam onto?", "subreddit": "researchchemicals", "comments": {"g7hlmnw": {"score": 3, "link": "/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/g7hlmnw/", "is_submitter": false, "created": 1601732422.0, "body": "Pez should pe perfect man 🌞", "replies": {"g7hm168": {"score": 1, "link": "/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/g7hm168/", "is_submitter": false, "created": 1601732772.0, "body": "[deleted]", "replies": {"g7hzou5": {"score": 3, "link": "/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/g7hzou5/", "is_submitter": false, "created": 1601745386.0, "body": "Each drop of water at a certain temperature and pressure*. It's not systematically true for all liquids and settings so definitely do some tests before.", "replies": {}}, "g7j1b5e": {"score": 2, "link": "/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/g7j1b5e/", "is_submitter": false, "created": 1601772931.0, "body": "The drop size is mainly dependent on the capillary it comes out of. Just drip one onto your scale and look how much it weighs.", "replies": {}}}}}}, "g7iibd7": {"score": 3, "link": "/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/g7iibd7/", "is_submitter": false, "created": 1601762260.0, "body": "Works with smarties, 20mg/mL with .1mL dropped onto each one to make 2mg smarties", "replies": {"g7j8ip8": {"score": 1, "link": "/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/g7j8ip8/", "is_submitter": false, "created": 1601776896.0, "body": "But do they even absorb a liquid?", "replies": {"g7qmf13": {"score": 1, "link": "/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/g7qmf13/", "is_submitter": false, "created": 1601886274.0, "body": "Everclear or 99% isopropyl don't have to absorb and quickly evaporate, plus smarties are concave 👍", "replies": {"g7sq64w": {"score": 1, "link": "/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/g7sq64w/", "is_submitter": false, "created": 1601941296.0, "body": "How are smarties concave??? They are convex, the drop will fall off of them.\n\nAnyway, you're saying that the IPA will just evaporate and the substance will adhere to the outside of the smartie? \nSo basically you're just adding more layers onto the smartie?", "replies": {"g7sqvtr": {"score": 3, "link": "/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/g7sqvtr/", "is_submitter": false, "created": 1601941659.0, "body": "Atleast with everclear it does seem to soak into the smarties, and they actually are slightly concave not flat, just concave enough to hold .1mL then for it to absorb into the smarties. And it does seem to actually absorb and not just sit on the top, idk if its just a more porous candy or what but this method has definitely worked in the past", "replies": {}}, "g7ubznp": {"score": 1, "link": "/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/g7ubznp/", "is_submitter": false, "created": 1601968672.0, "body": "There are two different kinds of smarties - American and English versions. Totally different things haha", "replies": {"g7xqeju": {"score": 2, "link": "/r/researchchemicals/comments/j4abm0/best_candies_for_dropping_etizolam_onto/g7xqeju/", "is_submitter": false, "created": 1602046513.0, "body": "Wow everything makes so much sense now, thanks", "replies": {}}}}}}}}}}}}}}, "i5zdj3": {"text": "Ok so I was browsing through the research chems section like usual and somebody posted that they had LUCID wild dreams on this stuff and I was like....... damn lucky. I had taken about .5 before and didn't feel jack shit except like a super strong melatonin type feel.... no crazy dreams or anything.\n\nWell lets fast forward a week when a research supplier supplied me with a huge free tube of it as a delay for my original Pyrazolam research supplement. Now heres where things get crazy.\n\nI'm like Ok if were going to do this it's (I never do heavy research chems after I learned my lesson the fucking HARD WAY) it's going to be right before bed and I hope to god I have lucid dreams. I think about ***1mg*** was ingested this time. Took about 40 min to knock me out but all i felt was tired... ***wouldn't use it ever in daytime.***\n\nOn to the dreams.... holy shit....there were at least 5 but can remember a few for you.\n\n# SEXY SEWER GIRL\n\n**1)** I was living in a sewer with a girl who was super hot and just rats were crawling all over the place. I was like can we please get out of here and she was like \"But there is plenty of food here\" and I saw her like eat this rats head off and I started running through a series of never ending tunnels and panicking and finally woke up. Holy shit it was scarier than it sounded.\n\n# Alligator eats me in a floatable donut tube\n\n\\*\\*2)\\*\\*Ok so I was swimming in a lake near the shore when I see an alligator approach me... this thing knows it wants to eat me and I know I'm about to get eaten.... I'm in a like donut rubber inflatable and was just too dumb to realize to jump out and start swimming as this thing is slowly coming at me. I'm like 8 feet from the shore and can swim like William Hung (a beast.. but look up the reference). So I'm flapping with all of my power and by golly this thing is looking like its giving me every single chance in the book to get away and is like why is this guy so STUPID.... eventually he chomps me and I wake up again in a panic.\n\n# Hit and run/ running around buck ass naked\n\n\\*\\*3)\\*\\*This was the oddest dream I've ever had. So i was at the beach down in Florida... maybe Miami? One my my family members let me drive her most expensive car with was probably over 80k. So all is good im just tanning on the beach, going swimming, having fun... and the issue starts when I leave.\n\nSo I'm backing up with a back up cam installed which who would even really notice in a dream i just looked in the back mirror and who do I ram my car into a female cop car, and who just got out of jail? So naturally I decided I just fucking BOOOK it and hope to get out of there and out run them. Wrong. There was some car parked like in the center of the exit **diagonally MIRACULOUSLY**. This is where the lucid part kicked in, in this dream. Tasers and guns damn sure weren't in play so I knew I could outrun them in my dream. So I run into a building to hide.... what building do you think it is? THE FUCKING POLICE STATION.\n\nNot only that, I look down and I am ***completely naked*** so I'm like what the fuck should I do... I couldn't open any door the cops would be there any minute so I just run up the stairs. I ended up in the mail room and hid in one of the mail bins. They started digging through the mail bins cause there was really nowhere else to go... found me and I woke up in a panic.\n\n# Job Interview Nightmare\n\n**4)** **FINAL DREAM**I was in a job interview for the first job I'd ever truly wanted that makes over six figs. So I'm going through my resume with the hiring manager thinking holy shit I got the best job in the world and my luck has finally change. He asked why I wanted to work there and my about my background and I had **THE WORST BENZO SLUR EVER POSSIBLE**. Dude it was so bad I couldn't even formulate sentences like I had eaten 8 2mg xannies. So things started getting lucid and I'm thinking Oh god why did I just do that. So i try to muster up strength but can't make any sense to this poor hiring manager who has no idea why I'm slurring and look like my eyes can't open. Then i realize I'm in a lucid dream and like start throwing shit and running around, *get naked* and trying to find the sexiest girls ever.\n\nSo I'm walking naked as fuck down the freeway, knowing I'm in a dream...and not giving a fuck. The cops don't seem to fuck with you when you are in a lucid dream.\n\nThen the worst PANIC sets in. So I guess I was staying at my parents house until I got my job and I realized that the thermostat was set to 65 degrees (what I currently sleep in, in my own apartment). And now it's a full out sprint to get there, naked as fuck, to turn it up to 74 degrees. lmfao Woke up after that scare thank god and was so thankful that I live alone because sometimes I forget when I wake up. I'm an introvert and hate being bothered by people in my own home.\n\nSo in final words: the dude who said flub gives lucid dreams was definitely right. I had lucid dreams in a fair share of them... there were more i just forgot to mention. They were all really entertaining and terrifying at the same time.... but once you realize it's a dream its fucking baller. I will try again tonight and see what happens. **And for the record yes when I am lucid dreaming. 99.9999999% of the time I'm getting naked and just running around or like wreaking havoc.**  \n\n\n  \n***EDIT----- SHOUT OUT TO DUDE WHO PLANTED THIS IDEA IN MY HEAD ABOUT LUCID DREAMING ON FLUBROMAZOLAM.... I DON'T REMEMBER WHERE I SAW THIS IDEA.***", "author": "ElMono2838", "score": 3, "flair": null, "created": 1596923141.0, "url": "https://www.reddit.com/r/researchchemicals/comments/i5zdj3/flubromazolam_dreams_long_story_but_very/", "num_comments": 9, "title": "Flubromazolam DREAMS... long story but Very interesting dreams IMO", "subreddit": "researchchemicals", "comments": {"g0smmb5": {"score": 3, "link": "/r/researchchemicals/comments/i5zdj3/flubromazolam_dreams_long_story_but_very/g0smmb5/", "is_submitter": false, "created": 1596928321.0, "body": "Word of warning- Long term use of benzos kinda killed my dream life. I haven’t dreamed anything i could remember in years. YMMV", "replies": {"g0sz290": {"score": 2, "link": "/r/researchchemicals/comments/i5zdj3/flubromazolam_dreams_long_story_but_very/g0sz290/", "is_submitter": true, "created": 1596935183.0, "body": "Oh I've already detoxed from a 2 year habit of 8mg of clonaz and 15mg of diclazepam a day. I have been through fucking hell. I am way smarter about it and use them VERY occasionally. I couldn't write my name for like 5 months. Nothing good comes form Long term benzo use. plus FLUB fucking knocks the shit out of your benzo tolerance. I won't use that again for another month or so.", "replies": {"g0szmpl": {"score": 2, "link": "/r/researchchemicals/comments/i5zdj3/flubromazolam_dreams_long_story_but_very/g0szmpl/", "is_submitter": false, "created": 1596935489.0, "body": "Good call. I pretty much stay away because any use beyond a minimal dosage once every couple of months causes w/d’s. \n\nI can say that the most vivid dreams of my life come after small benders that gave me w/d’s, though I’m not sure they qualify as dreams, per se.\n\nThe first night or two when I couldn’t sleep I would pop a seroquel before laying down and would fall into a fugue state with the most incredibly vivid 3-d realistic hallucinations all night.  Really remarkable, but not worth the pain and suffering.  They so vivid and detailed they were almost ‘more real’ than reality.", "replies": {"g0t2ejp": {"score": 1, "link": "/r/researchchemicals/comments/i5zdj3/flubromazolam_dreams_long_story_but_very/g0t2ejp/", "is_submitter": true, "created": 1596936971.0, "body": "I completely understand. So i have a question for you. My research chemical of choice is Pyrazolam. It's very weak and just takes away my anxiety... i usually dose like .2 or something like that. So I ordered some more online and the dude was super late sending it so he shipped me an extra bottle and I was like SWEET.... he doubled my order!!  \n\n\nI go to look at the bottle hiding underneath and it is Flubromazolam .5mg/ml. I'm sitting here thinking... uh what the fuck? You're going to send me a full bottle of the complete opposite of the lightest benzo there is? That makes no sense at all to me, but to him it does because he wants to get me addicted and start buying other more powerful chems... you know what I mean?", "replies": {"g0t3ior": {"score": 1, "link": "/r/researchchemicals/comments/i5zdj3/flubromazolam_dreams_long_story_but_very/g0t3ior/", "is_submitter": false, "created": 1596937562.0, "body": "It’s possible, but I don’t always buy the “dealers getting you hooked” thing they taught us. I have met some shitty dealers, but most are basically decent people. Heck, The first time I tried to buy heroin was at a Dead show in, like, ‘92. He asked if i had done it before and when i hadn’t, he said he wasn’t going to be the first person to give me heroin.\n\nMore than likely, dude was trying to hook you up right, just on good faith for repeat business.  Used carefully, that bottle can last you.  I’ve been finding that (I know it’s a different chemical) .1mg of flualp will, now, make me sleepy for 2 days and i have no real urge to redose. Treat it carefully and it’ll just be your stash for benzo requiring emergencies (to end a bad trip, or something).\n\nEdit- that bottle probably cost him a dollar or two to make, at most.", "replies": {"g0t5q6n": {"score": 2, "link": "/r/researchchemicals/comments/i5zdj3/flubromazolam_dreams_long_story_but_very/g0t5q6n/", "is_submitter": true, "created": 1596938683.0, "body": "That's true, I didn't even think about it like that!", "replies": {}}}}}}}}}}}}, "g0se65w": {"score": 2, "link": "/r/researchchemicals/comments/i5zdj3/flubromazolam_dreams_long_story_but_very/g0se65w/", "is_submitter": false, "created": 1596923226.0, "body": "This is what I’m here for brother.", "replies": {"g0seqr3": {"score": 1, "link": "/r/researchchemicals/comments/i5zdj3/flubromazolam_dreams_long_story_but_very/g0seqr3/", "is_submitter": true, "created": 1596923594.0, "body": "Dude if emotions were able to be transmitted into each of those dreams through the internet the panic would have been real. That shit was CRAZY.... never had an experience like it.", "replies": {}}}}}}, "ez29qw": {"text": "I took 5 mg etiz over the course of 5 hours, just took 2mg 5 hours ago(1:30pm) and 3mg just now 6:30pm while vaping cannabis over the same period every couple hours. \n\nEdit: Note: I did take a 10mg Adderall xr at 7am and a 5 mg Adderall ir at 11:20am, taken as prescribed for my ADHD, not as a recreational dose. All medicinal effects wore off around 1:30, with the comedown and side effects starting at around 12:30. But it could make this experience less intense and keep me more alert. \n\n6:40 pm: strong delusions of sobriety I think, or it's really just not hitting too hard. I feel relaxed and good but it feels like I took 1mg of a not so potent pressed xanny.\nDefinitely more social, a bit relaxed, and completely demolishing the Adderall comedown but feeling pretty normal, maybe still a bit anxious.\n\n7:45pm: I still feel fine, worn out and more social than normal but other than that I just feel kinda normal. I can function fine without anyone around me thinking I'm messed up, my fine motor skills are more or less fine. As far as I can tell im not really barred and it doesn't seem to be causing the normal \"etiz n0t werkinf\" effects(thought I suppose I'll find that one out for sure tomorrow morning lmao). Definitely helping my anxiety and depression a good amount though and it's been making me really more empathetic all afternoon\n\n8:15pm starting to feel nice and relaxed and tired but kind of in a took half a bar and smoked a bit kinda way. It's peaceful. I'm going to play guitar for a bit(we'll see how that goes) and then meditate for a bit.", "author": "swolf404", "score": 1, "flair": null, "created": 1580899526.0, "url": "https://www.reddit.com/r/researchchemicals/comments/ez29qw/i_just_took_5mg_of_etizolam_live_update/", "num_comments": 6, "title": "I just took 5mg of etizolam, live update", "subreddit": "researchchemicals", "comments": {"fgkqa8b": {"score": 7, "link": "/r/researchchemicals/comments/ez29qw/i_just_took_5mg_of_etizolam_live_update/fgkqa8b/", "is_submitter": false, "created": 1580900033.0, "body": "[deleted]", "replies": {"fgkwsk9": {"score": 1, "link": "/r/researchchemicals/comments/ez29qw/i_just_took_5mg_of_etizolam_live_update/fgkwsk9/", "is_submitter": true, "created": 1580904268.0, "body": "Yeah I'm not going to redose again but while the delusions of sobriety are there I'm suprisingly function in a legitimate way. Like I'm definitely more social and almost completely lacking the come down of my ADHD meds.\nPlus since I legitimately have bad ADHD taking that dose of uppers really doesn't make me cracked out it's just gives me like a 50% chance of being able to focus and makes me wanna take a nap . I feel calm, slightly relaxed, and functional. My short term memory has been fine. Honestly the main thing I've noticed is that I'm a little hyper and very social with none of my normal social anxiety. I can still feel the normal sluggish in my head I have every night after my ADHD med comedown but it's much milder than normal. I'm by no means sober but as far as I can tell I'm more or less fine, and I've also asked a few of my housemates and they said I just seem a little worn out and more social than normal but not under the influence so idk, it's interesting.", "replies": {}}, "fgkwv8w": {"score": 1, "link": "/r/researchchemicals/comments/ez29qw/i_just_took_5mg_of_etizolam_live_update/fgkwv8w/", "is_submitter": true, "created": 1580904320.0, "body": "I just realized that I didn't mention I have ADHD in my original post.... I'm a dumbass 😂", "replies": {}}, "fgkyqbq": {"score": 1, "link": "/r/researchchemicals/comments/ez29qw/i_just_took_5mg_of_etizolam_live_update/fgkyqbq/", "is_submitter": true, "created": 1580905715.0, "body": "I'll def update in the morning, especially bc I have an early morning tomorrow.", "replies": {}}}}, "fgkworo": {"score": 1, "link": "/r/researchchemicals/comments/ez29qw/i_just_took_5mg_of_etizolam_live_update/fgkworo/", "is_submitter": false, "created": 1580904192.0, "body": "Prolly not working. You may need more. \n\n\n\nJk, don’t.", "replies": {"fgky0x8": {"score": 1, "link": "/r/researchchemicals/comments/ez29qw/i_just_took_5mg_of_etizolam_live_update/fgky0x8/", "is_submitter": true, "created": 1580905173.0, "body": "Lmao \"eTiZ nUt warking, ShoulD I TaK3 an0ther spoonful uf p0wderz\"", "replies": {}}, "fgkyb4d": {"score": 1, "link": "/r/researchchemicals/comments/ez29qw/i_just_took_5mg_of_etizolam_live_update/fgkyb4d/", "is_submitter": true, "created": 1580905391.0, "body": "But yeah I have a good amount of experience with benzos, this is one of the rare occasions I've taken more than the equivalent of like 2mg Xanax but it seems infinity more functional. \nHonestly there's a good chance my anxiety was way worse than I was willing to admit and it just took a lot to balance out with my anxiety, leaving only a bit to actual barify me.", "replies": {}}}}}}}