{"fcone5": {"text": "To preface this, I should mention that I really love stimulants, amphetamines in particular. I have a naturally high tolerance to them, and can handle rather unhealthy amounts of them. For reference a single 30mg adderall taken intranasally doesn't feel that strong to me, and will mostly have the effect of making me crave more. For me the lines blur between \"functional\" and \"recreational\" when it comes to amphetamines, which is why I love them so. I enjoy the fact that I can be very high and experiencing significant euphoria, while also still being able to socialize, complete tasks, and pass as sober to society at large. I fell in love with prescription amphetamine pretty much instantly, so the prospect of an RC that is far cheaper, easily available, and just as good (or even almost as good) was very appealing. As a result I have taken many of them. I will be comparing them to amphetamine mostly, so you can consider that the \"control\" to for all these RCs. I take something for the comedown anytime I take a stimulant. I often also take these long before I come down to smooth it out. My go to is phenibut, but I also use and have used kratom, hydrocodone, 1,4-BDO, CBD, and some RC benzos for this purpose. I have pretty rough comedowns because I tend to take a lot, and I also redose to stay high for a whole day when I take stims. I also wait at least a week between my \"speed days\" and at most I allow myself to take them two days in a row, never more. So I typically am going into the experience with either no tolerance or a rather low tolerance. My habits of usage certainly play a role in how the drugs affect me, so keep that in mind. I will rank each one at the end of its review.\n\n&#x200B;\n\n**2-FA:** This one is by far the closest RC to Amphetamine in my experience. A 30mg oral dose of 2-FA nearly the same as a 30mg Adderall IR to me, as far as mood lift, stimulation, and side effects. The duration is pretty similar as well. I think Amphetamine is capable of inducing somewhat more euphoria at higher doses, but the difference is rather small. 2-FA still has good euphoria if the proper dose is taken, but its ability as a consistent mood booster is as good as standard amphetamine. In my seasoned opinion, this is the gold standard of functional RC stims, and it is good enough to totally replace expensive RX stims. I think that 2-FA may have a slightly milder comedown compared against the control, but like most of it's qualities it's far more similar than it is different. Great mood boost and stimulation without being too distracting. It is everything that I thought 2-FMA would be, which is an Adderall clone. It is pretty terrible to snort, and it doesn't vape. This one is best oral, but also works very well plugged. I don't have a ton to say about this one, because it's very similar to amphetamine in every regard.\n\n&#x200B;\n\n**2-FMA:** This one was a huge disappointment for me. I was really just hoping it would be even half as good as RX amphetamines, but it just wasn't. People were right when they said it is very functional and has low abuse potential, but that's only because it lacks any significant mood boost/euphoria. Everything was there, the strong stimulation, the focus, muscle tension, the long duration, everything except the enjoyment. It feels like amphetamine with all the pleasure stripped away. It didn't necessarily make me feel bad, but I didn't feel good either. It basically made me feel apathetic and robotic. Even if I was very awake and could focus, I didn't really give a shit about anything. For me amphetamine is useful not just because it helps me focus, but because it gives me a fantastic mood that makes tasks so much more interesting and engaging. Therefore, making me productive. For this reason, 2-FMA was pretty much useless for me. Feeling like a robot who is only compelled to do things by joyless stimulation kind of sucks.\n\nThe only application I could imagine for this drug would be in combinations with other drugs that are enjoyable on their own, but would benefit from a bit of stimulation. At least the potency and duration were rather high. This is by far my least favorite RC amphetamine, it actually really confuses me that people recommend this drug so much, but perhaps I'm to fixated on pleasure to appreciate this as the tool that it is to some people. An amphetamine without pleasure is like an opiod that dulls pain but doesn't have euphoria, what's the point?  At one point, I put some in a bowl of weed, and I think it worked partially. I refuse to get this one again to give a proper vape trial as I would have to pay for it.\n\n&#x200B;\n\n**3-FMA:** This one is weird. It honestly does feel somewhat like a midway point between 2-FMA and 4-FMA. The first thing that I noticed about it was how potent it is. I vaporized 30 milligrams, and it felt like I was just coming up on 60mgs of adderall. I found it to be significantly more potent and longer lasting than amphetamine, especially when taken orally. It is also unique in the fact that it vapes nicely. It is pretty euphoric as well, in the ballpark of adderall, maybe a little more intense. When I get really high on speed I get to a point where it's difficult to not rapidly form ideas, either by talking to people, writing, or just basically forming a complex dialogue in my own head. I get to that state VERY QUICKLY with this stuff. It's weird because it can serve the role of a functional drug well enough, but it's definitely not ideal for it. It just skips the stage of being pleasantly stimulated and focused, and goes straight to what is basically a state of controlled mania.\n\nI'm not sure if it does have any effect on serotonin, but if it does it certainly releases far less then 4-FMA. It also seems to be a little on the edgier side, it caused jitteryness and a feeling of over stimulation more than its peers. In general, I think the amphetamines with a methyl group tend to be a little more potent, but are also a little heavier in the undesirable side effects. I found myself needing a little kratom or phenibut to smooth this one out. This one isn't my favorite, but its impressive potency and duration give you a lot of bang for your buck. The fact that you can vape it is also very nice. The powder was mostly small rocks, and it smelled really chemically in an unpleasant way, so I assumed it would be nasty. However, upon vaping it off foil I realized that it had a very mild taste, kind of like a fake sweetener, and didn't burn my lungs at all. It vaporizes even a little bit better than 3-FPM, at least for the batch I got. This one is worth giving a try for amphetamine lovers who enjoy being perhaps a little too blasted.\n\n&#x200B;\n\n**4-FMA:** This one is really rather euphoric. It definitely releases some serotonin, but not enough to make it a proper empathogen. It also releases to much to really be a functional stimulant either. This one is kind of just in a stimulant limbo. On one occasion, I did take it at work in a succession of smaller doses. It got me through my shift with no sleep, but it took a toll on me. It's very good for socializing, especially informally with friends, but it's a little too rolly to be good for focusing or studying. It's also not even as complete of a roll as say 3-MMC. I found that it was a little less potent than amphetamine, and also had a worse comedown. In general, it seems to be a bit harsher on the body and mind, probably in part due to serotonin release. It's not really a terrible drug, it's just right in-between two roles, neither of which it can satisfactorily fulfill. This one would probably be best for recreational activities where you want plenty of euphoria and stimulation without dedicating to an actual roll. It's not the worse stimulant I've tried for sure, but if you've got other options go with those.  It seems like this is just a shittier version of 4-FA, a drug that was able to fit into two roles far better. The second worse one I've tried.\n\n&#x200B;\n\n**3-FEA:** This is the only one in this list that I would consider to be a true empathogen. This is possibly the most unique amphetamine that I have tried, because it is by far the least stimulating. When you take an empathogen like MDMA, there is some level of relaxation mixed with the stimulation due to the serotonin release. It's pretty subtle with a drug like MDMA, but its like 3-FEA takes that kind of serotoninergic chill, and presents it in its pure form, without the in your face stimulation. It almost seems as if it's amphetamine, but with most of the dopamine and norepinephrine replaced by serotonin. It's the only amphetamine I have taken that didn't compel me to constantly move. The dosages for this one were very high, but even at very high doses there wasn't a whole lot of muscle tension or stimulation. At a certain dose level (I don't remember what it was, but it was high) it did become a true roll in my opinion, just the most relaxing roll ever. It actually was a little trippy at that point. Unlike 4-FMA, where even when you took a lot you never felt like you were even close to rolling. The weird part was that at doses below the threshold of rolling, it was literally just a relaxing amphetamine. It felt like speed, just instead of that pushy energetic rush, there was a calm sense of well being and chill. I felt more social, but instead of it being driven by stimulation it was driven by a feeling of openness and calm.\n\nDue to its rolly nature, this one is probably not good to take as frequently as standard amphetamines, but it is really nice and worth trying. Some people characterized this drug as being a useless in-between like 4-FMA, but it's far more interesting and fun than that. I personally found the comedown to be a lot more tolerable than drugs like 6-APB or MDMA. It was about as bad as an amphetamine comedown, just different. Instead of acute mental and physical discomfort, it took the form of a gradual transition out of the high and into a feeling similar to how you feel about a day after a strong MDMA roll, emotionally drained. This drug is super unique, if you like entactogens this one is worth trying, if nothing else but for the novelty.\n\n&#x200B;\n\n**3-FPM:** I know this isn't technically an amphetamine, but it's pretty similar and it's got a flourine on it. Plus I want to talk about this one. This is one of two stimulants I have vaped. Because of this, it is elevated to a higher status for me. Especially since this drug is fucking painful to sniff, even more so than most of the previously mentioned drugs; all of which, besides pharma amphetamine, are pretty awful to snort. I think what I like the most about 3-FPM is that is has less unpleasant side effects than any other drug on this list overall. I can sleep more quickly, eat more easily, clench my jaw less, and have considerably more tolerable comedowns. One might assume that this is a trade off for euphoria, but I disagree (sort of). For me, 3-FPM can have euphoria as good as amphetamine, it just doesn't last as long. It has a short window of real pleasure, and then the majority of the rest of the high is just okay. Oral amphetamine has 3 to 4 hours of the actually really good peak effects, where 3-FPM has one, even though I feel like the total duration of 3-FPM is roughly the same. As a result of this, it lends itself to continual dosing, which is why vaporization is my favorite ROA for this one. It's really easy to just vape a bit of it every half hour or so and just keep a nice high going. It's strange though. You want to redose to get back the euphoria, but you don't actually start coming down until a few hours after you start craving. So it can be insanely fiendish, but if you're occupied you can kind of just ignore it for a little bit, as opposed to something like coke.\n\nIt's also far less potent that amphetamine, probably about half as strong. The lower potency combined with the extremely forgiving nature of this stim means that even when you're using a ridiculous amount of the stuff during a binge it never fucks with you as much as you feel like it should. For these reasons, it's a pretty good functional drug (as long as you're using ROA's other than vaped), second to 2-FA as far as RCs go for me, but it's also a pretty decent recreational drug. It's super fun to vape a ton of it with some friends because you can enjoy that satisfaction of overindulgence without paying the price that less friendly stims will charge (shit like hexen for example). I have a feeling that 3-FPM has far less of an effect on adrenaline than most amphetamines, while still releasing a good amount of dopamine. The high is really smooth and clean and doesn't have much edginess to it. It's not like a serotonergic kind of smoothness either, it's like a purified dopamine high. This one is one of my favorite stims, simply because it's so light, yet it still has that nice energetic euphoria. I blow through this drug so quickly when I have it though. It's ironic that the lightest stim on this list is also the most compulsive.\n\n&#x200B;\n\nThis list has all of the ones I've tried so far. I know this list is missing 3-FA, 4-FA, and 4-FEA. I would love to try the first two, although it wouldn't surprise me if 4-FA is pretty much extinct to Americans. From what I hear, 4-FEA is an even less potent version of 3-FEA, which sounds pretty useless, so I doubt I'll try it. I hope someone can get something of value from this 3-FMA fueled monstrosity, my apologies for this wall o' text.\n\n&#x200B;\n\nEdited for grammar and sanity.", "author": "colorfulexistance", "score": 257, "flair": null, "created": 1583235805.0, "url": "https://www.reddit.com/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/", "num_comments": 111, "title": "My Reviews On All of The Flourinated Amphetamines I've Tried", "subreddit": "researchchemicals", "comments": {"fjc3rrp": {"score": 47, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjc3rrp/", "is_submitter": false, "created": 1583236662.0, "body": "Good read. Thanks for sharing", "replies": {"fjeu3js": {"score": 5, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjeu3js/", "is_submitter": false, "created": 1583307049.0, "body": "I agree! I sat out on the park bench and thoroughly enjoyed this. I'm definitely going to give 3-fpm a go after reading this. You have sparked my curiosity", "replies": {"fjevirc": {"score": 3, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjevirc/", "is_submitter": false, "created": 1583307795.0, "body": "I would definitely agree that 3fm is worth while. Only downside for me is that I dose pretty high so it's not so cheap. I also find that unlike other stims, I have to force myself drink whereas is usually find myself chugging a ton of water on other stims", "replies": {}}, "fjf50lo": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjf50lo/", "is_submitter": true, "created": 1583313242.0, "body": "It's a gem, at least to me. I think a lot of people have a tainted perception of it due to some low quality batches that have made the rounds. I tried some a few years ago from another source, and it was somewhat lackluster compared to the stuff I get now.", "replies": {}}}}}}, "fjc5a1w": {"score": 15, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjc5a1w/", "is_submitter": false, "created": 1583237767.0, "body": "I enjoyed as well", "replies": {}}, "fjce0pk": {"score": 14, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjce0pk/", "is_submitter": false, "created": 1583245363.0, "body": "I usually hate stims but 4f-mph is amazing. Analog to ritalin I believe but way way more dopamine uptake. A 20-30mg oral dose will last all day, without the shitty come down. It blew my mind how stimulating it was yet didnt give that unfortunate jitters.\n\nI swear it makes a 8hr shift feel like 4hrs but after having enough to research for 2weeks I realize the EXTREME ADDICTION POTENTIAL", "replies": {"fjd94yr": {"score": 9, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjd94yr/", "is_submitter": false, "created": 1583277253.0, "body": "I'm the rare person that prefers methylphenidate to amphetamine meds for ADHD. 4F-MPH gave me crazy euphoria and sex energy. I don't think our feeling about it is common, though.", "replies": {}}, "fjcjoa6": {"score": 3, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcjoa6/", "is_submitter": true, "created": 1583251710.0, "body": "I tried 4f-mph, and it was not good. Pretty much zero euphoric effects. I will say the comedown wasn't bad, but it just felt like it was lacking substance. I think I might have gotten a poor batch.", "replies": {"fjfypfy": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfypfy/", "is_submitter": false, "created": 1583333274.0, "body": "Yeah you have to gotten a poor batch or have a high stim tolerance, 4f is a little more subtle as far as the stronger ones go. If I had a extremely strong amphetamine then I would hate the come diem and would need a benzon but fot me the euphoria and energy I get really surprised me. I say  On it for a month because I was afraid of it because I normally don't like stims  And I even had benzo ready to go just in case it got too badd but would just 20 to 25 mg I was zooming for 6 hours. \n\n And as long as I didn't redose I didn't need a benzo to go to sleep. The duration so long the want refuse redose  Is a lot less common but I also don't have a high stimulant  Tolerance. And use  This more as a tool for my 2nd job then for recreation. Betty me there is extreme recreational value to good quality 4f", "replies": {"fjgsg79": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjgsg79/", "is_submitter": true, "created": 1583363336.0, "body": "See I really wanted to like 4F-MPH because I have enjoyed my experiences with pharma methylphenidate in the past. But the 4F-MPH I had wasn't just subtle, it was totally missing any enjoyable effects. It felt like a half active stimulant. Maybe I'll give it another chance, and try to find some better quality stuff. Sadly both of the RC phenidates I've tried are like that.", "replies": {}}}}}}, "fjcjpzf": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcjpzf/", "is_submitter": false, "created": 1583251768.0, "body": "How do you avoid the come down?  I've been taking it for a 2-3 years now, I'm not addicted, but I take less that, about 15mg week-daily.  Taking about 7am will pretty much give me a shitty come down about 3-4pm.", "replies": {"fjcofom": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcofom/", "is_submitter": true, "created": 1583258245.0, "body": "Are you taking it every day or every week? I take phenibut or kratom for the comedown. It helps a lot, but if you're using daily you would certainly get addicted to phenibut. Once a week is fine though.", "replies": {"fjcqtnx": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcqtnx/", "is_submitter": false, "created": 1583261548.0, "body": "I take it Monday to Friday, almost every day.  Sometime l miss a few days.  Never take at weekends.  Never redose in one day.  \n\nI'll have a look at phenibut.  Thanks", "replies": {"fjemoq4": {"score": 5, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjemoq4/", "is_submitter": false, "created": 1583303288.0, "body": "If you're taking it every day but weekends stay far the fuck away from Phenibut. That stuff will fuck up your life and has awful withdrawals from daily use. I'd stick with lower doses of Kratom if you really need something for the comedown. Kratom can also be addictive but its withdrawals are honestly a cakewalk compared to Phenibut withdrawal, and you're unlikely to get them if you stick to lower doses.\n\nPhenibut also takes like 2+ hours to take effect, so it's not really useful as landing gear. It is also highly acidic, which can change your stomach PH over time, which will make you absorb amphetamines less efficiently. (And can give you digestive problems)", "replies": {}}}}}}, "fjfyvrg": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfyvrg/", "is_submitter": false, "created": 1583333448.0, "body": "I don't know man my roa is orally that is put on pez. And I just don't get the comedown.", "replies": {}}}}, "fjcpqo1": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcpqo1/", "is_submitter": false, "created": 1583260069.0, "body": "I found 4f-mph the only upper I tried that I hate. It's just a awful stimulation with so many side effects. Almost no recreation (due to the extreme HR and physical side effects). Comedown is not so harsh though, but it's only good for functionality for me.\n\n&#x200B;\n\nRitalin or MPH is so much better. It's the same with less side effects for me.\n\nBut I just prefer normal amphetamines.", "replies": {"fjfz0y6": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfz0y6/", "is_submitter": false, "created": 1583333593.0, "body": "Yeah like I said I don't have a stim tolerance for normal real amp, so I don't know if all this has to do with the batches  You guys are getting but there's another server that I'm part of that everyone feels the same way I feel about it at least with this batch that we get", "replies": {}}}}, "fjdyvfc": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdyvfc/", "is_submitter": false, "created": 1583290710.0, "body": "I only got some minimal euphoria from it and it only lasted 4 or 5 hours for me.  It was also hit or miss sometimes.  I would take 15-20mg each time.  Above 20mg and I would get anxious.", "replies": {}}}}, "fjc6xdo": {"score": 10, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjc6xdo/", "is_submitter": false, "created": 1583239053.0, "body": "Are you able to recall the dosage of 3-FEA that turned into a roll?", "replies": {"fjc7g8z": {"score": 10, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjc7g8z/", "is_submitter": true, "created": 1583239479.0, "body": "It's been a little over a year since I've had that one, so the specific dosages are hazy. I know it was over 100 milligrams, I think something like 120. I'm pretty sure an experienced person could tolerate up to 200 milligrams.", "replies": {}}, "fjd4odq": {"score": 3, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjd4odq/", "is_submitter": false, "created": 1583274371.0, "body": "150 mg was the threshold for me with no tolerance. 200-250 mg with a tolerance. I tried redosing at 1 hour with little boost. It was a free sample in my last order from Spain. RIP.", "replies": {"fjd4sgb": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjd4sgb/", "is_submitter": false, "created": 1583274450.0, "body": "Im assuming oral ROA?", "replies": {}}, "fjdcwkc": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdcwkc/", "is_submitter": false, "created": 1583279521.0, "body": "Man you must have gotten really shitty 3-FEA cause Everytime I order it 70+ mg gives me a really nice roll", "replies": {"fjdlp8w": {"score": 3, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdlp8w/", "is_submitter": false, "created": 1583283776.0, "body": "Dunno. If you know the site I was referring to, they were known for selling mostly high quality substances.", "replies": {}}, "fjf53fx": {"score": 3, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjf53fx/", "is_submitter": true, "created": 1583313291.0, "body": "I would guess it has to do more with individual sensitivity.", "replies": {}}}}, "fje3dwf": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fje3dwf/", "is_submitter": false, "created": 1583293255.0, "body": "RIP indeed.", "replies": {}}}}}}, "fjcavxf": {"score": 7, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcavxf/", "is_submitter": false, "created": 1583242386.0, "body": "I can say 2FMA does feel robotic. I’ve only felt euphoria twice when my tolerance was low. \nNow it kind of sucks I don’t want to talk on it which is my big issue.\n\n3FEA is pretty nice. I’ve never tried MDMA or anything similar but it definitely had some type of psychedelic dissociation when combined with weed when I would push the dosage higher. Got kind of scared of this. Everything felt like a play and simulated.", "replies": {"fjcjjpn": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcjjpn/", "is_submitter": true, "created": 1583251554.0, "body": "Yeah, 3-FEA is surprisingly trippy at high doses, I remember it had very strong synergy with weed.", "replies": {}}}}, "fjccwo1": {"score": 4, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjccwo1/", "is_submitter": false, "created": 1583244258.0, "body": "Yeah, I'm not really a fan of 2-FMA either, but I love Adderall. I might have to try some of these other fluoroamphetamines.", "replies": {"fjcjgv1": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcjgv1/", "is_submitter": true, "created": 1583251460.0, "body": "You should definitely try 2-FA if you can get it. People recommend 2-FMA as the alternative to adderall, but it's not nearly as good. 2-FA really feels like an adderall clone.", "replies": {"fjcpkuh": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcpkuh/", "is_submitter": false, "created": 1583259847.0, "body": "Maybe it being not so good is the point for functionality. That makes it good ;)", "replies": {}}}}}}, "fjcm394": {"score": 4, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcm394/", "is_submitter": false, "created": 1583254884.0, "body": "Great list! Thanks for the report. This matches a lot of my findings as well. 3FEA is quite unique and nice. 4FEA is sort of garbage though. 4FA is a lot like 3FEA with more stimulation.\n\nOne of my favorite combos is 3FEA with 2FMA with just slightly more 3FEA. Very pleasant, enjoyable and as functional or recreational as you want it to be if you adjust the ratios.", "replies": {}}, "fjdpuet": {"score": 4, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdpuet/", "is_submitter": false, "created": 1583285703.0, "body": "Obligatory wall of text cause stims", "replies": {}}, "fje2xw6": {"score": 3, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fje2xw6/", "is_submitter": false, "created": 1583293004.0, "body": "3-FPM is a substituted amphetamine. All phenmetrazines are.", "replies": {"fjeerlv": {"score": 4, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjeerlv/", "is_submitter": true, "created": 1583299357.0, "body": "I was under the impression that it was not technically an amphetamine. Thanks for the clarification.", "replies": {}}}}, "fjchofu": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjchofu/", "is_submitter": false, "created": 1583249341.0, "body": "fluorinated*\nfluorine*", "replies": {}}, "fjcoqay": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcoqay/", "is_submitter": false, "created": 1583258670.0, "body": "Great post! Totally agree with your opinion on 3-FPM. It’s so easy to go through grams of that stuff and feel ok the next day. Will definitely check out 2-FA. Heard a lot of good thinks about it too.", "replies": {}}, "fjd0e7w": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjd0e7w/", "is_submitter": false, "created": 1583271251.0, "body": "I still have a smidge of 4FA left from when it was plentiful. Likely my favorite stim I've had.", "replies": {}}, "fjd2noj": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjd2noj/", "is_submitter": false, "created": 1583272951.0, "body": "Excellent reviews. I definitely agree with you when it comes to 2-FMA! What a let down.\n\nHave you tried 4-FA? I tried it years ago over 15 times and found it to be amazing. \n\nThat, and 2-FMA are my only experiences with Fluorinated Amphetamines.", "replies": {"fjdp4r5": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdp4r5/", "is_submitter": true, "created": 1583285306.0, "body": "Never tried 4-FA. I would try it if I got the chance, but with all the reports of negative health effects I'm probably better off away from the stuff, I'm sure I'd love it. \n\n2-FA is what everyone promised 2-FMA to be.", "replies": {"fjdtshk": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdtshk/", "is_submitter": false, "created": 1583287906.0, "body": "Never experienced any negative health effects from 4-FA personally. I’m just staying away from Fluorinated Amphetamines in general anyways.", "replies": {}}}}}}, "fjdm68x": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdm68x/", "is_submitter": false, "created": 1583284003.0, "body": "This is a great post, thank you for writing. However, 6 apb does not have a bad comedown IMO. Just my 2 cents (it's not even the same category of rc).", "replies": {"fjdpd53": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdpd53/", "is_submitter": true, "created": 1583285434.0, "body": "For me any drug that releases enough serotonin to be an empathogen has a rough comedown. So in for me 6-APB has comedowns that are rather unpleasant.", "replies": {}}}}, "fjdsjop": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdsjop/", "is_submitter": false, "created": 1583287210.0, "body": "Ever tried 3MMC?", "replies": {"flalbvv": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/flalbvv/", "is_submitter": true, "created": 1585014935.0, "body": "Yeah, it's pretty good. But if I'm gonna roll and feel like shit after I might as well have a roll that lasts longer than an hour. That's my take on it.", "replies": {"flam88x": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/flam88x/", "is_submitter": false, "created": 1585015444.0, "body": "Yeah when I did it I would redose alot the urge was so bad", "replies": {"flaxu23": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/flaxu23/", "is_submitter": true, "created": 1585022115.0, "body": "Same here. It feels good, but a fiendish empathogen is really destructive in my experience.", "replies": {}}}}}}}}, "fjdt2dk": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdt2dk/", "is_submitter": false, "created": 1583287499.0, "body": "3fpm tolerance is fking gnarly ime eventually during heavy addiction tolerance and insane dosages lead to so many harmful metabolites, the vasoconstriction becomes unbearable and coupled with dehydration probably wreaks havoc on kidneys. I’m talking 1-2g per day orally, which also causes sporadic gagging (maybe from high bp?) this compound quickly consumed my life since initially it allowed for productivity I couldn’t have imagined (having only used 2fma prior). I think the metabolites are also largely responsible for the inevitable psychosis when abusing 3fpm daily (even with sleep).", "replies": {}}, "fje2fm2": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fje2fm2/", "is_submitter": false, "created": 1583292717.0, "body": "Super helpful", "replies": {}}, "fjesv7u": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjesv7u/", "is_submitter": false, "created": 1583306409.0, "body": "This is the type of quality post that keeps this subreddit alive.  I salute you fellow speed freak.\n\nI also salute you for sharing your opinion on 2-FMA which seems to be this subs golden boy but I felt the same way about it that you did.  If you strip the euphoria out of a stimulant it's not just going to feel neutral, IMO it feels kind of bad.", "replies": {"fjf0odj": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjf0odj/", "is_submitter": true, "created": 1583310601.0, "body": "Thank you. I took the extra time and effort to edit in proper grammar and decent formatting to a wall of stim text, so I'm glad it's appreciated. I'm glad I'm not alone in thinking 2-FMA is poop.", "replies": {"fjf0xp1": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjf0xp1/", "is_submitter": false, "created": 1583310758.0, "body": "I also share most of your opinions and analyze RCs in a similar fashion so your post was validating to read. Keep doing you bud, be safe.", "replies": {}}}}, "fjjijfs": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjjijfs/", "is_submitter": false, "created": 1583426498.0, "body": "You obviously never tried IV administered 2-FMA.", "replies": {}}}}, "fjfv0qa": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfv0qa/", "is_submitter": false, "created": 1583329871.0, "body": "I dont feel any come down and been researching every day for months now. Every person is different i guess. If I do feel too stimulated I research 2-3mg etiz", "replies": {"fjfv67l": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfv67l/", "is_submitter": false, "created": 1583330002.0, "body": "I dont like really strong stim but these batches I've been researching give extreme euphoria to me but I also don't have a stim tolerance", "replies": {"fjfvek3": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfvek3/", "is_submitter": false, "created": 1583330200.0, "body": "If you read about 4mph it says it reuptake way way more dopamine. So maybe for ppl that didn't like it maybe bad or cut batches.\n\n I built an entire shed in back yard in the winter with a smile on my face", "replies": {}}}}}}, "fjc9037": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjc9037/", "is_submitter": false, "created": 1583240761.0, "body": "4-FA is equally available for the whole world, you need to go dark net for it these days, probably shipping from NL, but it's definetly out there.", "replies": {"fjchq36": {"score": 4, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjchq36/", "is_submitter": false, "created": 1583249395.0, "body": "Its really rare and hit or miss though. Most “4-FA“ sold in the Netherlands is actually 4-FMA or any other fluorinated amphetamine. Laboratory results from the Netherlands confirm that (https://assets-sites.trimbos.nl/docs/bdb79228-d2eb-45ea-8f1a-671456a3ad16.pdf).\n\nMost dealers in the NL just sell 4-FMA as 4-FMP nowadays as the names are pretty similar and a lot of recreational users dont even know or notice the difference between 4-fluoroamphetamine and 4-fluoromethamphetamine. Even on the deepweb there‘s plenty of dealers that sell 4-FA/4-FMP but if you check their description it says fluoroMETHamphetamine.\n\nIm not saying its impossible to get but your chances of getting real 4-FA are very low.", "replies": {"fjck4b9": {"score": 6, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjck4b9/", "is_submitter": false, "created": 1583252272.0, "body": "I'm in NL. Yes a lot of low level dealers pass off 4fma as 4fa, specially since the ban. However, just like 4mmc, it is available again. You just have to know where to look. Once you know where to find it it's not so rare. I expect it to become even more available soon as more clandestine operations pick up on it.", "replies": {"fjckqpo": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjckqpo/", "is_submitter": false, "created": 1583253077.0, "body": "Really interesting! I hope this is true, because 4-FA was one of my favorites! The example you made with the 4-MMC makes this a lot more believable.", "replies": {"fjckry0": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjckry0/", "is_submitter": false, "created": 1583253123.0, "body": "Also keep in mind the source you sited is almost 2 years old at this point.", "replies": {}}}}}}, "fjckcpi": {"score": 3, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjckcpi/", "is_submitter": false, "created": 1583252569.0, "body": "To ad to this, if you can find the same organization that produced the 4MMC presses that you had tested originally, you will be able to find legit 4-FMP.", "replies": {"fjcpxnm": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcpxnm/", "is_submitter": false, "created": 1583260336.0, "body": "Yes, but it's a bit on the 'weak' side, I thought - on the other hand, I tend to prefer 4-FMA, so possibly just subjective.", "replies": {}}}}}}}}, "fjcr4oq": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcr4oq/", "is_submitter": false, "created": 1583261959.0, "body": "3-𝐅𝐏𝐌 𝐢𝐬𝐧'𝐭 𝐚 𝐟𝐥𝐨𝐮𝐫𝐢𝐧𝐚𝐭𝐞𝐝 𝐚𝐦𝐩𝐡𝐞𝐭𝐚𝐦𝐢𝐧𝐞; 𝐢𝐭'𝐬 𝐚 𝐩𝐡𝐞𝐧𝐦𝐞𝐭𝐫𝐚𝐳𝐢𝐧𝐞 𝐚𝐧𝐚𝐥𝐨𝐠𝐮𝐞. 𝐈𝐭'𝐬 𝐜𝐥𝐨𝐬𝐞𝐫 𝐭𝐨 4-𝐌𝐀𝐑 𝐭𝐡𝐚𝐧 𝐚𝐦𝐩𝐡𝐞𝐭𝐚𝐦𝐢𝐧𝐞𝐬.\n\n𝐄𝐃𝐈𝐓: 𝐀𝐥𝐬𝐨 4-𝐅𝐀 𝐢𝐬 𝐚 𝐫𝐞𝐚𝐥𝐥𝐲 𝐠𝐫𝐞𝐚𝐭 𝐅𝐀 𝐦𝐨𝐫𝐞𝐥𝐢𝐤𝐞 𝐚𝐧 𝐌𝐃𝐱 𝐭𝐡𝐨𝐮𝐠𝐡. 3-𝐅𝐀, 𝐨𝐟 𝐜𝐨𝐮𝐫𝐬𝐞, 𝐢𝐬 𝐢𝐧𝐜𝐫𝐞𝐝𝐢𝐛𝐥𝐞 𝐭𝐡𝐨𝐮𝐠𝐡.", "replies": {"fjdonzo": {"score": 4, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdonzo/", "is_submitter": true, "created": 1583285048.0, "body": "I know, but I wanted 3-FPM to be able to sit at the big kids table for a bit", "replies": {}}, "fjdoyg5": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdoyg5/", "is_submitter": false, "created": 1583285210.0, "body": "Why do you think 3-fa is incredible?", "replies": {"fjetljl": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjetljl/", "is_submitter": false, "created": 1583306786.0, "body": "IMO 3-FA was interesting because it's pretty similar in duration to regular amp and gives a nice clean euphoria with more relaxation and less 'tweakiness'.  It doesn't do quite as much in terms of helping organize my thoughts and it's about 70% of the potency but it was quite nice and rather clean feeling.  \n\nI haven't binged on it in the event it does release 5HT (and because I only had a single gram that I likely can't replace)", "replies": {"fjeza7j": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjeza7j/", "is_submitter": false, "created": 1583309808.0, "body": "Had a similar experience with it bit personally cant say I prefer it over regular amphetamine. It was recently available in limited quantities so I snatched up a gram. Idk if another will be available.", "replies": {"fjf0nio": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjf0nio/", "is_submitter": false, "created": 1583310587.0, "body": "Yeah I don't prefer it to amphetamine since I'm prescribed it and enjoy it more than any other stimulant (empathogens aside).  It does bring something interesting to the table and is overall a pretty good stim so I thought it was worthwhile to mention.", "replies": {"fjf171x": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjf171x/", "is_submitter": false, "created": 1583310916.0, "body": "Give ethcathinone a shot! Really surprised me as a stimulant recently.", "replies": {}}}}}}, "fjfttya": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfttya/", "is_submitter": true, "created": 1583328895.0, "body": "I wish 3-FA was more available, it sounds really good. Based on what I've heard about it it should be as good if not better than 2-FA, so I can't imagine it would be unpopular. Do you feel like it does release 5HT? I was under the impression it is a very straightforward functional stim like amphetamine.", "replies": {"fjfvz1p": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfvz1p/", "is_submitter": false, "created": 1583330697.0, "body": "I've actually made a very detailed post on this sub in the past on the pharmacology of 3-FA and it's propensity to release 5HT.  To me it feels like it, and the data suggest it's possible.  It feels like there's just enough to smooth out all the jitters and tweakiness of the stimulation.  Still very functional though.", "replies": {}}}}}}, "fk3gkc8": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fk3gkc8/", "is_submitter": false, "created": 1583861286.0, "body": "I always really wanted to try 3-FMA but 3-FA is the closest I got, so I just threw it in there for shits and giggles.", "replies": {}}}}, "fjeea6o": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjeea6o/", "is_submitter": false, "created": 1583299093.0, "body": "What's so special about 3-fa? What dose are you taking?", "replies": {}}}}, "fjcye8a": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcye8a/", "is_submitter": false, "created": 1583269599.0, "body": "I would have loved to hear your opinion of 4-FA, such a shame it isn’t around anymore. Though that one had the most side effects of any of the flourinated ones. Tinnitus was ever present if one abused 4-FA.\n\nIt was pretty much what I would have assumed regular amphetamine and MDMA would feel like but with a duration of a solid 8-10 hrs. Miss it so much. But damn did it do a number to the receptors after a while.", "replies": {"fjemctt": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjemctt/", "is_submitter": true, "created": 1583303095.0, "body": "It's good to hear my opinions are appreciated. I agree though, even with the potential risks I would have given it a try. It sounds pretty great, but I have a feeling it might have been one of those drugs that you should only be taking once every month or two tops. I imagine due to its similarity to amphetamine many people probably assumed they could use it with the frequency of \"normal\" amphetamine. It seems to have achieved legendary status, among the like of MXE and 4-MMC.", "replies": {}}}}, "fjczhyb": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjczhyb/", "is_submitter": false, "created": 1583270531.0, "body": "Thank you for sharing this. I used to be a frequent stimulant user, really, really enjoyed 2-FA at that time. Got me through graduate school ;-) Very functional, with smaller side-effect profile compared to some other amphetamines. Made me curious to try the others, but I never got around to it. Some of the FMAs sound interesting.", "replies": {"fjdouek": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdouek/", "is_submitter": true, "created": 1583285148.0, "body": "All the FMAs are harsher than 2-FA imo. The only particularly interesting one is 3-FMA", "replies": {}}}}, "fjd05dv": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjd05dv/", "is_submitter": false, "created": 1583271058.0, "body": "I haven't tried 3-FEA, but it sounds fairly similar to 4-FEA, except that I really don't enjoy 4-FEA that much. 3-FEA gets way better reviews. It's definitely an empathogen and turns me into a rolling couch [potato](https://potato.It). It goes extremely well with ketamine since it preserves the relaxing aspect.", "replies": {}}, "fjd1qji": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjd1qji/", "is_submitter": false, "created": 1583272273.0, "body": "Thank you!  Great write up. These are what I love to read.", "replies": {}}, "fjd9a2g": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjd9a2g/", "is_submitter": false, "created": 1583277338.0, "body": "The way you write about 3-FEA is how I felt about DOC. 8 hours of mildly uncomfortable stimulation, then 8-16 hours of relaxing enjoyment of whatever I was doing.", "replies": {"fjdp83q": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdp83q/", "is_submitter": true, "created": 1583285357.0, "body": "Those two are really different in my experience.", "replies": {}}}}, "fjey7cs": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjey7cs/", "is_submitter": false, "created": 1583309212.0, "body": "A great. I'm really interested in your 3-FPM dose, I do have a naturally high tolerance to amphetamines and need 100-120mg of 3-FMP to feel a mood boost and slight euphoria, anything less makes me feel weird.", "replies": {"fjf0g55": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjf0g55/", "is_submitter": true, "created": 1583310459.0, "body": "When I take 3-FPM I redose a lot, so the individual doses vary. A lot of times I'll take 80 milligrams put it on some foil and take turns having vape hits off it with my girlfriend. For a single oral dose I take about 50 milligrams. While vaporizing I take anywhere from 10 to 50 milligrams in one sitting. I don't take large doses at once, I just redose until I'm satisfied with this one. It's one of the few RCs I would actually feel comfortable doing without a scale, because if I accidentally take double what I was expecting I'll be fine, probably enjoy it too.\n\nI don't really know what 3-FMP is referring too, but assuming it's an amphetamine I would say you could probably tolerate and enjoy very large amounts of 3-FPM.", "replies": {}}}}, "fjf6xui": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjf6xui/", "is_submitter": false, "created": 1583314403.0, "body": "Wall o text or not, this is actually to me a very informative post.\n\nThe only problem I see is ...I have questions... many, many questions. It's caused me to think of some things in a different way and reminded me of effects I got before that I am not getting now.\n\nI'd DM you but I have a feeling you're going to be swamped with those... but If you get the time I have a specific question (maybe two) that although doubtful you'd be able to answer I think you'd probably have some thoughts on that might be useful to me, or at least point me in the direction I need to get some answers.", "replies": {"fjf7ydo": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjf7ydo/", "is_submitter": true, "created": 1583315015.0, "body": "Honestly I wasn't expecting people to appreciate the post this much, so I'm very happy about it. If you have questions please feel free to DM me, I like discussing this stuff. It's not like I can talk about these things with most people in my life.", "replies": {"fjfnura": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfnura/", "is_submitter": false, "created": 1583324588.0, "body": "I think I probably should use an older account. to message you.... if it's not bad form or something.\n\nI had my note typed out and got a message to open the full form to do a captcha and lost it all, although the message said it wouldn't do that, LOL\n\nTruthfully though, I want to do it over as I would like to seem like I have at least half a brain when I describe my situation and I keep burning up throwaway accounts by getting distracted and using them for other stuff.\n\nI do appreciate your attention to detail so I'm hoping that will help me to SWAG something I can't test.", "replies": {"fjfq41m": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfq41m/", "is_submitter": true, "created": 1583326122.0, "body": "Message me of whatever account you feel like, I'm not a picky fellow.", "replies": {"frxunb3": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/frxunb3/", "is_submitter": false, "created": 1590576586.0, "body": "Hey man, I got busy busy and I have so many usernames I forgot all about this one. I have a multiboot setup and even though I resisted as long as I could stand it I finally had to cave and let Fiurefox sync send my PW for all my places because I have about 300 now and it's a huge PITA to try keep up with moving them manually, LOL", "replies": {}}}}}}}}}}, "fjfrrdg": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfrrdg/", "is_submitter": false, "created": 1583327311.0, "body": "As a fellow stimulant lover I would highly recommend 4-FA! I would say it is the perfect stimulating empathogen. The stimulation is strong, but not overly pushy and the empathy is much the same.  For recreation and socializing I don't think it can be beat - it is too empathetic for productivity though.  \n\n3-FEA sounds quite nice. I'd like to try that one.", "replies": {"fjfthe8": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjfthe8/", "is_submitter": true, "created": 1583328624.0, "body": "Sadly I might have missed my chance to get that one. I hear it's available on the darknet, but I don't source from there. It sounds really great though. 4-FMA felt like it was almost something really good, and I guess that something is 4-FA.\n\nYou should try it, it's really quite nice.", "replies": {"fnz2wx1": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fnz2wx1/", "is_submitter": false, "created": 1587413325.0, "body": "Sadly the vendor that had the best 4-FA was shut down. They were the best in the business.", "replies": {}}}}}}, "fjghwnz": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjghwnz/", "is_submitter": false, "created": 1583355896.0, "body": "I used to abuse 3-FEA when it was legal in like 2018 and I would class it as being more like 3-MMC and 3-CMC. Pretty rolly but still stimulating and pretty short lasting.", "replies": {"fjgsvrm": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjgsvrm/", "is_submitter": true, "created": 1583363599.0, "body": "I do recall 3-FEA having a relatively short duration. Between that and the low potency it doesn't exactly make it the cheapest stim", "replies": {"fjji8wi": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjji8wi/", "is_submitter": false, "created": 1583426101.0, "body": "It was sold for like 20 euro/g which is same as street Amphetamine here which is much less potent, so it turned out cheap. I injected it in 50-100mg doses.", "replies": {"fjk5sfg": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjk5sfg/", "is_submitter": true, "created": 1583449475.0, "body": "Street amphetamine must be utter shit.", "replies": {"fjkhmq8": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjkhmq8/", "is_submitter": false, "created": 1583455808.0, "body": "Usually it's pretty damn cut but sometimes it's pretty pure(like 50%)", "replies": {"fjloisr": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjloisr/", "is_submitter": true, "created": 1583479686.0, "body": "That's a shame honestly. I think users would pay more for better product. At least in the US we have a corrupt pharmaceutical system that will give premium speed to any student who says they can't focus.", "replies": {"fjmluwe": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjmluwe/", "is_submitter": false, "created": 1583503373.0, "body": "Yeah I think so too. On the dnm the price is halved while quality is same or better though", "replies": {"fjnfait": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjnfait/", "is_submitter": true, "created": 1583534877.0, "body": "God bless the dark net", "replies": {}}}}}}}}}}}}}}}}, "flhyisl": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/flhyisl/", "is_submitter": false, "created": 1585200702.0, "body": "How do you pass as sober if amphetamines especially at higher doses cause pupil dilation? Whenever I'm coming down off oral doses of meth my pupils look like dish plates.", "replies": {"flin0tn": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/flin0tn/", "is_submitter": true, "created": 1585214864.0, "body": "If you take some kratom those babies will get a lot smaller. My pupils don't get very dilated unless I'm pretty spun though. I'm usually extroverted so it's easy for me to pass as sober on speed.", "replies": {}}}}, "fjcxia7": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjcxia7/", "is_submitter": false, "created": 1583268826.0, "body": "Damn it, I just ordered 2fma.", "replies": {"fjdpf5y": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdpf5y/", "is_submitter": true, "created": 1583285465.0, "body": "Quick, get some 3-FPM or 2-FA!", "replies": {"fjdpm0o": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjdpm0o/", "is_submitter": false, "created": 1583285572.0, "body": "I got 2 fa also", "replies": {"fl9c4w2": {"score": 2, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fl9c4w2/", "is_submitter": false, "created": 1584977843.0, "body": "Are you sure you got 2-fa.I thought it was long gone.", "replies": {"fl9ogxa": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fl9ogxa/", "is_submitter": false, "created": 1584993118.0, "body": "[removed]", "replies": {"fl9oh0m": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fl9oh0m/", "is_submitter": false, "created": 1584993121.0, "body": "[**Any drug sourcing or mentioning vendors for any reason in this subreddit will result in an immediate banning. This includes links to legal drug vendors and subreddits where sourcing is prevalent.**](https://www.reddit.com/r/Drugs/about/rules/)\n\nDelete your post immediately for a warning instead of a ban[.](https://imgur.com/VvMSm9r) We STRONGLY suggest you have a good read of the [rules](https://www.reddit.com/r/Drugs/about/rules/). ^(We don't have time to mess around - you break them, you're out. We have 70,000 people who manage to follow them just fine.)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/researchchemicals) if you have any questions or concerns.*", "replies": {"fl9oiq7": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fl9oiq7/", "is_submitter": false, "created": 1584993171.0, "body": "Okay saggy naggy", "replies": {}}}}}}, "fl9oqyv": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fl9oqyv/", "is_submitter": false, "created": 1584993407.0, "body": "You can never be sure. I *DIDNT* get it from something named da real are see.", "replies": {}}}}}}}}, "fjed12s": {"score": 1, "link": "/r/researchchemicals/comments/fcone5/my_reviews_on_all_of_the_flourinated_amphetamines/fjed12s/", "is_submitter": false, "created": 1583298410.0, "body": "Don't be discouraged. 2-fma is fantastic in its own right.", "replies": {}}}}}}, "f4gqse": {"text": "I have a serious problem and could use some advice. Note that I have been prescribed Seconal (one of the most addictive drugs) in the past and stopped it without a second thought. I also have no addictions and I am 49 years old.\n\nUsed to think I had chronic kidney stones so I went to the ER frequently. Often there was a stone but sometimes there wasn’t. I had always assumed I simply passed it.\n\nIn 2014 I had severe pain and visited a urologist who did a CAT or MRI and found no stones and send me to a spine pain specialist. As it turns out I had broken my back when I was much younger - maybe 14-15 years old (see image). Of course, I didn’t know that at the time but I did have a significant fall.\n\n[https://i.imgur.com/tAcn69B.jpg](https://i.imgur.com/tAcn69B.jpg)\n\nI was treated with cortisone shots in my spine and the pain vanished within a day or two. That lasted about four years which I’m told is considered a great outcome.\n\nOver the last couple of years this pain has been increasing. I had more cortisone shots about a year ago. Those helped for about two weeks and since that time it has only grown worse.\n\nAt this point I have to stay in bed for 2-3 days in order to be more mobile for a day without massive pain. As a result I have gained a lot of weight (up to 400 lbs), so exercise has become more difficult. Walking almost any distance is painful. Sitting upright for long periods of time is painful. I am doing intermittent fasting combined with Keto to help weight loss but there is only so much that can do with such inactivity.\n\nThe spine pain specialist told me that medications will not help with the exception of these cortisone pills which I can only take twice a year. I believe he may be right as at one time I did try taking Hydrocodone and there was absolutely no discernible difference in the pain.\n\nSO MY QUESTION is:\n\nDoes anyone know of anything that may be much stronger that could help me be more mobile to the point where I can lose enough weight in order to qualify for spinal surgery? I know nothing about OxiContin or Fentanyl. I’m considering seeking help from a pain control doctor of some kind, but if there is likely nothing that can treat my pain to some degree I won’t bother.\n\nI really need some guidance here. I’m concerned that I may end up with a pain specialist who is more of a pill mill. I need help, not a high. In fact, I think the only time I have ever experience anything like that was at the ER with huge doses of morphine and I’m not interested in a feeling other than NOT HURTING when I need to be more active.\n\nAny advice or thoughts are appreciated. I don’t think I will live long the way things are going, and I am married with four kids (sole large-income provider who works at home).\n\nTHANK YOU!", "author": "bdunn", "score": 8, "flair": null, "created": 1581833805.0, "url": "https://www.reddit.com/r/researchchemicals/comments/f4gqse/severe_back_pain_help/", "num_comments": 81, "title": "Severe back pain. Help?", "subreddit": "researchchemicals", "comments": {"fhqkep1": {"score": 20, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqkep1/", "is_submitter": false, "created": 1581834571.0, "body": "reddit is not a good place to get medical advice. This sub in particular is poorly suited to help you out. There are research chemical opiates that can mask the pain but that will probably only make the underlying problem worse as you run the risk of pushing yourself too far since you can't feel the pain.\n\nGo see a pain specialist. Go see multiple. Don't trust anyone here (including myself).", "replies": {"fhqksfy": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqksfy/", "is_submitter": true, "created": 1581834772.0, "body": "Oh I know. I'm really just looking for ideas and thoughts that I might bring up with a doctor. I just finished watching The Pharmacist on Netflix and now I have a lot of questions. I have to do something.\n\nDoes anyone have any thoughts about Methadone or a Fentanyl Transdermal Patch? Or maybe Pregabalin?", "replies": {"fhqmc1w": {"score": 3, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqmc1w/", "is_submitter": false, "created": 1581835460.0, "body": "I use Butrans for my chronic pain.  \nIt’s good for me. Although I use other opioids for breakthrough.", "replies": {"fhqml6k": {"score": 3, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqml6k/", "is_submitter": true, "created": 1581835558.0, "body": "Butrans? I will look that up.\n\nSorry - what do you mean by breakthrough? When the pain overcomes Butrans?", "replies": {"fhqn276": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqn276/", "is_submitter": false, "created": 1581835746.0, "body": "Breakthrough pain is what happens when your pain meds don’t take hold and you have to use another opioid to handle it.", "replies": {"fhqo68y": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqo68y/", "is_submitter": true, "created": 1581836344.0, "body": "Right. That makes sense. A urologist told me many years ago not to wait to take pain medications because if I wait too long my guts will kind of seize and absorption will not really help. He gave me stadol (?) for sudden attacks. That seems to work very well, but it also made me sleepy. I just looked it up and that's a nasal Butorphanol (whatever that is) and I do remember that it worked VERY fast.\n\nSo ideally I would have something that would help the every day pain and also something used solely for breakthrough pain as needed, but definitely not every day.\n\nRelated to that, I'm being told (on Reddit - yes I know) that taking something like Oxycontin every day would get me hooked, but if I took it once or twice a week I would probably be okay. Does that sound right?\n\nThanks for explaining.", "replies": {"fhqrplv": {"score": 3, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqrplv/", "is_submitter": false, "created": 1581838677.0, "body": "Butorphanol is an opioid for moderate pain. You don’t see it much. It has a potential to be addictive in its own right. \nAs for oxycodone you have to ask yourself what direction is your recovery headed in. \nIs your current situation able to be fixed or minimized in any way? If so getting on oxycodone really isn’t your best option. \nGetting on it you may find not an easy task either. \nRegardless communication with your doctor is key. Having a long term plan is what’s key. \nSourcing drugs is easy. Fixing your body is the hard part. In the mean time plenty of things are available to you. Keep your head up.", "replies": {}}}}}}}}}}, "fhqmhv2": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqmhv2/", "is_submitter": false, "created": 1581835523.0, "body": "[deleted]", "replies": {"fhqojhd": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqojhd/", "is_submitter": true, "created": 1581836529.0, "body": "Good advice. I was thinking about taking them a list and telling them that I asked on Reddit and then just showing them the list since I basically have no idea and I’m not about to try anything on my own.\n\nIf I can find a doctor.\n\nIt occurs to me that finding a good doctor for this might be difficult. I doubt we have a Jacqueline Cleggett around the corner, not that I would EVER want that. Watch The Pharmacist on Netflix for more info on that. Wow.\n\nEDIT: Took out how to find a doc. Bot explained the rules to me.", "replies": {}}}}, "fhs4pey": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhs4pey/", "is_submitter": false, "created": 1581882472.0, "body": "[deleted]", "replies": {"fhw6s49": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhw6s49/", "is_submitter": true, "created": 1581936588.0, "body": "What do you mean?", "replies": {"fhy74un": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhy74un/", "is_submitter": false, "created": 1581998786.0, "body": "[deleted]", "replies": {"fhyeelr": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhyeelr/", "is_submitter": true, "created": 1582003046.0, "body": "Yeah. Sad it seems to be the case today.", "replies": {}}}}}}}}, "fhqobxn": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqobxn/", "is_submitter": false, "created": 1581836422.0, "body": "[deleted]", "replies": {"fhqpqtc": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqpqtc/", "is_submitter": true, "created": 1581837276.0, "body": "Wow. I'm SO glad I asked. Scratching those off my list now.\n\nI have wondered about THC and CBT oil. It's illegal here (Texas) but I could have something sent from Colorado pretty easily. Is there one type that is considered better for pain than another? I'm not interested in getting high - just in the pain relief. I've read that a a lot of people have relief with THC. CBT - not even the first clue about that.\n\nWilling to try anything that isn't going to kill me. This is a miserable life right now.", "replies": {"fhqpx7i": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqpx7i/", "is_submitter": false, "created": 1581837403.0, "body": "[deleted]", "replies": {"fhqqe50": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqqe50/", "is_submitter": true, "created": 1581837743.0, "body": "Thank you. If it comes to that I will hit you back for more info. I doubt it comes to that if I can find the right doctor.", "replies": {"fhr7mxp": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr7mxp/", "is_submitter": false, "created": 1581848317.0, "body": "CBD is a godsend for sleep but idk about pain. If you have inflammation which sounds like you do get some CBD right away. CBD doesn't get you high at all. Maybe a little tired if you overdo it. Opioids don't treat what's wrong they mask it. And it's a one way road to addiction. I know you are thinking about it but you've made if this far and haven't had them. So just please try other methods first. Stem cell? Heard that on Joe rogan and stem cells seem to fix the shit out of everything.", "replies": {"fhrzcy3": {"score": 3, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhrzcy3/", "is_submitter": false, "created": 1581874827.0, "body": "[deleted]", "replies": {"fhsftan": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhsftan/", "is_submitter": false, "created": 1581888997.0, "body": "Well yes it would because it's not a broken bone it has healed. There is inflammation at the site likely and causing pain especially during or after hard work. OP may have to slow down hard work to mitigate the worst pain but I believe the pain is caused by inflammation on his back. We shall see by next week I'm sure he will pop back in to report how the cbd does. Hell it's way better than trying opioids which led him here in the first place. He watched the pharmacist which I also watched. And unlucky for me I got into oxy and was handing over full paychecks for oxy 80s.and doing 80 mg a day eventually was so far in debt had to move to suboxone which kept me an opiate slave for over 3 more years. Nevermind the relapses with heroin I had multiple times until I started doing kratom everyday. Been over 3 years now pill and heroin free. TX probably has kratom illegal unfortunately.", "replies": {"fi2se9h": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fi2se9h/", "is_submitter": false, "created": 1582116528.0, "body": "Totally legal in TX surprisingly enough", "replies": {"fi2tvgz": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fi2tvgz/", "is_submitter": false, "created": 1582117762.0, "body": "I did read that too after the fact. Was very surprised. I live close enough to MA and I doubt it will be illegal anytime soon there so I'm good for now. I feel like a drug mule when I bring it back where I live. Haha. Sir what is that? Oh this kilo? Just for personal use. You want a cup of tea officer?", "replies": {}}}}}}}}}}}}}}, "fhw3c1u": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhw3c1u/", "is_submitter": false, "created": 1581934193.0, "body": "Don't let random people tell you a certain drug won't work for you. Everyone is different", "replies": {}}}}}}}}}}, "fhr607b": {"score": 10, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr607b/", "is_submitter": false, "created": 1581847079.0, "body": "[deleted]", "replies": {"fhr6c9b": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr6c9b/", "is_submitter": true, "created": 1581847330.0, "body": "I already have a script for Adzenys which is amphetamine. It’s a pretty high dose as well. On top of everything else I have ADD but I only take that when I know I’m going to have a day that it may help. \n\nWould that be the same as an amphetamine analogue?\n\nI will upvote you! Thanks.", "replies": {"fhr7739": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr7739/", "is_submitter": false, "created": 1581847979.0, "body": "[deleted]", "replies": {"fhr7g9b": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr7g9b/", "is_submitter": true, "created": 1581848174.0, "body": "Oh yeah. We are taking the same thing or very similar. I think it probably did help before this pain made me largely immobile. Thanks!", "replies": {}}}}}}}}, "fhqztgr": {"score": 4, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqztgr/", "is_submitter": false, "created": 1581843015.0, "body": "What about high dose cbd", "replies": {"fhr19jt": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr19jt/", "is_submitter": true, "created": 1581843808.0, "body": "I have never heard of doing that. How is that done? Is it safe?", "replies": {"fhr85wl": {"score": 3, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr85wl/", "is_submitter": false, "created": 1581848630.0, "body": "Well be careful. U want full spectrum CBD oil. Not hemp oil. Big difference.", "replies": {}}, "fhr33cs": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr33cs/", "is_submitter": false, "created": 1581844885.0, "body": "https://www.medicalnewstoday.com/articles/319475\n\nJust find some oil online. Take some and see how you feel", "replies": {}}}}}}, "fhrpid1": {"score": 4, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhrpid1/", "is_submitter": false, "created": 1581862347.0, "body": "I know you don't want pills but have you at least tried oxy or dilaudid? With your weight you would need something much stronger than hydrocodone.", "replies": {"fhw6z7p": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhw6z7p/", "is_submitter": true, "created": 1581936727.0, "body": "I have never tried either. I know that Hydrocodone which works for kidney stones does ABSOLUTELY NOTHING for this pain. My spinal pain specialist told me that really nothing but steroids would help my pain.\n\nHowever, on the suggestion of many people I tried Kratom today for the first time. I am in a lot of pain now, but I had the most active day without a ton of pain I've had in months. There is something to this.", "replies": {}}}}, "fhsk7sl": {"score": 3, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhsk7sl/", "is_submitter": false, "created": 1581890693.0, "body": "These days you're lucky if you get prescribed anything worthwhile. Doctors turned from one extreme (opiates for everyone) to the other extreme (opiates for no one and if you do get some it's either super low dose or you're getting accused of being a junky if you ask for more).\nI had multiple spine surgeries myself that left me with chronic pain. Was on dilaudid for many years until I suddenly got dropped off from one day to the next. It was nightmarish.\nLuckily I found a new pm doc that is willing to prescribe me opiates in a well enough dose. I take 300 to 400mg of morphine hcl extended release now every day and my quality of live improved drastically. Yes, I'm addicted. But I'd rather be dependend on morphine than to live in pain 24/7.", "replies": {"fhw7efg": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhw7efg/", "is_submitter": true, "created": 1581937026.0, "body": "But I'd rather be dependend on morphine than to live in pain 24/7.\n\nTHIS. EXACTLY. Well, I don't really know what addiction would be like as I have never experienced it myself, but it's hard to imagine it could be worse than this.\n\nCan you tell me how you found your doctor? That's what I am in the process of doing now and I really have no idea how to go about asking for something that will help. I don't even want something long term or on a daily basis. I just need something that will help me get through the days I am normally having to rest in bed (WHICH SUCKS!!!) following an active day.", "replies": {"fhwuwv0": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhwuwv0/", "is_submitter": false, "created": 1581960279.0, "body": "It took me months and lots of money and several doctor visits to finally find a pm doc that was willing to prescribe me the morphine. Before the opioid epidemic scare in the media, my old doc prescribed me 24mg hydromorphone ER plus 6x 2.6mg IR which worked for my pain. Then I suddenly got told that I have been taking the dilaudid far too long and was cut off, although the doctor knew that this would put me in withdrawal. For the next months I medicated myself with heroin, which didn’t make things easier in regards to finding a new doc. The first 4 I visited turned me down and accused me of being a junky. Luckily my psychotherapist with whom I was talking very openly about my problems regarding pain and opioid dependency and withdrawal found a very liberal pain management doctor for me. The first who truly listened to my problems and didn’t accuse me automatically. I see him once a month now and get a steady prescription. He even doesn’t mind it when my urine tests positive for THC - as long as I don’t test positive for other opioids / heroin and don’t take benzos. I’m happy to have established a doctor patient relationship based on trust with that guy. He also pointed out that most doctors these days are scared of prescribing opioid painkillers because of the whole epidemic talk in politics and media. They don’t want to get fined or go to prison for prescribing opioids, so their first reaction is to be hostile towards the patient asking for them.\n\nGood luck finding a doctor man. These days it will take some trial and error. But there are still docs out there that listen to their patients without prejudice.", "replies": {}}}}}}, "fhqkz1x": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqkz1x/", "is_submitter": false, "created": 1581834869.0, "body": "[deleted]", "replies": {"fhql9cl": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhql9cl/", "is_submitter": false, "created": 1581835011.0, "body": "I'm really curious why you wrote \"if\" three times in place of \"of\".", "replies": {"fhqlm2g": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqlm2g/", "is_submitter": false, "created": 1581835160.0, "body": "Oof, how didnt I notice that??", "replies": {}}}}, "fhqq03a": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhqq03a/", "is_submitter": true, "created": 1581837460.0, "body": "Thank you. You lost me on the first sentence but I will research all of that. O-DSMT, analogs of Fentanyl, metabolite of Tramadol (same as O-DSMT I think). I appreciate the suggestions and I will look into all of that and will probably be back with ... questions. :-)", "replies": {}}}}, "fhr36xf": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr36xf/", "is_submitter": false, "created": 1581844960.0, "body": "Listen dude. You need to get your diet in check. There is no excuse to get up to 400lbs because of an injury. As for treatment and pain relief, you might actually get some very good results running a light steroid cycle and do what you can to strengthen your lumbar muscles.", "replies": {"fhr3idd": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr3idd/", "is_submitter": true, "created": 1581845196.0, "body": "I agree. That’s why I’m asking. My diet is keto and I am 16:8 intermittent fasting along with that. It’s just not working.\n\nI’ve been using a stepper to try to strengthen my back muscles. I’m not sure if it is helping or not.\n\nThe pain is so bad that I am immobile (in bed) for two days for every one day I am somewhat mobile. Anything more than that and I can’t function due to the pain. In fact, it gets so bad at times that I worry about my teeth and I catch myself clenching my teeth just to go to the bathroom following a day of being more mobile.", "replies": {"fhr40an": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr40an/", "is_submitter": false, "created": 1581845570.0, "body": "Are you tracking calories at all? I would suggest exercises if I didn’t look at your x rays.  Where exactly is the pain?", "replies": {"fhr4f4t": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr4f4t/", "is_submitter": true, "created": 1581845883.0, "body": "Yes. We track calories closely. I am consuming about 1500-2000 calories a day.\n\nThe pain is mostly now across my back. Say when I stand it is across my back. After I am up for five minutes the pain is not noticeable. If I continue going (up and down, sitting and little walking) for a few hours the pain slowly increases.\n\nIf I have a very busy day because I have no choice, by the end of the day it is impossible for me to get up to make it to the bathroom. I try to stand and just can’t make it. I have had to use a urinal on those days.\n\nThe pattern that seems to work best so far is two days of rest and one day or mild activity. It’s no way to live.", "replies": {"fhr4k91": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr4k91/", "is_submitter": false, "created": 1581845991.0, "body": "Lower back? Spinal erectors area?", "replies": {"fhr4zzm": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr4zzm/", "is_submitter": true, "created": 1581846321.0, "body": "Sorry. Yes, lower back.\n\nI’ve tried hydrocodone which used to work for kidney stones. For this, they do NOTHING. Advil - nothing. Tylenol 3 - nothing.\n\nNot sure about spinal erectors.\n\nI suppose I am not thinking so much about the source of the pain anymore - it’s just pain. When I’ve done too much it’s overwhelming pain. Twice I was walking and my legs just went away from me like spaghetti. Having had kidney stones for many years (not in 5-10 years), this pain far exceeds anything kidneys ever did to me. This is completely debilitating.", "replies": {"fhr5l7w": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr5l7w/", "is_submitter": false, "created": 1581846761.0, "body": "Your legs going away from you sounds like nerve entrapment. You may benefit from doing some basic YouTube yoga and gently trying to open up your hip flexors and lower back.", "replies": {"fhr5phr": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr5phr/", "is_submitter": true, "created": 1581846854.0, "body": "I will look into that. I once tried Yoga when I was much younger and it was incredibly painful. That was before I knew I had a broken back. LOL", "replies": {"fhr6idu": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr6idu/", "is_submitter": false, "created": 1581847459.0, "body": "I think doing it at home without anyone around will be so much better for you. You don’t have to deal with trying to keep up appearances with other people and can rewind if you think you don’t have the right form and pause if you need a break. Just try to loosen your pelvis and lower back and keep the diet in check and you will be on the path to healthy pain relief", "replies": {"fhr6pjs": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr6pjs/", "is_submitter": true, "created": 1581847606.0, "body": "Ha. Yeah that’s how I tied it. With my wife and daughter at home. At the time I decided that women were just more limber as there was NO WAY I could possibly do what they were doing.\n\nOkay. I will work on some yoga and keep doing the stepper.  I’m willing to try anything really.", "replies": {"fhraf8n": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhraf8n/", "is_submitter": false, "created": 1581850126.0, "body": "Of you want to dm I’ll help as much as I can.", "replies": {"fhrahg5": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhrahg5/", "is_submitter": true, "created": 1581850170.0, "body": "Thanks. I appreciate that.", "replies": {"fhraodg": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhraodg/", "is_submitter": false, "created": 1581850313.0, "body": "I went from 250 lbs to 170 lbs and i would love to get someone else there too.", "replies": {"fhrar6d": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhrar6d/", "is_submitter": true, "created": 1581850370.0, "body": "That’s awesome. I’m so ready to get back in shape. Four kids and another one maybe on the way soon.", "replies": {"fhrb0wz": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhrb0wz/", "is_submitter": false, "created": 1581850560.0, "body": "I’ve got an eight month old but have only gained ten pounds since birth and I expect to lose weight as soon as my little man starts walking.\n.", "replies": {"fhrb5ag": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhrb5ag/", "is_submitter": true, "created": 1581850645.0, "body": "Yeah you need to. Don’t waste any of that time. Remember that. It goes by very quickly. (Another big reason I posted all this today)", "replies": {"fhrbr4r": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhrbr4r/", "is_submitter": false, "created": 1581851074.0, "body": "Don’t hesitate to dm me. Before my son was born i was logging 10+ hours a week with jj alone.", "replies": {}}}}}}}}}}}}}}}}}}}}}}}}}}, "fhs99ci": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhs99ci/", "is_submitter": false, "created": 1581885405.0, "body": "I'd track your calories more precisely. 2000 calories is probably too much for most people to lose any weight. You need to consistently hit a precise number and adjust by weighing yourself regularly.", "replies": {"fhw75cs": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhw75cs/", "is_submitter": true, "created": 1581936848.0, "body": "I should have been a little more clear I guess. The weight is coming off, but not quickly by any stretch of the imagination. To lose weight, according to my height and weight and (current) lifestyle, I think I'm supposed to have around 2250 calories a day. I'm under that and since I started intermittent fasting, I am really not all that hungry which is weird. A lot of people experience that.\n\nI have scales that sync up to Apple Health and I track it pretty carefully.", "replies": {"fhx7hqg": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhx7hqg/", "is_submitter": false, "created": 1581975863.0, "body": "All right, that sounds good! If you're losing about 1lb per week you should be good. I'm sure you've noticed by now that it's a marathon, so losing too quickly might make you quit if it becomes too difficult. Be mindful of that and slow down if it's too hard, it's obviously better than quitting.\n\nAnother thing you could look into is peptides. Two compounds that often come up in discussions about injury recovery are BPC-157 and TB500. There is a subreddit for peptides: /r/Peptides. A quick google search will give you more info.\n\nYou might be able to find a doctor who will know about these compounds. I honestly don't know how common these treatments are, but it seems to work for a variety of injuries.", "replies": {}}}}}}}}, "fhr4l87": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr4l87/", "is_submitter": true, "created": 1581846011.0, "body": "I was doing pretty good during the warmer months. We have a pool and that helped a lot just treading water for 45-60 minutes at a time. I lost about 45 lbs doing that. Now the pool is way too cold to do that. Walking is way too painful. I can ride my bike a little.\n\nTwo years ago I was riding my bike 20-30 miles from time to time (we have a very long bike path next to our neighborhood).", "replies": {}}}}}}}}, "fhr4eds": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr4eds/", "is_submitter": false, "created": 1581845866.0, "body": "cbd is one of the canibinoids in weed it doesn't get you high at all like thc and recently there has been much legalization of cbd where i live (upstate NY) at least 4 cbd stores have opened up within a mile from me and many more. cbd is good for you isnt addictive and many people have found it helps with chronic back pain such as yours. they give it to dogs even to help them out with pain too. personally i dont need it im more of a bud guy but whatever. also acids pretty fucking great but do whatever man.", "replies": {"fhr4oso": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr4oso/", "is_submitter": true, "created": 1581846085.0, "body": "It is legal for sale here. I’ve seen vape stores that sell CBD. I guess what I’m confused about is what determines high dose? What would I ask for?", "replies": {"fhr5zcp": {"score": 3, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr5zcp/", "is_submitter": false, "created": 1581847063.0, "body": "well you can ask the worker at the vape store but if they don't have an answer 20 mg is for average pain in your case you might want 40-50 mg a day and its not just vaping they sell bud that has no thc only cbd also oils gummies/edibles all kinds but you need to experiment i would suggest buying the oil or edibles just to get an exact dosage but get whatever they all work", "replies": {"fhr64k2": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr64k2/", "is_submitter": true, "created": 1581847169.0, "body": "Thank you. I think I will run out there now just to see how that works. I know our bodies have cannabanoid receptors for a reason. 🤪", "replies": {"fhr856t": {"score": 3, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr856t/", "is_submitter": false, "created": 1581848620.0, "body": "lmk how it goes!", "replies": {}}, "fhr80xi": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr80xi/", "is_submitter": false, "created": 1581848551.0, "body": "Grab some edibles and bring your phone to make sure your getting high quality. Then go to sunsoil.com it's 50% off February and the capsules they have are awesome. 20mg 30 count only 15 bucks. 600mg for $15 Is a great price plus shipping of course they also sell topicals. I feel like an AD. Lol but seriously sunsoil Edit: GOLD!!!!! Thank you anonymous or I suspect /u/bdunn", "replies": {"fhr8ht4": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr8ht4/", "is_submitter": true, "created": 1581848807.0, "body": "They have this. What do you think?\n\n\nhttps://www.swissrelief.com/buy-cbd/pure-gel-caps-1500mg/", "replies": {"fhr8yv1": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr8yv1/", "is_submitter": false, "created": 1581849094.0, "body": "Hard no. Too expensive. Sunsoil.com has a sale right now. Way better prices.", "replies": {"fhr91nt": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr91nt/", "is_submitter": true, "created": 1581849150.0, "body": "Yeah I just saw that. I will order online. Thanks again!", "replies": {"fhr9mpn": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr9mpn/", "is_submitter": false, "created": 1581849567.0, "body": "Your welcome. Did you say you were in TX? Or MA and don't ask how I know MA. Haha", "replies": {"fhr9p2d": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr9p2d/", "is_submitter": true, "created": 1581849615.0, "body": "Texas. Already ordered. Should be here by Thursday. Hope it helps some. Thank you.", "replies": {"fhr9una": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhr9una/", "is_submitter": false, "created": 1581849727.0, "body": "Awesome. I hope so too!!", "replies": {"fhra3io": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhra3io/", "is_submitter": true, "created": 1581849898.0, "body": "You’ve been super helpful. Have your comment earlier some gold. Saved me $45. 😀", "replies": {"fhraqve": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhraqve/", "is_submitter": false, "created": 1581850363.0, "body": "I knew it was you!!! Tyvm! I've tried a lot of CBD you made the right choice with them used to be green mountain CBD but changed their name likely due to legal matters. (Green mtn coffee) drink plenty of water too seems like could help especially if your dehydrated. I've had kidney stones 15 years ago and man it was pain I wouldn't want on my worst enemy. Hang in there!", "replies": {"fhrax8h": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhrax8h/", "is_submitter": true, "created": 1581850488.0, "body": "Thank man.", "replies": {}}}}}}}}}}}}}}}}}}}}}}}}}}}}, "fhtgecj": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhtgecj/", "is_submitter": false, "created": 1581903020.0, "body": "For loosing weight defenitely try certain amphetamine analogues like 2-FMA, maybe phenmetrazine analogues like 3-FPM - basically search for a functional stimulant on this sub. stay on your diet and long-term you probably will see results; if not, go even further with your diet. if you decide to use stimulants, watchout for your heart!", "replies": {"fhw7jq9": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhw7jq9/", "is_submitter": true, "created": 1581937133.0, "body": "Thanks. I am already taking Adzenys XR-ODT which is really just a very fancy and expensive amphetamine, but it works for me. I take it for ADD and only occasionally ween I think I may need it... like... conference calls that require my active participation.", "replies": {}}}}, "fhtvhyk": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhtvhyk/", "is_submitter": false, "created": 1581907505.0, "body": "Rc opiates suck because of the whole fentanyl analogue death toll and the horrible u47700 side effects.\n\nApart from desmethyltramadol (aka basically what tramadol turns into when you take it) the opiate RC scene is dead imo. And hydrocodone is stronger than that AFAIK.\n\nYou don't need to exercise to lose weight. Look up a TDEE calculator and eat below your daily calories. You'll lose weight even if you never get off the bed. Calories in calories out is the only thing that works, exercise allows you to lose faster or eat a bit more it doesn't magically make you lose weight. \n\nHonestly you can also probably do a long term fast to lose the weight, at 400lbs you have a lot of vitamin stores to last a long while with the appropriate supplements. \n\nGood luck with your surgeries, chronic pain is no joke. I've had chronic wrist and stomach pain for years now its hell and doctors \"can't see anything wrong\"", "replies": {"fhw7ud0": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhw7ud0/", "is_submitter": true, "created": 1581937351.0, "body": "Hydrocodone is stronger than Tramadol? I tried taking hydrocodone which I had for kidney stone pain, and it did NOTHING for this.\n\nI was thinking about a long term fast, but I need to get with the doctor that is helping me with that first. I read about a guy in the UK who was about my weight and he didn't eat for about a year. Seriously. And he never gained the weight back. It was some kind of water fast with supplements. That is something I'm not sure I'd be able to do. It seems dangerous and I’m not sure if there was a good reason for this guy to do that or not. I will try to find that again.\n\nThanks man. I appreciate it. I also appreciate the info.", "replies": {"fhw8w7i": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhw8w7i/", "is_submitter": false, "created": 1581938127.0, "body": "You only need to supplement electrolytes like sodium potassium magnesium calculator and carbonate. Those get depleted in a fast and can give you health problems if you don't supplement them. I've done 16 day fasts with the right electrolyte supplementation, and i was 130lbs back then(don't do what i do tho lol), a 400lb man would have no problems fasting longer.", "replies": {"fhw98qi": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhw98qi/", "is_submitter": true, "created": 1581938394.0, "body": "Interesting. How would you find the right dosages on all of that? Anything more in detail you know that you could share with me? I'm up for a longer term fast as I'm pretty sure that would take off weight fast. And given my weight at the moment, shedding weight fast should not be that hard.\n\nBy the way, I tried Katrom for the first time today. I was almost pain free during several times of the day and had an unusually active day. Literally praying that was no fluke. I thought I would give it a shot based on how many people recommended it, and I didn't really expect results at all. I'm very surprised at how well I think it helped me.\n\nOf course, now, I am in excruciating pain, but today was awesome.\n\nThanks!!!!", "replies": {"fhyy9mf": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhyy9mf/", "is_submitter": false, "created": 1582015360.0, "body": "Oh also autocorrect made calcium into calculator lol", "replies": {}}, "fhwzmkv": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhwzmkv/", "is_submitter": false, "created": 1581967244.0, "body": "Awesome! Glad kratom works for you!\n\nLook up snake juice", "replies": {}}}}}}}}}}, "fhvm3ku": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhvm3ku/", "is_submitter": false, "created": 1581927583.0, "body": "Oddly, I find lysergamides and tryptamines (particularly bufotenine) to be analgesic. Your mileage may vary, however.", "replies": {"fhw81g2": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhw81g2/", "is_submitter": true, "created": 1581937494.0, "body": "Thanks. I will add those to the list to discuss with whichever doctor (or doctors?) I find. I'm in the process of doing that now, but I'm not really sure how that's done. How does one go about trying to find a doctor who is willing to prescribe medications that will be strong enough to relieve this pain so I can have a somewhat normal and definitely more active life?\n\nIf I can't find a doc, I'm going to ask a couple of friends that are doctors and just tell them exactly what's going on. Since they know me they may have mercy on me. Hopefully it won't come to that. Anyway, thanks!", "replies": {}}}}, "fhvm6nm": {"score": 2, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhvm6nm/", "is_submitter": false, "created": 1581927622.0, "body": ">  don’t think I will live long the way things are going, and I am \n\nI used to worry just the same, I couldn't see myself living past 55. I'm a few years younger than you but my body is probably twice as old as yours. I was an Offensive Lineman through college (UMICH'93-'97). I'm 6'8.3\" and 267-270lbs now but target playing weight was 340lbs and I made it up to 390lbs a few times during the off-season (I was also 6'9\" on the nose 20 years ago).\n\nMy body is a fucking mess, my knees not too bad but my back is cursed. Team doctors used to hand out 180ct scripts of Vicodin and Percocet, which I continued well after school. Starting in my 30's after 14 surgeries and dozens of steroid injections in the spine and nerve ablation procesudres (which burning of the nerve roots worked the best), my pain management doctors (also at University of Michigan) moved me over to the Fentanyl pain patch (100mcgr/hr on day 1 of 3 and another 50mcgr/hr patch on day 2-3) plus 10-20mg Opana (oxymorphone) 2-3 times a day for breakthrough. Fentanyl didn't work very well for nerve pain and being a purely synthetic opiate, made me super grumpy all the time. Natural opiates like Vicodin and Opana. give me a warm feeling and lift my mood.. and while taking opiates the mood natural opiates put me in did more good in helping me ignore the pain than it did blocking it.\n\nI couldn't stand taking opiates any longer though, I got pulled over once and had pain patch wrappers in my car (I would put one on out in my car before work and just toss the wrappers in the pocket of the door, but I didn't have the box they came in and got arrested in front of my children. So I told my doctors I was taking myself off everything and was just going to live with the pain. My pain management doctors said \"please, don't do that\" and wanted me to try Suboxone (the opiate abuse treatment drug) for the back pain and it worked better than anything else I had tried and I would recommend that to most people, but for me it was still not enough to justify all the hassle of monthly DR visits, monthly blood work, and monthly blood drugs tests, etc. I took that for a year before hearing about Kratom. I took myself off the Suboxone, tried Medical Marijuana for a few months which didn't do anything for the pain and then finally gave Kratom an honest effort. That was 4-6 years ago and I haven't stopped taking Kratom since. It works amazingly well. My dosage is the same as when I started and I get around as well as my 75 year-old father now, where he used to get around waaaay better than me.\n\nAnyways, I feel or have felt exactly where you're at. Have kids that need their pops but am not looking forward to the pain getting any worse. Before I found what worked and made the pain tolerable for me (Kratom), I thought about suicide, hoping my kids would understand that the pain was so intense that I spent 70% of my waking hours unable to think and only be able to say \"omfg, omfg, omfg, please stop hurting, omfg\".\n\nMy best recommendation: throw the book at it. Go to a pain clinic. They treat not only the symptoms of pain but also the psychological aspects of it too. If something doesn't work, ask them to try something else and they'll usually oblige.", "replies": {"fhw8vcx": {"score": 1, "link": "/r/researchchemicals/comments/f4gqse/severe_back_pain_help/fhw8vcx/", "is_submitter": true, "created": 1581938108.0, "body": "Wow. This is an amazing reply! Here's some gold. And here's why:\n\nFirst off, you made me fell a lot less sorry for myself reading what you have been through. Being arrested in front of your children for your pain medication. Unreal.\n\nI have a few questions and I may DM you on some of this:\n\nHow do you go about finding a good pain medicine doctor for this kind of pain? I think we have the same kind of pain which is being caused by pinching nerves in the spine. It hurts worse than anything I can imagine (and I've had plenty of kidney stones). I am in the process of looking for real help now. Since my spine pain specialist told me no pain meds would help me, and after trying Hydrocodone and having ZERO relief like I took nothing at all, I kind of gave up. After watching The Pharmacist on Netflix, I rather ironically started to think about getting help as my life is not improving. I feel it is getting worse and fast. This is the first time in my life I had to come face to face with the fact that I am actually... mortal. Why are men/boys so damn stupid?\n\nBased on a lot of recommendations, I tried Kratom this morning and then I had a very active day (for me compared to how it's been recently). Right now I am in incredibly pain, but throughout the day I didn't feel the pain anything like I had every day until today. They were sold in pill form, and there is no dosage per pill indicated. They also sell it in powder form. Since this may have worked for me, at least for today, could you tell me more about how you take that and manage it? I am absolutely clueless about Kratom other than my experience with it today that I am literally praying was not a fluke. I spent hours with my son working on installing a CarPlay stereo in his car. I cannot tell you how wonderful something that simple was to me considering how it has been for many months.\n\nAnything you can share on what you are doing and what did and did not work for you would be appreciated. I will also DM you.\n\nThank you for sharing man!!!!!", "replies": {}}}}}}, "f9f7hs": {"text": "&nbsp;\n\n\n&nbsp;\n\n\n##### All the *R*esearch *C*hemicals I have tested\n\n&nbsp;\n\n&nbsp;\n\n| Name | Rating | Thoughts|\n|:----:|:------:|:-------:|\n|1P-LSD| 8/10   |LSD-25 is cheaper|\n|ALD-52| 8/10   |LSD-25 is cheaper|\n|4-AcO-DMT| 10/10| Will be remembered as legendary whenever it is unavailable|\n|5-MeO-MiPT| 8/10|It absolutely could be used as a substitute for MDMA for a night out|\n|25E-NBOH| 9/10|My hidden treasure :) |\n|2C-E| 10/10| Too many good times spent living in *2C-E*ternity|\n|3C-P| 7/10| Very stimulating but not in equal ratio to its visual effects|\n|DOC| 9/10| A very long and worthwhile experience|\n|DPT| X| Have had trouble effectively smoking this compound|\n|JWH-018| 7/10| I loved making edibles with this compound|\n|5F-ADB| 8/10| Highly potent, probably toxic, infrequent use was fun\n|3-HO-PCP| 7/10| Enjoyable compound, would rather take 3-MeO-PCE|\n|3-MeO-PCE| 8/10| An excellent addition to any trip|\n|DCK| 6/10|Enjoyed my PCP/PCE experiences more|\n|DXM| 10/10| Hear me out, my experiences were with pure powder DXM and every single one has been HIGHLY enjoyable|\n|Clonazolam| 8/10| Good for sleep, highly potent, most people can't avoid abusing this compound|\n|Flualprazolam| 8/10| 2-3x as potent as Alprazolam|\n|GBL| 10/10| I refuse to drink alcohol. GBL is 100% better|\n|2-Methyl-AP-237| 6/10| Toxic to your organs, infrequent use for short term pain management was effective\n|N-Ethylhexedrone|6/10| Most will end up abusing this compound, fun for 2-3 doses|\n|N-Ethylpentedrone| 7/10| More enjoyable than N-Ethylhexedrone|\n|α-PHP| 9/10| I will only ever orally or intranasally administer this compound, one dose a night, good fun at a concert|\n|4F-MPH| 10/10| Amazing compound for productivity| \n|3-FPM| 6/10| Not really my style of stimulant|\n|6-APB| 8/10| A pretty visual empathogen, quite a bit longer then MDMA, very highly enjoyable, it is a worthwhile experience.|\n\n&nbsp;\n\n&nbsp;\n\n##### All the *D*rugs I have tested\n\n&nbsp;\n\n&nbsp;\n\n| Name | Rating | Thoughts|\n|:----:|:------:|:-------:|\n|LSD-25| 10/10| Do you even need me to say anything about this legendary compound?|\n|Mushrooms| 8/10| I would honestly rather take 4-AcO-DMT due to it being easier on my stomach|\n|Ketamine| 7/10| Need to experiment more with this, would rather use a PCP analog for a night out|\n|Fentanyl| 6/10| Great for pain management, I used this under hospital care|\n|Morphine| 7/10| Great for pain management, I used this under hospital care|\n|Oxycodone| 8/10| I feel comfortable using this in a recreational setting|\n|Kratom| 9/10| Sort of nauseous at high doses, very fun for me personally, the downside is taking so many pills to get an effective dose|\n|Hydrocodone| 8/10| Great for migraines and pain management, wouldn't use it recreationally|\n|Baclofen| 10/10| Great little compound to help you sleep after a night out|\n|Adderall| 9/10| I'd describe it was multi-threaded thinking. I would start another test question and while solving it I would figure out the correct answer to a past question.|\n|Ritalin| 9/10| Good compound, would rather take 4F-MPH|\n|Modafinil| 8/10| Migraines and headaches can make you HATE this chemical if you are not smart with it.|\n|MDMA| 9/10| An excellent choice for any night out involving music|\n\n&nbsp;\n\n&nbsp;\n\n\n\n##### Notes\n\n&nbsp;\n\n\n\nI do not have an addictive personality, I have never had any problems stopping the use of a drug or chemical, I have a large amount of self control with substances. \n\n\n&nbsp;\n\nMy experiences may not match your experiences especially with highly addictive and dangerous chemicals like \"α-PHP\" or \"Clonazolam\".\n\n\n&nbsp;\n\nFeel free to ask me any questions about my experiences or ask for advice on their use.\n\n\n&nbsp;\n\n\n&nbsp;", "author": "kingjj", "score": 31, "flair": null, "created": 1582686132.0, "url": "https://www.reddit.com/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/", "num_comments": 67, "title": "My Research Chemical and Drug Review Compilation", "subreddit": "researchchemicals", "comments": {"fir8qo0": {"score": 6, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fir8qo0/", "is_submitter": false, "created": 1582688413.0, "body": "I never had too much trouble stopping a compound either, how did your experience with NEP go? I read that it can be super fiendish and that's the only thing I'm worried about.", "replies": {"firanzs": {"score": 7, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firanzs/", "is_submitter": false, "created": 1582689509.0, "body": "NEP is child's play compared to like a-php/a-pvp", "replies": {"firayw2": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firayw2/", "is_submitter": false, "created": 1582689678.0, "body": "Can you compare NEP to Coke or amphetamine?", "replies": {"firboam": {"score": 5, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firboam/", "is_submitter": false, "created": 1582690084.0, "body": "It's like a better coke but lasts much longer too?\n\n\nNEP isn't bad, but it's nowhere close to true pyros", "replies": {"firbro9": {"score": 3, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firbro9/", "is_submitter": false, "created": 1582690138.0, "body": "That's what I thought, there is no other stimulant that's less fiendish than coke isn't it? Cuz I actually didn't want to consume anything that's more fiendish than coke.", "replies": {"firdty2": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firdty2/", "is_submitter": false, "created": 1582691293.0, "body": "If you're looking for a rush/ceiling, you're going to run into fiendishness.\n\n\nJust how it works", "replies": {"fireje5": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fireje5/", "is_submitter": false, "created": 1582691679.0, "body": "I'm so confused, the only time I really experienced fiendishness was with nitrous on MDMA (not even nitrous alone) and was originally only looking for a more recreational and shorter lasting substitute for speed and started looking into the RC market and stumbled upon NEP but the constant warnings and talks about people getting on day long binges with this stuff threw me off.\n\n cuz no substance stands between me and my sleep :D the concept of something being so fiendish that you can't stop until it's gone sounds pretty bad but the other effects all sound like the perfect substitute as long as you  a) don't have access to too many redoses or even better b) could control the greed\n\nI've never been a greedy person period but I'm afraid that this stuff could still make me.", "replies": {"fiscebb": {"score": 6, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fiscebb/", "is_submitter": false, "created": 1582710948.0, "body": "MDMA and Nitrous is the best combination ever. Its mind bending but it gave me DMT like effects and I blasted off to the end of time. I met this entity at the end of time and I asked it to tell me everything about the existence of the Universe. The entity told me a story that felt like it took a 1000 years to tell and right at the end, I said out loud \"that story is insane, no one will ever believe me if I tell them this\". The entity said none of this matters anyway and you will forget everything when you go back to Earth. After that, the nitrous wore off and it had only been about 30 seconds since I first took the nitrous. It felt like I spent a thousand years listening to this entity and was so disappointed that I couldn't remember the story of the Universe when I came back to Earth. All I  can remember is exactly what I wrote in this comment but it was still a very enlightening experience. I've tried MDMA and nitrous a few other times and it has given me more answers about the universe than any other drug I've tried. I felt like I was a thought and an object at the same time, like I was transforming between energy and matter. This is something everyone should try, nitrous is very safe too. Would love to hear your experiences with MDMA and Nitrous", "replies": {"fivnhp8": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fivnhp8/", "is_submitter": false, "created": 1582792752.0, "body": "One time I was doing no2 with my buddy and he told me after every pull I kept telling him i had the best idea ever but i couldn't tell him cause it would ruin it. I remember i kept having epiphanies and it was super trippy, but shortly after the experience, I couldn't remember what any of them were lol. Oh well", "replies": {"fiw6mq6": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fiw6mq6/", "is_submitter": false, "created": 1582805290.0, "body": "Exactly what happened to me too. I kept getting my mind blown every time I took the no2, kept saying I figured everything out and it turned into a joke in the end because after every hit I took, I would remember that I was going to forget everything and then I realised I kept forgetting everything because the information I was receiving was meant to be kept a secret as I was unable to speak out loud the ideas I was getting. Eventually I managed to pull some information out, writing down things as well but I don't know if I remembered this 'secret'. I figured out that I was merely a thought travelling through still frames of reality and that time was created by travelling through these still frames one by one like a digital video. It looks like a lag effect. Every frame of reality exists at once in the Universe; past, present and future. The Universe is like a finshed film and time is the illusion of movement created by travelling through these still frames of the film one by one, from start to finish. I also figured out that our conscious is nothing but a chain of thoughts and memories, a chain of moments of reality. Every thought connects with a unique reality or dimension. Our thoughts mirrors our environment and we are moulded by the thoughts and moments we remember. We can change who we are by changing our thoughts and memories. I had contradictory thoughts all the time too. I remember being a thought and the environment at the same time, kinda like the quantum cat theory, I felt like I was alive and dead at the same time as well. I eventually realised that everything in the Universe exists on a spectrum and that the world isn't black or white. We are a mix of two opposites which means I could be 90% alive and 10% dead and that makes me healthy and energetic or I could be 60% alive and 40% dead which makes me sick and have no energy. Gender is mixed too and defined by masculine and feminine energies. I could be 80% masculine and 20% feminine which makes me a man or I could be 45% masculine and 55% feminine which makes me a tomboy. 90% feminine and 10% masculine would likely make me a girly girl. We are all a mix of light and dark energy, good and bad, yin and yang. The spectrum theory really helps me understand why the world works the way it does. One other thing I remember as well is that I felt like I had no control over the thoughts I was having, it felt like my mind was mirroring the environment and it was the environment that was in control of my thoughts. For example, if I wanted to take another hit of the No2, it was the energy of the No2 itself that gave me the thoughts to huff it. If I wanted to eat a burger for dinner, it was the collective energy of the burger that gave me the thoughts to want to eat one. It's like all matter has a purpose and we get thoughts based on the environments energy and purpose. This has led me to start to believing that everything in the Universe is consciousness and I'm now experimenting with the idea that the conscious environment controls the everyday thoughts that you have. MDMA and No2 together is truly a powerful experience and I've always had mind blowing trips every time. Who knows what I'll find out next, what do you think of the information I got out of this mix?\nI've never had experiences this mind blowing before.", "replies": {"fiyec40": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fiyec40/", "is_submitter": false, "created": 1582866568.0, "body": "Consciousness is energy and the universe is an ocean of energy. Everything that exists was already here in some form, just constantly changing. Some things change fast and some things take forever, but time is relative. I enjoy the information you got out of your experience. I've felt this way for a long time now. My epiphanies were basically about an ending for a book I will one day write that will hopefully be able to explain these profound through the story I'll come up with. Wish I could remember those endings cause they seemed super clever at the time lol.", "replies": {}}}}}}}}}}}}}}}}}}}}, "firgzrf": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firgzrf/", "is_submitter": true, "created": 1582693018.0, "body": "I am probably not the best person to ask about the fiendishness of a chemical but with NEP I usually do 2-3 bumps for a night out. \n\nI still semi-occasionally partake in it for social outings with friends. I have had no innate desire to consume it outside of social outings or have had thoughts about taking it randomly throughout my day to day.", "replies": {"firhjo9": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firhjo9/", "is_submitter": false, "created": 1582693318.0, "body": "That's reassuring to hear. My top law also was to never take any drugs on my own and I've held to that my entire life except my very lowest points no matter the substance. \nI guess I'll order a minimal amount, and keep it at a friend's house just to be safe.", "replies": {"firhw5a": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firhw5a/", "is_submitter": true, "created": 1582693510.0, "body": "I think the danger is that people keep taking more to achieve some 'high' that maybe isn't even reachable with the chemical if that makes sense. Best of luck man.", "replies": {}}, "firv6r6": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firv6r6/", "is_submitter": false, "created": 1582700620.0, "body": "This is a great rule to follow. I used to follow this for alcohol, and then broke it.  Now alcohol is ruined for me, because I see it as something to relieve stress and not to just go out and socialize.  Don't even like it anymore actually because it just puts me to sleep.\n\nI don't think you really need to follow this rule for something like psychedelics though, since the urge to do it again doesn't have the same character, and there is benefit to experiencing them alone.", "replies": {"firvdht": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firvdht/", "is_submitter": false, "created": 1582700717.0, "body": "Yup Psychs are probably the only exception but even there I feel uncomfortable doing them alone. I must have at least a sitter in the next room.", "replies": {"firvyn9": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firvyn9/", "is_submitter": false, "created": 1582701016.0, "body": "probably the best option to be safe if you have the sitters.  I just have nobody who is interested in psychs to join me!", "replies": {}}}}}}}}}}}}, "firu6hr": {"score": 3, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firu6hr/", "is_submitter": false, "created": 1582700096.0, "body": "What's your preferred dose for 25E-NBOH?", "replies": {"firyj91": {"score": 4, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firyj91/", "is_submitter": true, "created": 1582702536.0, "body": "1.3mg is the standard dose for a single tab of it. 2.6mg to 4mg is my usual dosing.", "replies": {}}}}, "firas82": {"score": 3, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firas82/", "is_submitter": false, "created": 1582689575.0, "body": "Lmao the one chemical that's currently relevant to me is an \"X\"\n\nWhat's that mean? Straight trash? Didn't try it enough? So much better than anything else it doesn't fit on the scale?", "replies": {"firfw9w": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firfw9w/", "is_submitter": true, "created": 1582692422.0, "body": "I just haven't been able to properly 'blast off' with it, I have tried many ways to freebase it and even tried smoking the salt I have of it. \n\nThe salt was very putrid and caustic to the airways. I want to try it either rectally or nasally but I know the drip is terrible.\n\nI have tried 5-6 different ways to freebase it and none were proper well. I even have pictures of all my processes as I was planning on making a proper how-to guide on the process of freebasing it for the subreddit.", "replies": {"firhipc": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firhipc/", "is_submitter": false, "created": 1582693304.0, "body": "I just used the baking soda tek last time, didn't wash with acetone or anything, it's super easy and seems to work well; biggest issue IMO is finding the correct temp", "replies": {"firhrcp": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firhrcp/", "is_submitter": true, "created": 1582693436.0, "body": "I have been certainly confused as to my results with freebasing it. I think I am properly freebasing it but I need to find a better way to actually smoke it. I have been attempting to use a dab rig but with very limited luck.", "replies": {"firj4z9": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firj4z9/", "is_submitter": false, "created": 1582694176.0, "body": "I've had mixed results with the dab rig, think it's partially the temperature and partially not being able to hold all the vapour for long enough; a few times I've had my vision go mostly white like I'm about to go off but it's just not quite there, but my shipment is on its way so hopefully I'll figure it out", "replies": {"firjpeq": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firjpeq/", "is_submitter": true, "created": 1582694479.0, "body": "If you find a good way to smoke it please do let me know.\n\nThe strangest fucking thing actually was my friend smoked it out of a lightbulb and a lighter (this was the salt also) and he just held it deep as hell cause he's been a smoker for most of his life and believe it or not he blasted off.", "replies": {"firkoqg": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firkoqg/", "is_submitter": false, "created": 1582695009.0, "body": "Was actually thinking some sort of crack pipe or maybe a nectar collector type of thing would work well, or even an actual bucket-banger for the dab rig, currently using titanium and there's just not enough surface area I feel", "replies": {}}, "firksky": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firksky/", "is_submitter": false, "created": 1582695069.0, "body": "But ya, I'll prob try a higher temp with the dab rig and maybe keep the carb half off to allow more airflow, if it doesn't work I guess I'll explore other options", "replies": {}}, "fisa3vj": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisa3vj/", "is_submitter": false, "created": 1582709710.0, "body": "Have you tried making \"the machine\" type of device to smoke it?", "replies": {"fism8y6": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fism8y6/", "is_submitter": true, "created": 1582716505.0, "body": "No, not had the huge drive to go that far yet.\n\nMight revisit smoking the chemical when I find a chunk of free time though.", "replies": {}}}}}}}}}}}}}}}}, "fircye7": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fircye7/", "is_submitter": false, "created": 1582690809.0, "body": "6abp...it what ways is it similar/dissimilar from mdma? Duration? Jw cause mdma/2c-b are my favorite", "replies": {"firg1zc": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firg1zc/", "is_submitter": true, "created": 1582692508.0, "body": "More visual, like I have had traditional psychedelic visuals from it after a long roll. 5-7 hour roll, not instantly flooring like MDMA is. If you like MDMA and 2c-b do definitely try it while it is available, also try 5-meo-mipt.", "replies": {"firg9h3": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firg9h3/", "is_submitter": false, "created": 1582692619.0, "body": "What’s up with 5-Meo-mipt? And I have my market and back up market and back up back up market but nothing legit on a “grey” RC market...", "replies": {"firha5j": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firha5j/", "is_submitter": true, "created": 1582693174.0, "body": "It is more rare then 4-AcO-DMT or other tryptamines but so are most of the 5-MeO-xxxx class. I would say it is absolutely not out of the question to find it on a clearnet website. With some searching I am sure you could find it, It was certainly worth buying in my opinion.", "replies": {"firifag": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firifag/", "is_submitter": false, "created": 1582693795.0, "body": "I’ll look into it. It’s just the sites I’ve found that are “clear” or even “grey” seem to legit as funny as that seems. Hard to pick one to try", "replies": {"fit3gap": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fit3gap/", "is_submitter": false, "created": 1582731631.0, "body": "Look north young man and think logically", "replies": {}}}}}}}}}}}}, "firvph6": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firvph6/", "is_submitter": false, "created": 1582700885.0, "body": "I don't get why I don't get the same reaction from 5-meo-mipt that everybody else seems to get.  I don't see the similarities to MDMA.  Just jittery with some mild confusion and body electricity for a few hours then there was some afterglow, but not MDMA-like in my opinion.  Maybe I just need to take more...", "replies": {"firym2s": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firym2s/", "is_submitter": true, "created": 1582702585.0, "body": "I mean, that's sort of the similarities I was talking about. The stimulation, tactile enhancement, vision enhancement and music appreciation.", "replies": {"firzidh": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firzidh/", "is_submitter": false, "created": 1582703157.0, "body": "The euphoria and empathetic qualities are just not there for me to consider it in the same category as MDMA though.", "replies": {"fisyyqr": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisyyqr/", "is_submitter": false, "created": 1582726580.0, "body": "I feel the same way. I’ve gone up to 18 mg and didn’t enjoy it. No euphoria. Barely any visuals. Not an enjoyable body load. I love euphoria from pyschs and feel like everyone’s description makes it sound fucking great", "replies": {}}}}}}}}, "fisg4f5": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisg4f5/", "is_submitter": false, "created": 1582713002.0, "body": "Interesting to see a 10/10 on baclofen. I got a pretty solid amount recently; I've been interested in it because of my love for phenibut. I've only tried it a few times, and it seems to feel quite nice. How much do you usually take at a time?\n\nHave you tried plain kratom powder? I used capsules at first, but I soon realized it was cheaper and easier to just use powder. I've even come to like the taste.", "replies": {"fit0ap2": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fit0ap2/", "is_submitter": true, "created": 1582727985.0, "body": "I don't measure out my doses consistently but I take less then 10mg to sleep on a sober night and maybe 20mg or so for comedowns. I really use it as like a sleep supplement and not a sleep medicine if that makes sense, like a sprinkle of it to help me sleep.\n\nIf you like phenibut look into f-phenibut, it's like a mix between phenibut and baclofen.\n\nI have kratom powder, I make my own capsules. I have tried consuming the powder before and done so quite a bit in the past but for me personally I like the capsules better.", "replies": {"fit1yv5": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fit1yv5/", "is_submitter": false, "created": 1582729875.0, "body": "Cool, yeah I've been testing 12.5 mg baclofen at a time, as I got 25 mg tablets. So I've done F-phenibut before, but I wasn't a big fan of it. It felt too stimulating and made me anxious. Maybe I'd like it if I tried it again; it's been years now.", "replies": {}}}}}}, "fir819f": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fir819f/", "is_submitter": false, "created": 1582688007.0, "body": "Why go out of 10 when your lowest rating is a 6?", "replies": {"fira7os": {"score": 3, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fira7os/", "is_submitter": false, "created": 1582689251.0, "body": "Not too many drugs are *bad*.\n\n\nI an name a few that'd get a 0/1, depending on what the lowest rating is, but that's only a handful out of my 76", "replies": {}}, "firg9xw": {"score": 3, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firg9xw/", "is_submitter": true, "created": 1582692626.0, "body": "I haven't tried too many I actually HATED, some are not my personal style/I won't probably consume them again but it doesn't mean I did not enjoy my time with them or regret it.\n\nHell even with bad experiences such as LSA (HWBR Seeds) I would try it again, my experience with it was a 10/10 for 2-3 hours and then 8 hours of absolute nausea and stomach cramps. I'd still rate it a 6/10 cause of the absolute blast of fun I had before it turned sour.", "replies": {}}}}, "fira38b": {"score": 2, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fira38b/", "is_submitter": false, "created": 1582689182.0, "body": "Oddly enough I agree with these ratings.\n\n\nI wasn't expecting to, but I do recognize your username too\n\n\n25e-nboh squad represent. Sitting on 5g lolol", "replies": {"firfof2": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firfof2/", "is_submitter": true, "created": 1582692302.0, "body": "Real recognize real, I've seen you around a lot as well.\n\n I am sitting on a stupid amount of 25E-NBOH as well :) truly one of my favorite research chemicals.", "replies": {}}, "firvc7i": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firvc7i/", "is_submitter": false, "created": 1582700700.0, "body": "Wow, that will last you a lifetime, will it not?  I just got my first g.  How do you use it from powder, do you make a solution or do you make blotters?  You must take sublingual, correct?", "replies": {"fis3kft": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fis3kft/", "is_submitter": false, "created": 1582705793.0, "body": "I don't try to lay blotter, rather drip out doses", "replies": {"fispzq9": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fispzq9/", "is_submitter": false, "created": 1582719068.0, "body": "What do you make the solution of (eg, what liquid and what strength), and how long does it usually last?  You just hold the liquid under your tongue?", "replies": {"fitg66a": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fitg66a/", "is_submitter": false, "created": 1582747730.0, "body": "I still put it on paper and let it dry. The strength of your solution depends on how many drops you ultimately want to put. 10mg/ml isn't bad though", "replies": {}}}}}}}}}}, "fircmy8": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fircmy8/", "is_submitter": false, "created": 1582690630.0, "body": "Nice review man...opened my eyes to some newbies that I’d like to try...also would love if you threw your “imo” details of the effects...some of them i dont know what “class” they’d be in...", "replies": {"firgozz": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firgozz/", "is_submitter": true, "created": 1582692854.0, "body": "You are right, some of these are probably more unrecognizable then others. \n\n1P-LSD through DPT are all psychedelics. \n\nJWH-018 and 5F-ADB are synthetic cannabinoids.\n\n3-HO-PCP through DXM are dissociatives.\n\nClonazolam through GBL are GABA agonists.\n\n2-Methyl-AP-237 is a opioid.\n\nN-Ethylhexedrone through 3-FPM are stimulants.\n\n6-APB is an empathogen.", "replies": {}}}}, "fis032j": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fis032j/", "is_submitter": false, "created": 1582703525.0, "body": "Which would you think is easier on the mind/body for a night out: NEP or a-PHP?  Easier comedown and less compulsive redosing.", "replies": {"fis0dwy": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fis0dwy/", "is_submitter": true, "created": 1582703721.0, "body": "I think a single dose of A-PHP either orally or intranasally can last an entire night out so I'd probably choose A-PHP but it's much rarer then NEP. The come down from both aren't horrible.", "replies": {"fisrcu1": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisrcu1/", "is_submitter": false, "created": 1582720048.0, "body": "all i can think about when i heard a-php is john mcafee rants on twitter and face eating florida man lol", "replies": {}}}}}}, "fis30uh": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fis30uh/", "is_submitter": false, "created": 1582705445.0, "body": "MDMA  alternatives?", "replies": {"fisretw": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisretw/", "is_submitter": false, "created": 1582720090.0, "body": "6apb, but i've only done mdma  a couple times years ago.  but to me, it felt very similar.", "replies": {}}}}, "fisr5tx": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fisr5tx/", "is_submitter": false, "created": 1582719905.0, "body": "6-apb is prob my fav RC so far. would love to research more in the future!", "replies": {}}, "fit579z": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fit579z/", "is_submitter": false, "created": 1582733764.0, "body": "Thank you for your research", "replies": {}}, "fj4uxn2": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fj4uxn2/", "is_submitter": false, "created": 1583046285.0, "body": "Did you feel that the 2MAP was toxic or did you read that somewhere? I'm testing it currently and have been for the past two nights with no side effects or issues.", "replies": {"fj4vn0f": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fj4vn0f/", "is_submitter": true, "created": 1583046768.0, "body": "I felt it was toxic to my intestines/kidneys/liver. Very obviously darkened urine. It is caustic as well.\n\nThere has been quite a good bit of proof of its toxicity at this point other than my own experiences. Infrequent use of it (3x a month) is my advice.", "replies": {"fj4vw97": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fj4vw97/", "is_submitter": false, "created": 1583046945.0, "body": "Damn I thought I did my due diligence and I did see something about it affecting the kidneys but didn't think much of that report.", "replies": {"fj4wx46": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fj4wx46/", "is_submitter": true, "created": 1583047660.0, "body": "As long as one doesn't seek to abuse this chemical frequently or with high dosages it 'appears' to be safe for infrequent use, I personally wouldn't use it more then 3x a month like I said.", "replies": {"fj4x6vu": {"score": 1, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/fj4x6vu/", "is_submitter": false, "created": 1583047849.0, "body": "Oh ok thanks for the feedback dude", "replies": {}}}}}}}}}}, "firh525": {"score": 0, "link": "/r/researchchemicals/comments/f9f7hs/my_research_chemical_and_drug_review_compilation/firh525/", "is_submitter": false, "created": 1582693097.0, "body": "Yea see I’m good on the stims cause I get 90 adderall script. And I get 60 bars so don’t need the gama. I don’t do opiates Anymore and I’m just still learning Ket good. I think I’ve only done 4-fdck sold as ket and etiz which didn’t impress me I guess cause I get bars. I’ve done dmt, nn dmt, but no 5-Meo-dmt yet...but I’m still interested in something new...the 2c-e you mentioned has my attention but i dont know if I should try c,d,e or i next...oh and I’ll pass on all the syn cabs...lol", "replies": {}}}}, "f0lh9v": {"text": "So I came across an interesting tidbit of information while reading about the metabolism of Glutethimide (Doriden) and apparently it has an active metabolite that's said to be equipotent to the parent drug called 4-Hydroxyglutethimide and I was thinking this would definitely be a viable RC as Glutethimide is considered a holy grail of the GABAergic sedative family much like some of the other well known nonbarbiturate sedatives like Methaqualone, Methyprylon, Ethchlorvynol, and Ethinamate. And some more nonbarbiturate sedatives would be nice to have as the Methaqulone analogues were shown some love and we've seen a few of them and some were nice but expanding the class of nonbarbiturate sedative RCs would be lovely especially for those who prefer sedatives like these instead of benzos.\n\nI hope it retains the parent compound's ability to be a strong CYP2D6 enzyme inducer so people can re-live the \"Dors and 4s\" combo thus making Tramadol, Codeine, Hydrocodone, Dihydrocodeine, and Oxycodone much more viable or possibly cause people to OD if they do something ridiculous like take an 80 milligram or 120 milligram Oxycontin with it for example. Or taking a 60 milligram, 80 milligram, 100 milligram, or even a 120 milligram Hysingla ER with it or like taking a 50 milligram Zohydro ER with it.\n\nNevertheless i'd be pretty excited to see this come to the market.\n\n&#x200B;\n\n[http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.882.648&rep=rep1&type=pdf](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.882.648&rep=rep1&type=pdf)\n\n[https://imgur.com/KzTse](https://imgur.com/KzTseCV)CV", "author": "pretty_boy_flizzy", "score": 12, "flair": null, "created": 1581159215.0, "url": "https://www.reddit.com/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/", "num_comments": 42, "title": "4-Hydroxyglutethimide aka 4-HO-Glutethimide", "subreddit": "researchchemicals", "comments": {"fgye94t": {"score": 5, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgye94t/", "is_submitter": false, "created": 1581211228.0, "body": "Doriden has always been a drug I’ve wanted to try. It’s unique enzyme inducing effects are also supposedly so strong that they can make codeine turn into morphine so fast that it’s closer to heroin than codeine itself.. this plus the euphoria that comes with combining certain barb-like drugs with opioids (such as soma and hydrocodone) creates an intense euphoria. I’d love to try it.", "replies": {"fh06zhq": {"score": 2, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh06zhq/", "is_submitter": true, "created": 1581229793.0, "body": "Same, some Glutethimide analogues are long overdue. I believe 4-HO-Glutethimide was once considered to be made into an anticonvulsant although I can't find that source... I seriously need to bookmark my sources more often. -.-\n\n4-HO-Glutethimide was also said to be equal to or twice as strong as Glutethimide in the rodent brain according to this source.\n\n[http://www.inchem.org/documents/pims/pharm/pim246.htm#SectionTitle:4.2%20%20Therapeutic%20dosage](http://www.inchem.org/documents/pims/pharm/pim246.htm#SectionTitle:4.2%20%20Therapeutic%20dosage)\n\n&#x200B;\n\nAccording to this source these 2 other Glutethimide analogues known as 4-Amino-2-ethyl-2-phenylglutarimide and 4-hydroxy-2-ethyl-2-phenylglutaconimide were said to possess the greatest activity compared to the parent drug but alas i'm not sure if they have enzyme inducing properties or not.\n\n[https://www.researchgate.net/publication/22003639\\_Synthesis\\_of\\_an\\_active\\_hydroxylated\\_glutethimide\\_metabolite\\_and\\_some\\_related\\_analogs\\_with\\_sedative-hypnotic\\_and\\_anticonvulsant\\_properties](https://www.researchgate.net/publication/22003639_Synthesis_of_an_active_hydroxylated_glutethimide_metabolite_and_some_related_analogs_with_sedative-hypnotic_and_anticonvulsant_properties)\n\nThis is the chemical structure of 4-Amino-2-ethyl-2-phenylglutarimide\n\n[https://imgur.com/a/BLKs1uT](https://imgur.com/a/BLKs1uT)\n\nAnd this is the chemical structure of 4-hydroxy-2-ethyl-2-phenylglutaconimide\n\n[https://imgur.com/a/A9Kvyam](https://imgur.com/a/A9Kvyam)", "replies": {}}, "fh0d5la": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh0d5la/", "is_submitter": false, "created": 1581231399.0, "body": "What you're talking about is Dors and 4's which I think was a big drug trend in the early 80s. With that kind of downer/codeine potentiation, you'd probably have the same effect taking fioricet/codeine which is a combo drug still prescribed I think. I was prescribed hydroxyzine and fioricet and even that combination completely knocked me on my ass. 100 mg of butalbital and 50 mg of hydroxyzine, to me felt like 5 shots of tequila without the discomfort and and an extra sensation of calm ambiance thrown in.", "replies": {"fh0esor": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh0esor/", "is_submitter": true, "created": 1581231946.0, "body": "First generation antihistamines like Diphenhydramine and Hydroxyzine also potentiate opioids really well so you had 2 other drugs intensifying the Codeine.", "replies": {"fh0qaqy": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh0qaqy/", "is_submitter": false, "created": 1581235219.0, "body": "Potentiators are no joke. The strong effect can really hit you unexpectedly too. Somas are otc in a certain place not too far from me so I might try that out for potentiation next. Gotta tread lightly with mixing CNS depressants though, especially downers with opioids.\n\nEdit: I'm not sure how much different doriden (or doriden analogs) would be from soma or butalbital in potentiating codeine or hydrocodone but I can imagine it would be very similar", "replies": {"fh18xrq": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh18xrq/", "is_submitter": true, "created": 1581240937.0, "body": "Theres a combination called the Las Vegas Cocktail that consists of 100 milligrams of Hydrocodone, 1050 milligrams of Carisoprodol (Soma), and 2 milligrams of Alprazolam (Xanax) that was heavily abused when all those drugs were alot easier to get in the USA. Another variation of that combination involved switching out the Hydrocodone for Oxycodone.", "replies": {"fh1qne0": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh1qne0/", "is_submitter": false, "created": 1581250182.0, "body": "I've heard of it but I wouldn't say that dosage is anywhere near neccessary. I'm sure it would be fatal for people who don't have a massive tolerance.", "replies": {"fh1ysfv": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh1ysfv/", "is_submitter": true, "created": 1581257319.0, "body": "I did it with little tolerance to all those drugs and it got me as messed up as good Heroin. \n\nOf course I've always needed to take 100 milligrams of Hydrocodone if I wanted to get high with no opioid tolerance. That combo and combining Hydrocodone with Glutethimide (Doriden) is the only way I can enjoy that lame ass overrated opioid anyways. 😒\n\nAlso another good first generation antihistamine that potentiates Hydrocodone really well is Chlorpheniramine so I'm told.\n\nI've also heard Hydroxyzine is really good with the synthetic opioids particularly Meperidine/Pethidine and it's analogues/derivatives.\n\nCyclizine is said to be really good with Methadone and it's derivatives as well.", "replies": {}}}}}}}}}}, "fh9phs4": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh9phs4/", "is_submitter": false, "created": 1581415465.0, "body": "I don’t think fioricet with codeine amounts to dors and Fors much at all. The doriden induced codeine metabolism to a large degree which is what made it very euphoric along w the fact that barbs and opiates have a lovely synergy. Ime butalbital isn’t the best to mix with opiates, carisoprodol is much better. If you mix hydrocodone with  carisoprodol on an Emory stomach you may get something similar to dors and fours but even then it may not be as good. Certainly not fioricet w codeine though.", "replies": {"fh9uexa": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh9uexa/", "is_submitter": false, "created": 1581418645.0, "body": "Now I'm intrigued. I was only under the impression that glutethimide wasn't as good as reported to be because of how obscure it is. Most of the old school non-benzo downers are near impossible to find but information about them isn't that obscure.", "replies": {"fh9us6h": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fh9us6h/", "is_submitter": false, "created": 1581418890.0, "body": "From what I’ve heard from the many old timers I’ve spoken to dors and fours were one of the most euphoric highs of the 80s, it was called suburban heroin (at the time heroin was confined to inner cities not suburbs like today). This heroin-like rush makes sense since both codeine and heroin do turn into\nMorphine; but the doriden induces the CYP2D6 enzyme which makes much more codeine a much more potent prodrug. It had a huge heroin-like rush that was potentiated by the glutethimide which added the barbiturate effects. Great synergy. One of the ones I wish to try in my lifetime.", "replies": {}}}}}}}}}}, "fguwazi": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fguwazi/", "is_submitter": false, "created": 1581159662.0, "body": ">Glutethimide is considered a holy grail of the GABAergic sedative family\n\nBy whom? You realize that it hasn't been around for decades?\n\n50 year old experience reports are often...not too great. It's not like people back then had that many drugs to compare it to (benzos, ghb etc).", "replies": {"fguwyb7": {"score": 5, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fguwyb7/", "is_submitter": true, "created": 1581160095.0, "body": "Alot of people that know about it consider it up there with Methaqualone and Ethchlorvynol. \n\nGlutethimide was also widely known for it's \"Dors n 4s\" combo where 1000 milligrams of Glutethimide was taken with Codeine specifically Tylenol 4s and was said to produce a strong Heroin like high.\n\nAlso it's still available in Bulgaria as a prescription drug called Glutethimid produced by Balkanpharma.", "replies": {"fgux6y1": {"score": -3, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgux6y1/", "is_submitter": false, "created": 1581160255.0, "body": ">Alot of people that know about it\n\nGlad for those 3 dudes, but I'd want some 1) recent and 2) numerous reviews before being convinced that it's actually good.", "replies": {"fgv08wx": {"score": 4, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgv08wx/", "is_submitter": true, "created": 1581162361.0, "body": "I found a few people that have tried them on this Bluelight thread but they aren't the most detailed trip reports.\n\n[https://www.bluelight.org/xf/threads/glutethimide-any-experiences.638898/](https://www.bluelight.org/xf/threads/glutethimide-any-experiences.638898/) \n\nI made this post just to talk about new potential nonbarbiturate sedative RCs, especially because most of the current nonbarbiturate sedative RCs are Methaqualone analogues and a change would be nice. If you're skeptical of this drug then you can be, I just think this one has potential is all.", "replies": {"fgv2tf8": {"score": -1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgv2tf8/", "is_submitter": false, "created": 1581164339.0, "body": "Those opioid + glutethimide reports are kinda worthless unless you have a death wish. You'd have to compare that to opioids + benzos (also death wish) or opioids + GHB (again, you're kinda dead) for a fair comparison anyway...\n\nSo, first off, you'd have to take that substance in isolation, without anything else in your system, and preferably without a large tolerance to that group of substances so your dosage isn't entirely useless for anyone interested in the substance.", "replies": {"fgz7383": {"score": 2, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgz7383/", "is_submitter": true, "created": 1581220226.0, "body": "While I agree it's indeed a dangerous combination it would most likely be alot more euphoric than combining benzos with opioids because barbiturates and nonbarbiturate sedatives like Carisoprodol (Soma) are alot more physically euphoric than benzos. Read Dr Quaabarbital's comment because he gets it.\n\nPlus on it's own it could be fun due to that physical euphoria unique to these GABAergic sedatives as well as an effective sedative/hypnotic.", "replies": {"fgz8yub": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgz8yub/", "is_submitter": false, "created": 1581220727.0, "body": ">Read Dr Qauubarbital's comment because he gets it.\n\nWith that username, it sounds about as useful as reading retarded DPH lovers comments in /r/DPH :P\n\nN=1 not too useful either way.\n\nDoesn't take a genius to realize that just about everything is more euphoric than benzos, for people without mental illnesses (including anxiety) at least.", "replies": {"fgzun6q": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgzun6q/", "is_submitter": true, "created": 1581226593.0, "body": "Yeah I only find Clonazolam to be a fun benzo, the rest just keep me calm and functional. While stuff like 2M2B, Carisoprodol, and Chloral Hydrate do the same thing but they're physically euphoric at the same time.\n\nI wonder if you don't like this potential RC because of your dislike for Clomethiazole. :P", "replies": {}}}}}}}}}}, "fipij2i": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fipij2i/", "is_submitter": false, "created": 1582636795.0, "body": "I did Dors and 4's many times and they were incredibly euphoric but Doriden is no longer available.  By themselves they were lackluster but the combo was indeed \"Suburban Heroin\"", "replies": {"fipje7w": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fipje7w/", "is_submitter": false, "created": 1582637565.0, "body": "How old are you, 50+?", "replies": {"fj8xt6l": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fj8xt6l/", "is_submitter": false, "created": 1583154077.0, "body": "yes 60 this month. Have to mention that Dors and 4's were fairly lethal.  My first OD was Dors and 4's plus benzo's. Plenty of deaths back then although nothing like the Fentanyl action that we see today...The problem seemed to be that once you had even a slight Dor/4 habit that the amount that you needed for a great buzz and the lethal amount seemed to constrict to a smaller zone. Just a thought that I had a the time and I was pretty strung at the time so take it for what its worth........Felt heavier than Ludes, Different than Tuinal.....closest to strong heroin or perhaps Demorol in feel although its seems that Demorol has disappeared as well", "replies": {}}}}}}}}}}, "fgwudk1": {"score": 4, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgwudk1/", "is_submitter": false, "created": 1581194705.0, "body": "Everyone who like ludes", "replies": {"fgxyevb": {"score": -1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgxyevb/", "is_submitter": false, "created": 1581206558.0, "body": "Also happy for those 3 other dudes. The RC analogues all kinda sucked apparently.", "replies": {}}}}}}, "fgxobc3": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgxobc3/", "is_submitter": false, "created": 1581203750.0, "body": "Yeaaa, i was always interested in old sedatives. Id love to see an analogue of this be sold as an rc. But Id also buy ethchlorvyol distraneurin or secobarb derivatives....", "replies": {"fgy79ly": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fgy79ly/", "is_submitter": true, "created": 1581209026.0, "body": "Clomethiazole is already sold as an RC and I've tried it and still have some left. It's sedative effects were ok but it had this nasty histamine release that made your eyes water and your sinuses burn.\n\nAs for Ethchlorvynol the only analogue or relative I can think of that could be sold would be Methylpentynol.\n\nAs for a Seconal analogue I don't think we'll get to see many barbiturate analogues because most countries prohibit any 5,5-disubstituted derivative of barbituric acid so that's why there's never been any barbiturate based research chemicals.", "replies": {}}}}, "fj8y9tl": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fj8y9tl/", "is_submitter": false, "created": 1583154477.0, "body": "just to add to the discussion a bit.    Seconal was generally received as fabulous...Tuinal as well being a little stronger given the additional Amytal.   Placidyl or Ethchlorvynol however....they were ok although when you are talking euphoria. Quaaludes/Sopor/Seconal/Tuinal and even Dors & 4's .....Placidyl simply just didn't have the same euphoria. I had stacks of scripts I never even bothered to fill.   Potency however- it would kick your ass but that was part of the problem. It just put you out. Ludes and Sopors were King", "replies": {"fj9fgti": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fj9fgti/", "is_submitter": true, "created": 1583174933.0, "body": "I've heard some people found Placidyl to be fun and euphoric while I've also heard it would also knock you the fuck out as well. I'd likely still try it out just for kicks, same with the lesser known Ethinamate.", "replies": {}}}}, "fjfzpsc": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjfzpsc/", "is_submitter": false, "created": 1583334293.0, "body": "During the time that Dor's & 4's were popular I did a lot of experimenting with other drugs to try to create that fabulous synergism and I have to tell you that I came up empty.\nBeing a vendor and heavy rec user at the time I had pretty much everything at my disposal and it was kind of frustrating because what you had was two sort of mildly appetizing to weak drugs( Doriden/Codeine) however when u combined them together it was like a euphoric explosion- and yet when I substituted Oxycodone or Hydrocodone for the Codeine it didn't work... I substituted Tuinal for the Doriden for sure....can't remember if I substituted Ludes for the Dor's due to the timing....no Ludes in my area after 1984.   I just remember that nothing worked.  You had to take Doriden and Codeine- the stronger drugs mixed together didn't synergize as well", "replies": {"fjifdqu": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjifdqu/", "is_submitter": true, "created": 1583395220.0, "body": "I find that hard to believe because Hydrocodone and Oxycodone are metabolized by the same enzyme that metabolises Codeine into Morphine.\n\nIt'll be hard to study that combination as well unless you travel to Bulgaria where Glutethimide is still a prescription drug or hope that this active metabolite of Glutethimide becomes a research chemical and retains the parent drug's CYP2D6 enzyme inducing properties. \n\nOn another note I bet both Glutethimide and 4-HO-Glutethimide would go well with French Tussipax tablets because they contain 10 milligrams of Codeine and 10 milligrams of Ethylmorphine which are both metabolized into Morphine by the CYP2D6 enzyme.", "replies": {"fjlbm79": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjlbm79/", "is_submitter": false, "created": 1583472494.0, "body": "Yes, I remember it to be  frustrating at the time. I would mix stronger drugs but not get the same effect.\nThat is why Dors and 4's were a thing. They had a specific synergism that hit like a brick and other combo's simply didn't measure up.\n\nI get excited every time I see the work Tussipax because it reminds me of Tussionex ......\n Tussipax would be great with any form Glutethimide I would think.\nHave you done any Tussionex?\nAlso there has to be vendors from Bulgaria on the darkweb. If Doriden is still available there then I am wondering why it isn't  popping up. I heard of a couple clandestine labs that were producing Doriden of course I only heard of them after they were shut down.\nBrings back good memories of when there were Methaqualone labs all over the U.S. in the late 70's.   Pharma actually became kind of rare by the end of the decade in a relative sense because there were do-it-yourself labs everywhere. I know there were many in my city and it was just medium-sized midwest. Of course the Colombians were going full bore at that time.\nI will be interested to hear if anyone can come up with some Doriden.", "replies": {"fjltn7p": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjltn7p/", "is_submitter": true, "created": 1583482985.0, "body": "No I haven't done Tussionex because I find Hydrocodone to be an incredibly overrated and lame opioid and despite the synergy from the Chlorpheniramine I highly doubt it would be worth my while because it takes 100+ milligrams of Hydrocodone to actually get me high even with no opioid tolerance. I'd likely only enjoy Hydrocodone with Glutethimide. I believe Doriden was discontinued in the USA back in 1993 and that was a couple years before Oxycontin and Hydrocodone became commonly prescribed in 1995 which must be why we don't hear much about Glutethimide being used alongside Hydrocodone and Oxycodone. Alot of people on Bluelight suspect bad things would happen to people if both were simultaneously available.\n\nAs for why there are no Bulgarian DNM vendors selling Glutethimide, It's probably not commonly prescribed in Bulgaria much like how Dipipanone (Diconal, Wellconnal) is infrequently prescribed in the UK and South Africa. I've heard Amobarbital is still a prescription drug that's prescribed in Bulgaria still as well.", "replies": {"fjpqeqh": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjpqeqh/", "is_submitter": false, "created": 1583586978.0, "body": "Hey, one misconception needs cleared up and probably a  lot of people fall into this trap since Oxycontin became such a huge thing post 1998.\nThere was tons of Oxycodone and Hydrocodone available during the 70's and 80's in the U.S.     It was freely available and very commonly abused. You just don't hear about it because fatality rates were low.   Personally I was getting both of them from multiple doctors every week and their waiting rooms were packed. The U.S. was flooded with hydro and oxycodone not contin in the 80's\nBtw, it was also very available in quantity on the street. I was 15 years old and someone sold me 500 Percodans.. I tried them and really didn't like them because they felt nothing like Quaaludes.\nI think you would be surpised by Tussionex\nIt wasn't until 9 years later that I discovered their allure", "replies": {"fjr1jkx": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjr1jkx/", "is_submitter": true, "created": 1583609135.0, "body": "I knew Percodan was around back then and I thought the most commonly used opioid at that time was Meperidine/Pethidine. I highly doubt I'd be surprised by Tussionex because like I said it takes 100+ milligrams of Hydrocodone to actually get high and drinking that much Tussionex would likely have me in an anticholinergic delirium. Sadly I have a jacked up opioid tolerance courtesy of street Fentanyl... 😒😑 Even if my tolerance goes away I'll still never be able to enjoy Hydrocodone. Likely because Hydrocodone is derived from Thebaine more than Morphine and as a result is a more stimulating opioid.", "replies": {"fjumg1h": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjumg1h/", "is_submitter": false, "created": 1583646950.0, "body": "Yes, back then Percodan, Percocet, Tylox, Oxy with APAP, Vicodin, Hycodan and Anexia D were all heavily prescribed.\nMeperidine was also very heavily prescribed but since it was stronger it was prescribed less than most of the ones I listed above.\n\nI still think you would liked Tussionex. It was a different breed of hydro. Had to have had something to do with the mix.", "replies": {"fjw23fd": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjw23fd/", "is_submitter": true, "created": 1583662396.0, "body": "What makes you think I'd like Tussionex? I'm just curious since I have a massive tolerance and have a preference for sedating opioids and Codeine derivatives like Hydrocodone and Oxycodone haven't really done much for me because they aren't capable of making me nod.\n\nI do however recommend that people who take Hydrocodone and enjoy it take it with Chlorpheniramine. Currently I'm looking into some of the Benzimidazole based opioids like Isotonitazene and Etodesnitazene because they seem promising and more euphoric than Fentanyl and fentalogues", "replies": {"fkpj480": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fkpj480/", "is_submitter": false, "created": 1584440168.0, "body": "Every experienced opiate user that I ever met loved Tussionex. Some complained a little bit when they tweaked the formula in the 90's but I have to say that Tussionex was universally loved.", "replies": {}}, "fmpte2v": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fmpte2v/", "is_submitter": false, "created": 1586315791.0, "body": "I may have already responded but if not....I have never met an Opiate user who didn't love Tussionex. It is possible I guess just never heard anyone say that. Many fall in love.\nAs an aside, my pcp wrote me Hycodan yesterday which isn't that big of a deal however he doesn't ever write opiates so I was shocked.", "replies": {"fmqx6eh": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fmqx6eh/", "is_submitter": true, "created": 1586337800.0, "body": "I'd probably like the combination/synergy of the Hydrocodone and Chlorpheniramine but in my case I'd likely need 2 50 milligram Zohydro ER or 1 100 milligram Hysingla ER or better yet the 120 milligram one and an hour after taking Hydrocodone I'd just throw in the max daily dose of Chlorpheniramine (which is 32 milligrams) and see what happens. \n\nMost Hydrocodone users like taking small amounts to enjoy the slight buzz but I shoot for getting hella faded and like to be nodding and borderline incoherent. 😂 Btw they make pill forms of Tussionex called TussiCaps that contain both Hydrocodone and Chlorpheniramine however I have no clue how often they're prescribed. \n\nhttps://www.drugs.com/imprints.php?action=search&drugname=tussicaps\n\nAlso in Canada the Tussionex they have doesn't have Chlorpheniramine as the antihistamine in it and instead they use the antihistamine Phenyltoloxamine which is usually used alongside Tylenol, other NSAIDs, and other various weaker opioids like Codeine and Dihydrocodeine and is rarely available on it's own.\n\nYou're right about doctors not writing scripts like that anymore due to the increasing hate by the normies and government around opioids.", "replies": {}}}}}}}}}}}}}}}}, "fjlc7l0": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjlc7l0/", "is_submitter": false, "created": 1583472825.0, "body": "just reread your statement and yes I can guarantee you that oxycodone and hydrocodone did not work as well as Codeine with the Dors......not even close.\n\nBelieve me, we were all running doctors back and everyone had plenty of Perc and Hydros. If they would have worked Codeine would not have been the other half of a Set.\nFrom a scientific standpoint I can't tell you why they didn't work however from my own experience and the observation of others Oxy, Hydro...etc could not be substituted.\nI also tried substituting out the Doriden to no avail", "replies": {"fjluk11": {"score": 1, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjluk11/", "is_submitter": true, "created": 1583483589.0, "body": "Now that I think about it it's possible that Hydrocodone and Oxycodone could be too stimulating when used with Glutethimide but if they were being converted into Hydromorphone and Oxymorphone which are much more euphoric and sedating than their Codeine based counterparts then that wouldn't be an issue... I remember one time I combined 40 milligrams of Oxycodone with 1050 milligrams of Carisoprodol and the stimulating effects of the Oxycodone were able to override the sedating effects of the Carisoprodol and I had to snort 12.5 milligrams of Doxylamine to catch a nod. \n\nStill more research needs to be done on this combination to if the Codeine conversion into Morphine is perhaps the best way as I could see how that combination could be similar or better than Heroin.\n\nOn another note, since you said you tried using Methaqualone alongside opioids and it wasn't as good as using Glutethimide, I still imagine that combo to be a fun one, hell if I get the chance I want to combine Dipipanone (Diconal, Wellconnal) with Methaqualone if I ever visit South Africa. I bet that combination would be amazing.", "replies": {"fjpw2kb": {"score": 2, "link": "/r/researchchemicals/comments/f0lh9v/4hydroxyglutethimide_aka_4hoglutethimide/fjpw2kb/", "is_submitter": false, "created": 1583590820.0, "body": "I am sure the Methaqualone/opiate combo will be good. I mixed them many many times( mostly oxy and Dilaudid) but I really don't remember...that was mainly1978-81..prior to 78 I  only used opiates sporadically since I didn't like them at first", "replies": {}}}}}}}}}}}}, "isqde2": {"text": "Which research chemicals are closest in relation to oxycodone or hydrocodone? \nI know there is plenty fentanyl analogs but are there any hydrocodone, oxycodone analogs?", "author": "PDPLondon", "score": 5, "flair": null, "created": 1600135647.0, "url": "https://www.reddit.com/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/", "num_comments": 20, "title": "Research chemicals close to Oxy?", "subreddit": "researchchemicals", "comments": {"g59ghvj": {"score": 5, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59ghvj/", "is_submitter": false, "created": 1600136482.0, "body": "I know its not popular but tianeptine is really similar in my experience but as Im sure you know that substance has a whole host of w/d problems and such so be very careful. I have a report about it you can find looking at my account :)", "replies": {"g59jwx3": {"score": 3, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59jwx3/", "is_submitter": true, "created": 1600137663.0, "body": "Lol but this is not an analog this is an antidepressant", "replies": {"g5a1vu5": {"score": 6, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5a1vu5/", "is_submitter": false, "created": 1600143525.0, "body": "[deleted]", "replies": {"g5ad4f9": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5ad4f9/", "is_submitter": true, "created": 1600147328.0, "body": "No way is it on clear web", "replies": {"g5b6tik": {"score": 3, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5b6tik/", "is_submitter": false, "created": 1600161472.0, "body": "Dude just go to nootropics depot and get 5 grams Its everywhere because its considered a \"nootropic\"", "replies": {}}, "g5agcwi": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5agcwi/", "is_submitter": false, "created": 1600148627.0, "body": "I would also want to know .... Is it on clear web.", "replies": {}}}}}}, "g59l1lb": {"score": 4, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59l1lb/", "is_submitter": false, "created": 1600138053.0, "body": "I know but it is a legal chemical that you can buy, I mean people consider etiz a rc when its a pharm so idk. Also there are no morphine or fentanyl analogs anymore on the clear web and tianeptine actually isnt an antidepressant there were studies that came out showing it had very little action on serotonin and most of its antidepressant qualities come through its modulation of the opioid receptors. Its very strong stuff at least for me.", "replies": {"g5ad6fa": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5ad6fa/", "is_submitter": true, "created": 1600147351.0, "body": "How safe would you say this is compared to regular oxy? Can this cause serotonin syndrome", "replies": {"g5agicd": {"score": 2, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5agicd/", "is_submitter": false, "created": 1600148682.0, "body": "No it can't your fine. (Joking but fr it's not that bad, I've stolen it from people and yeah it's hella good\nHence why I want to buy it on clear web hehe)", "replies": {}}, "g5b6qxm": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5b6qxm/", "is_submitter": false, "created": 1600161432.0, "body": "It is not as safe if used a lot. If you can control your use and wont develop a tolerance it should be just as safe also oral is the only ROA. Also if your not using any other serotonin agonist drugs there will be no risk of serotonin syndrome. Finally I've actually found that I can control my use with it much better then with oxy because it tastes so fucking bad and can be hard to consume", "replies": {}}}}}}}}}}, "g5euz8v": {"score": 4, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g5euz8v/", "is_submitter": false, "created": 1600238627.0, "body": "ODSMT or 2-M-AP-237 are your best bets bud 🖖", "replies": {}}, "g59rus7": {"score": 3, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59rus7/", "is_submitter": false, "created": 1600140272.0, "body": "Defenetely 2-Methyl-AP-237 or SP-238, almost same potency & Effects but only lasts fo maximum of 1,5-2 hours oral\n\n&#x200B;\n\nis also very caustic", "replies": {}}, "g59hnu0": {"score": 2, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59hnu0/", "is_submitter": false, "created": 1600136887.0, "body": "Just do kratom dude", "replies": {"g59jnfq": {"score": 2, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59jnfq/", "is_submitter": true, "created": 1600137574.0, "body": "It’s not a hydrocodone analog I’m not looking for a methadone supplement", "replies": {}}, "g59jpa4": {"score": 2, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59jpa4/", "is_submitter": true, "created": 1600137591.0, "body": "I’m looking for a hydrocodone analog or sum thing of the sort", "replies": {"g59klmy": {"score": 9, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59klmy/", "is_submitter": false, "created": 1600137900.0, "body": "You won't find anything like that. The feds have been all over rc opioids due to the opioid epidemic, I'm sure the situation is similar in the UK as well. Kratom extract can be as good as 10-15mg of hydrocodone, it's not bad stuff. The only other thing I can think of that isn't a toxic derivative of cancer medication is O-desmethyltramadol, if you can find it. Good luck and please be more polite in the future.", "replies": {"g59kuel": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59kuel/", "is_submitter": true, "created": 1600137985.0, "body": "Sorry I just thought you were sarcastically telling me to eat Kratom to get off opiates", "replies": {"g59lh16": {"score": 4, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59lh16/", "is_submitter": false, "created": 1600138197.0, "body": "Ah, that makes more sense. I'm no moralist and would do no such thing. The reality of being dependent on opiates is harsh enough, no further criticism is warranted. I'm in kratom withdrawal myself rn. Feels like my body is made of concrete with bad rls, not too pleasant, but since I'm tapering it really isn't bad at all compared to harder stuff.\n\nKratom + phenibut or gabapentin is probably the best thing you're gonna be able to get.", "replies": {}}}}}}}}, "g59jlrs": {"score": -3, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59jlrs/", "is_submitter": false, "created": 1600137558.0, "body": "[deleted]", "replies": {"g59qpzm": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59qpzm/", "is_submitter": false, "created": 1600139957.0, "body": "Legal, easy to get, feels similar, etc.", "replies": {}}}}}}, "g59qo5p": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g59qo5p/", "is_submitter": false, "created": 1600139937.0, "body": "Closest you'll get is O-DSMT or kratom but still not like oxys", "replies": {}}, "g60alxe": {"score": 1, "link": "/r/researchchemicals/comments/isqde2/research_chemicals_close_to_oxy/g60alxe/", "is_submitter": false, "created": 1600654181.0, "body": "237", "replies": {}}}}, "fqn4de": {"text": "So I've been looking into buying a few different RCs. I've been reading a lot of reports but would like to see if anyone can give some more advice. I was thinking about getting 3-ho-pcp(somewhat new dissos) and 4-aco-det(fairly well versed in psychedelics). Also was looking for something that might give somewhat of the same body warmth and euphoria you get from like hydrocodone.", "author": "AnubisUndead", "score": 5, "flair": null, "created": 1585440949.0, "url": "https://www.reddit.com/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/", "num_comments": 22, "title": "Advice on some RCs", "subreddit": "researchchemicals", "comments": {"flr7b3h": {"score": 2, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flr7b3h/", "is_submitter": false, "created": 1585443252.0, "body": "What advice are you looking for?", "replies": {"flr7rcj": {"score": 2, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flr7rcj/", "is_submitter": true, "created": 1585443511.0, "body": "Just what to expect really.. I'm really interested in the 3 ho.. But in the back of my head I know how people used to freak out on wet. Also any experiences on the det?", "replies": {"flr83rq": {"score": 3, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flr83rq/", "is_submitter": false, "created": 1585443710.0, "body": "Ah well I'm not experienced in any of those, I've read that 3-ho-pcp is a more psychedelic and opiate-like disso, and that 4-HO-DET is a really shroomy bright and laughy yet deep psychedelic.\n\nAs for opiates, i think the only RC one that's worth it is o-dsmt", "replies": {"flr8jw4": {"score": 2, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flr8jw4/", "is_submitter": true, "created": 1585443968.0, "body": "Yea I've read that about 3 ho.. And that the mania isn t super bad either.. That's really what interested me.. I'm not trying to be eating people's faces like that guy in Florida lol. 4-aco-dmt is basically like shrooms too right?", "replies": {"flr8zv8": {"score": 2, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flr8zv8/", "is_submitter": false, "created": 1585444225.0, "body": "All the tryptamines I've tried have had a distinctive tryptaminey feel that I'd describe as shroomy, tho they're all quite different. 4-HO-MIPT imo was incredibly different from any other psychedelic I've tried. 4-aco-dmt is converted in your body to psilocin so its identical to shrooms.\n\nAlso, haha, I'm curious about 3-meo-pcp bc of the stimmy mania, i really disliked all the dissociatives I've tried but they were all the sedating and being bored kind, maybe I'll like 3 meo lol", "replies": {"flraaa4": {"score": 1, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flraaa4/", "is_submitter": true, "created": 1585444969.0, "body": "Yea that's what I thought about the 4 aco.. I used to grow shrooms though and it takes an insane amount for me to get visuals. Hell I got some LSD-25 190 mcgs each and had to take two to trip. Albeit, best trip of my life. I was watching Rick and morty and everything was just flowing so well. About the 3 meo, that's actually what turned me off haha. I was reading people tend to go a little more \"crazy\" on that one..", "replies": {"flrb9tr": {"score": 2, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flrb9tr/", "is_submitter": false, "created": 1585445537.0, "body": "Well if you want the visuals, 4-HO-MET is reeeeeeeally good, its like a mix of shroomy visuals and acid colours and normal d9ses have a really small headspace, so a high dose would be moderately psychedelic and mind fucky and really really visual.", "replies": {}}}}, "flrai36": {"score": 1, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flrai36/", "is_submitter": true, "created": 1585445094.0, "body": "I made the mistake of taking 4 100 mcg tabs of 1cP given my high tolerance for visuals.. Ooof horrible decision lol. You never realise how long life is until you're counting every breath 🤣", "replies": {}}}}}}}}}}, "flr7slu": {"score": 2, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flr7slu/", "is_submitter": false, "created": 1585443530.0, "body": "The last sentence. He's looking for an opiate similar to hydrocodone", "replies": {"flr7xnk": {"score": 1, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flr7xnk/", "is_submitter": true, "created": 1585443611.0, "body": "I was reading oDSMT can be somewhat similar", "replies": {"flrvoyf": {"score": 1, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flrvoyf/", "is_submitter": false, "created": 1585457649.0, "body": "I think this is heavily dependant on the person.  If you know you don't really respond to tramadol then I wouldn't waste your money.  I found that kratom was just as euphoric and sedating as heavy doses of odsmt, I definitely can't say the same thing about hydrocodone.", "replies": {"flrwj4r": {"score": 0, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flrwj4r/", "is_submitter": true, "created": 1585458155.0, "body": "Yea tramadol and even kratom do like nothing for me. That's really what I'm worried about", "replies": {"flrxiog": {"score": 1, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flrxiog/", "is_submitter": false, "created": 1585458756.0, "body": "I wouldn't waste your money on more then a trial dose.  I managed to catch a light nod once from eating lots of kratom, have not managed to achieve the same with this and I even combined strong doses with benzos (yeah I know, I'm stupid) and went far above the guidelines \"heavy\" dose with no tolerance.  Never felt like I was getting close to nodding.", "replies": {"fls0doe": {"score": 0, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/fls0doe/", "is_submitter": true, "created": 1585460484.0, "body": "Exactly man! Like my smoke shop used to sell it here, not sure if they still do, but any kind I got I never got any buzz.. Never knew what people saw in it haha. I think 3 ho pcp might be my best bet for now.. See how that goes", "replies": {"fls0x3f": {"score": 1, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/fls0x3f/", "is_submitter": false, "created": 1585460810.0, "body": "With 0 tolerance I can get *something* going with really good kratom, this chem just has like no sedation.  I actually have some 3-ho-pce as well right now, not the same but I believe it's close and may also posses some opioid properties.  I only tried it once so far but I felt like I noticed that familiar warmness inside.  I'll have to try it again soon.", "replies": {}}}}}}}}}}}}}}}}, "flrfzg4": {"score": 2, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flrfzg4/", "is_submitter": false, "created": 1585448220.0, "body": "3-ho-pcp in low doses is amazing, and is very unlikely to have any of the mania effects you’re associating with people flipping out on wet. It has a warmth to it, and it’s fairly relaxing and great for self analysis. I usually start with 4 mg, maybe take another or 2 later, it’s chill. I haven’t gone much higher with the dosage bc I don’t feel the need to", "replies": {"flrgbsz": {"score": 1, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flrgbsz/", "is_submitter": true, "created": 1585448418.0, "body": "Thanks for the reply! In really leaning towards the 3 ho.. Only disso experience I've had though is with dxm and while i did enjoy it in a sense, the amount needed for the level I was at was just too much for my stomach. I'll probably be getting that here soon. 250 mgs should last quite a while right? Not planning to do it every day, only day I have off is monday.", "replies": {"flrhuk6": {"score": 1, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flrhuk6/", "is_submitter": false, "created": 1585449311.0, "body": "250 is a good amount to start with, you can always get more if you like it. However, if you’re ordering international, spending the extra $ to get a full gram may be worth not having to deal with it twice. I’m sure you already know this, but make sure you have a milligram scale (.001) to dose accurately. How are you planning to dose it out?", "replies": {"flri6nf": {"score": 1, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flri6nf/", "is_submitter": true, "created": 1585449511.0, "body": "Yea I think I'll be having to get it from an EU vendor.. I don't know of any US ones except to get 1cP and clam. I have a scale that goes to the hundredths not the thousandth.. I was planning on weighing out a .01 then eyeballing and splitting that", "replies": {"flrim03": {"score": 1, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flrim03/", "is_submitter": false, "created": 1585449764.0, "body": "You need to get a $20 Gemini scale to be messing with things active in the single digit mg range man. It’s $20. Don’t take unnecessary risks", "replies": {"fls0gqn": {"score": 1, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/fls0gqn/", "is_submitter": true, "created": 1585460535.0, "body": "I'll definitely get one, I thought they were more expensive tbh. Haven't looked at an mg scale in a while though", "replies": {"flwo9dg": {"score": 2, "link": "/r/researchchemicals/comments/fqn4de/advice_on_some_rcs/flwo9dg/", "is_submitter": false, "created": 1585587209.0, "body": "Yeah _**DO NOT**_ fuck with pcp analogues without a mg scale. The difference in effects between 5mg and 10mg can be huge.\n\nIn fact what you should do is use a mg scale to very accurately weigh out 100mg, then dissolve that in 100ml of ethanol or propylene glycol, so every ml = 1mg. Otherwise it's gonna be really hard to dose accurately at all.", "replies": {}}}}}}}}}}}}}}}}, "hz2480": {"text": "I think there's an unmentioned but significant population of people frequenting this and other drug related subs who are prescribed some kind of medication (antidepressant or not), and I think mentioning interactions with these meds in experience reports should be encouraged in the interest of accuracy.\n\nMost would suggest avoiding unknown research chemicals while taking other prescription drugs and for good reasons (MOAIs in particular),  but some end up trying them regardless.\n\nMy general impression and own personal experience suggests most antidepressants will diminish many effects of RCs, but some could interact dangerously, e.g. serotonin syndrome. Personally I've only experienced the former and not the latter, but I still understand the risk involved and choose to tread carefully with serotonergic RCs.\n\n---\n\nHere's my anecdotal experience with my prescription combo and perceived interactions.\n\nDaily: \n\n- Escitalopram (SSRI): General Anxiety \n- Mirtazapine (Tetracyclic antidepressant): Depression, Anxiety, Insomnia, Appetite, Allergies\n\nGenerally what I've noticed is that RCs in the realm of entactogens have very little if any effects. From what I've tried these include 4-FA and 3-MMC. 4-FA has a subtle mood lift at 100mg but is generally underwhelming. 3-MMC was even less noticeable around 125mg, half insufflated half oral. Interesting since most consider this irresistibly fiendish. 4-FEA (comparatively benign) at moderate doses was much more noticeable in terms of mood lifting but made me drowsy. Because of these results I haven't bothered with the other 'entactogenic' chems I have like 4-FMA, 3-FMA, Eutylone, 6-APB.\n\nLooking at more recreational dopaminergic stims things become more noticeable but still not in line with a lot of anecdotal reports. a-PCYP is enjoyable but even binges of vaping 60mg+ I still feel mostly sober, nothing approaching 'instant psychosis' like some experience. Hexen in comparison is downright boring, I really don't understand the appeal of this. Small hint of a dopamine release with acute tachycardia. 3-FPM at any dose, oral, vaped, may as well be a placebo.\n\nI haven't touched psychedelics since they'll surely be diminished and I'd like to have a 'clean slate' before tripping.\n\nCompared to suffering with chronic anxiety pre-meds, benzos feel almost pointless. They have lost nearly all recreational value for me. Previously though, highly enjoyable. \n\n\n**Stuff that works as expected:** \n\nDCK (Just good fun every couple months)\n\nO-DSMT (Pleasant but can strangely make me quite irritable and increase BP to the point my ears are ringing. Seldom used, prefer hydrocodone slightly)\n\nMost 'classical' stimulants (substituted amphetamines, methylphenidate analogues), including 2-FA, 2-FMA, IPPH, 4F-MPH. Euphoria from 2-FA and 2-FMA is significant enough to be distracting and seems to make me suddenly drowsy after a couple hours. Methylphenidate types are preferable for functional purposes. These also override the appetite stimulating effects of Mirtazapine.\n\n---\n**Layman Interpretations:**\n\nI'm fairly certain Mirtazapine is having the largest impact, likely diminishing most effects in particular my capacity to get much out of recreational stimulants, I believe explained by its antiserotonergic, antihistamine, and α2-blocker effects. Mirtazapine has been researched for use in the treatment of drug addiction and dependence so as a layman I'd like to assume it has some responsibility for my general disinterest in recreational stimulants. After many months of long term 4f-mph and 2-fma (~5 days a week) use I don't experience much in terms of withdrawal on days off. \n\nEscitalopram's interactions are less clear to me besides affecting serotonin, but as a CYP2D6 inhibitor it might reduce some effects. Also it obliterated my sex drive and stims of any kind have no noticeable effect on that (sadly), O-DSMT and DCK are the only substances that seem to relieve that, but they're subtle. \n\n---\n\nWould be interested in how others have experienced interactions with prescription meds, or any links to studies/literature/anecdotes about these sorts of interactions.", "author": "theholydrug", "score": 26, "flair": null, "created": 1595916753.0, "url": "https://www.reddit.com/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/", "num_comments": 25, "title": "Let's talk about interactions with antidepressants and other prescription drugs", "subreddit": "researchchemicals", "comments": {"fzge0h9": {"score": 15, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzge0h9/", "is_submitter": false, "created": 1595919200.0, "body": "No surprise the entactogens don't work well with SSRIs. They both act on Serotonin.", "replies": {"fzjon1l": {"score": 2, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzjon1l/", "is_submitter": false, "created": 1595994942.0, "body": "^^^^^^", "replies": {}}}}, "fzgkvtm": {"score": 8, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzgkvtm/", "is_submitter": false, "created": 1595922885.0, "body": "I’m on lithium. Haven’t had the balls to chance anything but a single beer since starting it. Anyone have more info about lith+alc/anything else?", "replies": {"fzmkdxp": {"score": 1, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzmkdxp/", "is_submitter": false, "created": 1596063476.0, "body": "My friend bumped like 7-10 mg of 2ce on lithium and had a small seizure, blacked/tripped out for a few hours, started masturbating his flaccid penis furiously, amongst other things. Don't mix lithium with shit.", "replies": {}}}}, "fzgob4r": {"score": 5, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzgob4r/", "is_submitter": false, "created": 1595924795.0, "body": "Olanzapine ruins psychedelics and gets rid of disso afterglow, blocks empathogens (still not working, 1.5months since last olanzapine dose)", "replies": {"fzo85hu": {"score": 1, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzo85hu/", "is_submitter": false, "created": 1596093281.0, "body": "Fuck olanzapine man sorry you had to take this shit", "replies": {}}}}, "fzh8ac5": {"score": 5, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzh8ac5/", "is_submitter": false, "created": 1595936556.0, "body": "Be careful with taking anything that affects serotonin if you're on Wellbutrin/Bupropion. It isn't an SSRI or an MAOI but it does affect your serotonin levels. I'm 99% sure I gave myself mild serotonin syndrome after taking a massive dose of DXM while on it once (I know that's not an RC but I'm sure any dissociative would react similarly). I wasn't diagnosed but I felt like absolute shit for days after the trip and had several symptoms that lined up with SS. It went away after I skipped my meds for a couple days.", "replies": {}}, "fzhejgn": {"score": 5, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzhejgn/", "is_submitter": false, "created": 1595940809.0, "body": "So to find out if a drug your taking interacts with your meds I would do a couple things. \n\nProbably first check the [TripSit Combination Chart](https://u.pcloud.link/publink/show?code=XZiCEakZHle4Umno9i5dEXYDNR5L70vpAuKk). Then the [PsychonautWiki.org ](https://psychonautwiki.org) page about the drug and looks in the combination/interaction section. \n\nThen go to https://scholar.google.com and search for: \n\n“**drug name**” interactions “**medication name**” (don’t use brand names but chem names for better results. \n\nAnd see what pops up. PRO tip, use Sci-Hub to get the articles for free. \n\nFinally check books on the known ebook sites for books [like this. ](https://u.pcloud.link/publink/show?code=XZiCEakZHle4Umno9i5dEXYDNR5L70vpAuKk)\n\nPs the last one is just a table from a paper just about MDMA.", "replies": {}}, "fzghqfw": {"score": 3, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzghqfw/", "is_submitter": false, "created": 1595921186.0, "body": "I wish I had the gumption to do all the research into these RCs that you guys are seem to do, but I judt go with illegal drugs. Partly because I'm in the UK, where we can't get RCs, and partly because I just couldn't be bothered with the meticulous planning and exact measurements you guys seem to go through.", "replies": {"fzgjzvy": {"score": 7, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzgjzvy/", "is_submitter": true, "created": 1595922404.0, "body": "If you can't do RCs in the UK doesn't that make them illegal drugs? And unless the illegal drug is on a tab or pressed I'd still measure it. Going off darkweb markets RCs are far more accessible to the UK/Europe than in the US.\n\nWhere I am getting 'technically' illegal but still grey RCs is just as easy/difficult as getting plain illegal stuff, which for me would basically be shitty coke, meth, or heroin/fentanyl, and I'm too cheap to buy pharma pills ($10 per 30mg adderall is ridiculous).", "replies": {}}, "fzi2vhp": {"score": 3, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzi2vhp/", "is_submitter": false, "created": 1595963748.0, "body": "I'm in the UK. I prefer to use RCS as they are less cut to shit than street drugs and I've been researching drugs since way before I was a drug user.\n\nIt's true you might have to think more about dosages with 4-fa for example. But I'd rather have 3 25mg bumps and be speeding all day with way better euphoria than street speed..\n\nA lot of the time your drug induced brain will push it with the combinations/doses tho. Lucky the human body is reasonably durable.", "replies": {}}}}, "fzh0w0h": {"score": 4, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzh0w0h/", "is_submitter": false, "created": 1595932008.0, "body": "I started taking trazodone every night for sleep. The only recreational drugs I do these days are 2c-b and 5-meo-mipt. I have found the trazodone to be an extremely effective trip killer. Another thing I've noticed is it does something to recover tolerance to psyches faster than normal. Not sure what the mechanism for why that would happen but I believe it to be true. I do these drugs pretty frequently and the same doses have given me stronger effects since taking trazodone regularly.", "replies": {"fzifpgj": {"score": 3, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzifpgj/", "is_submitter": false, "created": 1595972824.0, "body": "I’ve Heard that trazodone is used to treat overdoses of stimulants", "replies": {}}}}, "fzh1s0h": {"score": 2, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzh1s0h/", "is_submitter": false, "created": 1595932527.0, "body": "if you take prescription drugs and actually want them to do anything for you dont fw research chems", "replies": {}}, "fzhax3j": {"score": 2, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzhax3j/", "is_submitter": false, "created": 1595938283.0, "body": "When I was on escitalopram I did MDMA and the effects were nearly noticeable with a Dow that would normally have me rolling nicely. \n\nSame for combining with LSD.", "replies": {}}, "fzhwx5d": {"score": 2, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzhwx5d/", "is_submitter": false, "created": 1595957856.0, "body": "I have been taking citalopram since December and psychs/stims definitely still work on me. 40mg of 4-mmc has a noticeable effect on sociability and empathy. A microdose of 10 mcg LSD also works as expected.", "replies": {}}, "fzo8ys4": {"score": 2, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzo8ys4/", "is_submitter": false, "created": 1596093715.0, "body": "I've found that most antipsychotics interact with most things really weirdly and unpleasantly. Especially with dissos. Antipsychotics + dissos = horrible horrible time.", "replies": {}}, "fzggamk": {"score": 1, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzggamk/", "is_submitter": false, "created": 1595920415.0, "body": "I'm on bupropion and lamotrigine for BPII w/ minor hypomania (episodes lasting <2 days). I've found the bupropion (one 450mg XL/day) enhances and extends the effects of stimulants, has no effect on psychs/opiates/dissos/ etc. and reduces the effects of sedatives such as alcohols/barbs/carbamates/and probably benzos, but I stay far away from benzos anymore...\n\nThe lamotrigine, on the other hand, doesn't seem to affect anything. As far as I can tell it's an extremely lightweight mood stabilizer because even on my 200mg/day dosage, it's really hard to tell what it's actually doing. I've found that small things tend to annoy me much less, but that doesn't necessarily mean it's the lamotrigine having the effect and could be attributed to any number of things.\n\nOh and also, the odd effects you mentioned getting from the O-DSMT can be explained by its relative potency as an NRI. I know a lot of people on the sub say that they get awful sleep once the opiate high of O-DSMT wears off but nobody seems to ever mention why. It's a norepinephrine reuptake inhibitor y'all! It's definitely hard to get to bed/relax with a bunch of norep. floating around in your brain *while* you're coming down off an opiate high at the same time.", "replies": {"fzgjbl5": {"score": 1, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzgjbl5/", "is_submitter": true, "created": 1595922036.0, "body": "Thanks for your insights!\n\nI didn't know that about O-DSMT, interesting. I have noticed it to be stimulating though. Having a slight nod but not being able to sleep at all is weird to me but I'm not that experienced with opiods.", "replies": {}}}}, "fzhb80o": {"score": 1, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzhb80o/", "is_submitter": false, "created": 1595938486.0, "body": "[PsychonautWiki.org](https://psychonautwiki.org) has for many substances a section on combinations and possible interactions.", "replies": {}}, "fzhxc1y": {"score": 1, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzhxc1y/", "is_submitter": false, "created": 1595958282.0, "body": "adderall and effexor here.\n\nHave actual ADD so I don't get the \"juice\" from addy's that most do.\n\n3 mmc was a total dud for me (effexor blocked it Im assuming) didn't hit me as strong as 3fpm actually.\n\n3 FPM works in the way that I thought adderall would, but tolerance rises quickly. Man those first couple months I took that I was in functional god mode. Need to reset that tolerance.", "replies": {}}, "fzjju4l": {"score": 1, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzjju4l/", "is_submitter": false, "created": 1595992648.0, "body": "If you only took 100 mg 4-fa then you just didn’t take enough for a good experience. I need at least 125 for a rolly experience and it’s best at 150-170.", "replies": {"fzjqvlc": {"score": 1, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzjqvlc/", "is_submitter": false, "created": 1595996008.0, "body": "It's more of a functional stim at 80-110, or so I've heard.", "replies": {"fzmwupk": {"score": 1, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzmwupk/", "is_submitter": false, "created": 1596070114.0, "body": "Yeah I agree. Not worth wasting it at that dose. Might as well up it to 125+", "replies": {}}}}}}, "fzpo7vf": {"score": 1, "link": "/r/researchchemicals/comments/hz2480/lets_talk_about_interactions_with_antidepressants/fzpo7vf/", "is_submitter": false, "created": 1596129474.0, "body": "Mirtazapine bizarrely almost potentiated MDMA for me, I've never had such a pleasant time on such a low dose before.  \n\nWhen on citalopram I found that cocaine made me anxious, paranoid and unsociable.  I have severe ADHD and cocaine usually does practically nothing to me and is calming so this was odd.  That said, I ended up experiencing hypomania from citalopram and had felt my dose kick in first day which is apparently unusual so SSRI don't agree with me full stop", "replies": {}}}}, "iomc05": {"text": "I am well aware of the many dangers and issues this pseudo opioid drug has. A quick search here on Reddit will render hundreds of posts discouraging use and telling tales of the horrid withdrawal but after reading so much about it I had to try it out for myself and to be completely honest I am pretty amazed. \n\nDOSE: 150mg of Tianeptine sodium Orally, dissolved in water (no opioid tolerance) \n\nNOTE: Tianeptine tastes horrendous, possibly the most bitter thing I have ever consumed \n\n\\--REPORT--\n\n0:10 - Feel a slight relaxation hitting me, placebo? Not sure at this point.\n\n0:15 - Suddenly feel a strong opioid effect coming over me, I'm begging to zone out looking at my screen and a strong sensation of warmth is spreading from head to toe.\n\n0:30 - Wow the rush was incredible, I have gone from completely sober to extremely high within the span of only about 20 minutes, I feel a strong \"stoned\" sensation in my head and have all of the classic opioid effects that one would expect from a strong opiate narcotic like oxycodone or hydrocodone (If not even stronger looking back). However the sedation aspect isn't quite there, I do feel spaced out and heavy-eyed, however I have been unable to catch a nod thus far.\n\n1:00 - After my previous entry I got in bed for the next half hour. Although still feel extremely \"opiate high\" and have now nodded off a few times the Euphoria is begging to fade. \n\n1:30 - Effects are still very strong and subtle itching is begging to set in. Although I feel incredibly sedated and disconnected from my body I haven't been able to nod as much as I normally would off other classic opiates. My body almost feels as if its sinking into my bed, really nice actually.\n\n2:00 - I'm begging to return to baseline. Although I still feel some pretty decent opioid effects I'm definitely past the peak and am actually starting to nod a little harder then before, possibly because the other non-opioid aspects of the drug are wearing off? The euphoria is pretty much gone however yet physically, I still feel amazing. \n\n3:30 - The effects are almost gone now. I still have a lingering opioid sensation through out my body but I am no longer nodding and mentally I feel very tired and still slightly spacey but almost baseline other then that.\n\n5:00 Effects are totally gone, although I barely still feel a slight comfort through out my body, mentally I am completely sober and ready to go to sleep.\n\nConclusion: \n\nWow for a legal RC this is amazing. Its by far the best legal opioid I have ever tried and kicks kratom's ass if you want a classic full agonist high. Its definitely not as \"clean\" feeling as morphine/fentanyl derived opiates but its damn close. For me It felt like a mix between tramadol and oxycodone, leaning far more towards oxy if not being even stronger in some aspects. Although the peak and overall duration is short It has an incredible rush and feels no different then a strong narcotic I would expect to be given by a doctor. \n\nHowever despite my praise this drug is not all good, as I'm sure many of you know it has awful withdrawals and due to its short duration is incredibly fiendish. This is mostly because although the bodily opiate effects linger about as long as oxycodone the euphoria fades rapidly within less then 2 hours and possibly shorter as tolerance builds. \n\nIn conclusion tianeptine sodium provides a slightly dirtier and shorter but arguably stronger oxycodone like high. It feels no different from a classic opioid and I believe the potential for abuse is no less. If you can see yourself having problems with opiate use or have been dependent in the past stay far away from this drug because although the high is good it will smash all classic opioids in terms of withdrawal and tolerance. None the less I am happy to have tried this chemical out and hope that you have found this report useful.", "author": "throwawa96", "score": 32, "flair": null, "created": 1599564685.0, "url": "https://www.reddit.com/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/", "num_comments": 17, "title": "Tianeptine review and experience report (sodium and recreational use)", "subreddit": "researchchemicals", "comments": {"g4etpzp": {"score": 26, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4etpzp/", "is_submitter": false, "created": 1599567487.0, "body": "Tianeptine is not a research chemical, it's a pharmaceutical used in europe as an anti depressant (Stablon, Coaxil). This is a very well written report but this isn't the right forum for it: r/drugs , r/opiates or even r/nootropics (but they might ban you since it's use as a nootropic is now looked down upon/negatively viewed) would be the closest thing because again, this is an anti depressant that has been used for many years in europe. Regardless of the off label use to get an opioid high, still wouldn't count as a research chemical. One could argue that one of the analogues (a few exist) could be considered and RC, but calling Tianeptine sodium an RC is like calling DXM an RC. \n\nLooking forward to any future trip reports or information you provide as again, this is very well written and detailed. It would not be surprising if this was removed though.", "replies": {"g4fum78": {"score": 11, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4fum78/", "is_submitter": false, "created": 1599601225.0, "body": "Etizolam gets called an RC all the time, and it’s a prescribed medication in some countries (Italy, I think?) as well.", "replies": {}}, "g4g4xiy": {"score": 5, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4g4xiy/", "is_submitter": true, "created": 1599607024.0, "body": "I am aware that its not a research chemical but the people that would likely be using this drug recreationally the way I am, are likely people in this forum who like to experiment with legal alternatives which tianeptine sodium is. Just thought the most people would find it useful here as most people in other drug forums have never even heard of this chemical in their life.", "replies": {"g4gko3z": {"score": 1, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4gko3z/", "is_submitter": false, "created": 1599615060.0, "body": "That is a totally fair point, and as another poster said etizolam is occasionally accepted in this subreddit but that has more to do with the fact that it is an unscheduled thienodiazepine and it gets some acceptance because RC benzos are popular on this forum, as well as the way etizolam is discussed. Even then, people aren't writing trip reports or providing info about etizolam, they just note that it exists or recommend it for certain uses like reducing bad trips or coming down from RC stimulants.Again, not trying to bash you at all, and your report was fantastic. If it doesn't get removed then that's great and any information provided for people in the future to search/read up on is a great help to drug education and society. Looking forward to reading anything else you have to post about other compounds in the future.", "replies": {}}}}, "g4ezdxy": {"score": 2, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4ezdxy/", "is_submitter": false, "created": 1599572067.0, "body": "Agreed! Fantastic trip report but not an RC. Good job though!! I feel like your dosage info etc was fantastic. I would actually try this chem based on your trip report however I avoid opiate like drugs simply because they are so addictive. Thank you for sharing even if it’s not an RC", "replies": {"g4f0x22": {"score": 6, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4f0x22/", "is_submitter": false, "created": 1599573410.0, "body": "This is a drug that actually has worse withdrawals and negative effects than even a traditional opiate. Since it's a tricyclic anti depressant it works on multiple systems, only one of which is the mu opioid receptors. Normal prescribed doses are 12.5 mg 3x daily, so recreational doses are roughly 10 times a singular dose. The issue with that is that a lot of the other mechanisms (serotonin reuptake enhancement, glutamatergic system downregulation) do not scale in the same way as the opioid effects.\n\nThis means that to get the desired opioid effects, people have to take massive doses that end up raising tolerance/activating other pathways really quickly and aggressively. This means that while normal withdrawal from opiates can be uncomfortable, withdrawal from tianeptine is like withdrawing from an opiate, an antidepressant, and a benzodiazepine/tranquilizer all at the same time, and after a shorter period of use than a typical opioid. It would be especially strong because of the doses being 10x+ the therapeutic effect as well, meaning someone unlucky enough to kick a tianeptine habit will be in for:\n\nrunny nose, achy bones, no energy, hot/cold flashes, stomach cramps/explosive diarrhea, increased pain sensitivity, extreme restless leg syndrome, extreme feelings of sadness/depression/hopelessness, akathisia, extreme anxiety.\n\nPeople should be able to choose what they do/put in their bodies, as long as it doesn't harm others. Drug education/awareness and freedom are extremely important and hopefully attainable in our lifetimes.  That said, this is a very powerful drug intended to be used in small amounts that works on a lot of systems in a not very targeted way. Consider this: if you enjoy it, will you not want to do it more? If that is the case, those withdrawals are a very probable future outcome. That combination of symptoms sounds pretty nasty, and a very risky roll of the dice.", "replies": {"g4f80gw": {"score": 5, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4f80gw/", "is_submitter": false, "created": 1599580442.0, "body": "Well. That was amazing reading that. Any single doubt I had of trying tianeptine just completely vanished after reading that. Another example drug education is key.", "replies": {}}, "g4fk5pg": {"score": 3, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4fk5pg/", "is_submitter": false, "created": 1599593637.0, "body": "Yeah I had heard all of that before. Thanks for the reminder!! Anytime I want an “opiate” I reach for kratom. Seems MUCH safer", "replies": {}}}}}}, "g4fhse9": {"score": 2, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4fhse9/", "is_submitter": false, "created": 1599591383.0, "body": "Why is it’s use as a nootropic looked down upon?", "replies": {"g4gjxx7": {"score": 2, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4gjxx7/", "is_submitter": false, "created": 1599614697.0, "body": "Because of the abuse and dependency liability. One anecdote I heard was that when a certain vendor sold out or discontinued it people got really upset/sent tons of emails because they were physically addicted and didn't have a source anymore. Can't blame them at all, especially if they didn't realize the ramifications of chronic high dose use. Generally nootropics are supposed to be cognitive/life enhancing without being in the same category as drugs that get you \"high\" (which is why phenibut has a lot of warnings around it on nootropics posts currently).\n\nIt's a weird situation because there are no firm categorizations, it ends up coming down to perception. Things that are perceived as cognitive enhancing/making people more productive/healthier/happier/not associated with typical drug abuse behaviors = nootropic, anything where the verbage/associations change to be more like traditional drugs the community tends to shun. \n\nFor that reason people are generally more accepting of the Sulfate form of Tianeptine as a nootropic because it has a very long duration of action, very little peak, maintains a lot of the mood lifting/cognition enhancing/anxiolytic effects without more extreme euphoria, and doesn't facilitate compulsive redosing.", "replies": {"g4i039y": {"score": 1, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4i039y/", "is_submitter": false, "created": 1599640986.0, "body": "Thanks for that info and clarify that! Makes sense", "replies": {}}}}, "g4figyb": {"score": 1, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4figyb/", "is_submitter": false, "created": 1599592060.0, "body": "My guess is because it's addictive.", "replies": {"g4fks8n": {"score": 1, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4fks8n/", "is_submitter": false, "created": 1599594188.0, "body": "makes sense. is sulfate seen the same way? i don't think that one is abused as much as sodium", "replies": {}}}}}}}}, "g4f5sz5": {"score": 4, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4f5sz5/", "is_submitter": false, "created": 1599578081.0, "body": "I can get tianeptine OTC in my country lol", "replies": {}}, "g4hbnml": {"score": 2, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4hbnml/", "is_submitter": false, "created": 1599628569.0, "body": "When I wanted to try a \"big\" dose of tianeptine sodium I took around 70-85mg. It completely fucked my life up, wish I never touched the stuff.\n\n\nDosed it May 23rd last year and I haven't been the same since.\n\nI have really bad anxiety now. It has gotten better tho, but I'm far from being my normal self :(", "replies": {"g4iafi2": {"score": 3, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4iafi2/", "is_submitter": true, "created": 1599646785.0, "body": "was it that single dose that left you with lingering problems or did that start a cycle of use? As I feel perfectly fine 2 days later", "replies": {"g4ih66u": {"score": 1, "link": "/r/researchchemicals/comments/iomc05/tianeptine_review_and_experience_report_sodium/g4ih66u/", "is_submitter": false, "created": 1599650809.0, "body": "That dose was all it took for me to get fucked up. On the bright side, it made me go for a sober life :)", "replies": {}}}}}}}}, "f47obk": {"text": "So I had just received a 100ml bottle of 2M2B earlier today and after a trial of around 8ml in gel caps(btw one doesn't have to deal with the wretched taste of this compound using caps), i have to say that I dig it. Its not nearly as nauseating than ethanol and has a more euphoric and disinhibitory feel to it, although it did leave me with quite the gnarly headache a few hours after ingestion. Which doesn't completely make sense as it doesn't metabolize into acetaldehyde like ethanol so I didn't expect any sort of ill after effects but then again it IS an alcohol so it was likely naive for me to think that.\n\nAnyways, I posted this to get any input on how to best use this drug, how to bypass those god awful fucking burps and how it interactions/the safety in combinations with other substances. Planning to take 20mg of hydrocodone and 25mg of promethazine later tonight as I have a bit of a habit, with around 5ml or so, get some potentiation going on but I don't wish death upon myself yet so any input is appreciated.", "author": "disheveledfiend", "score": 5, "flair": null, "created": 1581790954.0, "url": "https://www.reddit.com/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/", "num_comments": 17, "title": "2 methyl 2 butanol/tert amyl alcohol", "subreddit": "researchchemicals", "comments": {"fhopk5n": {"score": 8, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhopk5n/", "is_submitter": false, "created": 1581797613.0, "body": "Please please do not add opioids to this stuff. It has a very very long duration and you're playing with fire combining two powerful downers", "replies": {"fhopx9e": {"score": 1, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhopx9e/", "is_submitter": true, "created": 1581797891.0, "body": "I mean I got a decent opiate tolerance, for hydrocodone atleast it takes 30mg at the minimum for me to get high and thats been with pregabalin and small bits of ethanol.", "replies": {"fhoq88e": {"score": 4, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhoq88e/", "is_submitter": false, "created": 1581798238.0, "body": "Well regardless start very low. You can always take more later, can't take less", "replies": {"fhoqn8y": {"score": 0, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhoqn8y/", "is_submitter": true, "created": 1581798768.0, "body": "Good advice, probably gonna take 10mg and redose tert amyl and maybe norco as needed. You mentioned the duration being decently long for this compound, what was the subjective duration for you and do you have any sources for any actual half life(can be irrelevant in relation to subjective duration but its a good piece of info so you can figure how long to wait until taking other substances imo). Personally I only felt positive effects for maybe 4 hours so not long ime.", "replies": {"fhosgj3": {"score": 1, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhosgj3/", "is_submitter": false, "created": 1581800902.0, "body": "I've felt effects 16 hours later. This sub has a decent number of trip reports about long duration as well. I'll have to do some digging for measured half life", "replies": {"fhovplq": {"score": 1, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhovplq/", "is_submitter": true, "created": 1581804233.0, "body": "Yeah, the euphoria faded after maybe 3 hours but the motor control loss is still here after 9+ hours unfortunately, been having to correct misspellings almost three times as much as usual lol, don't really feel all too fucked up though. Not in the \"delusions of sobriety\" benzo way but in that the only intoxicating effects I'm getting of now is motor control loss. \n\nFor you personally, what kind of effects did you get from this drug in comparison and differentiation to other GABAergics? Imo it just felt like a cross in between ethanol in its core effects and gabapentinoids in its strong, unique euphoria although this doesn't describe the high of this drug nearly as well as I'd like it to, its quite the strange one.", "replies": {"fhp4yg5": {"score": 1, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhp4yg5/", "is_submitter": false, "created": 1581810846.0, "body": "Yeah seemed closer to alcohol than any other specific drug, but definitely cleaner feeling. It scares me a little because it is an oily alcohol and dissolved the plunger in syringes, so who knows what it could be doing to human tissue.\n\nIn terms of GABAergics, my favorite by far is phenibut but that's very different from 2m2b", "replies": {}}}}}}}}}}, "fhoq5wn": {"score": 1, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhoq5wn/", "is_submitter": true, "created": 1581798154.0, "body": "if you've had negative personal experience mixing depressants with tert amyl I'll stay away but I know this subs tendency to talk about these type of interactions when in reality, if done VERY CAREFULLY, can turn out fine. lol I sound so irresponsible, bring on the downvotes :).", "replies": {}}}}}}, "fhoxga4": {"score": 2, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhoxga4/", "is_submitter": false, "created": 1581805782.0, "body": "Can you compare 2m2b to 1,4bdo?\nAlso why the promethazine? I would be cautious taking a cocktail of depressants like that", "replies": {"fhoyitp": {"score": 2, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhoyitp/", "is_submitter": true, "created": 1581806689.0, "body": "Never done 1,4BDO, though its on my bucket list, I feel like GHB and related compounds would be right up my alley as I adore gabapentinoids and benzodiazepines.\n\nPromethazines for itchiness/nausea. As well as potentiatation, if it even has the potential for that as I've heard conflicting reports on that subject but if it doesn't I have enough faith in placebo to make a difference. As do most people.", "replies": {}}}}, "fhpwsuk": {"score": 1, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhpwsuk/", "is_submitter": false, "created": 1581824945.0, "body": "To reduce the burps, I eat bread right after I consume the caps.", "replies": {}}, "fhrmdbp": {"score": 1, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhrmdbp/", "is_submitter": false, "created": 1581859268.0, "body": "Do not take this stuff multiple days in a row. You'll be really sorry you did. You'll sleep forever and feel retarded. Otherwise, if you don't use it often, it's pretty nice. Probably the closest you can get to a lude or barb these days.", "replies": {"fhrmx4x": {"score": 2, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhrmx4x/", "is_submitter": true, "created": 1581859776.0, "body": "Well shit man its already day 2 and I've been going pretty hard, should I be expecting any repercussions? I'm aware 99% of the GABAergics out there have W/D potential but I wouldn't think anything would be harmful in less than a week except for shit like c-lam which I've already learned my leason with.", "replies": {"fhrwgob": {"score": 1, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhrwgob/", "is_submitter": false, "created": 1581870760.0, "body": "No, man, it's not withdrawal. It builds up and the metabolites are more heavy feeling and make you want to sleep. The half-life is over 24 hours, so if you do it day after day, you will start to feel like I said. Just keep some free days in between.", "replies": {"fhv20ro": {"score": 2, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fhv20ro/", "is_submitter": true, "created": 1581921270.0, "body": "Yeah i definitely feel like that, I slept until 1:30pm and had to take 80mgs of vyvanse today lol, a break is needed.", "replies": {}}}}}}}}, "fmlu31c": {"score": 1, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fmlu31c/", "is_submitter": false, "created": 1586222045.0, "body": "You can add 2-methyl-2-butanol to a glass of water and add a little bit of vodka to help with solubility. For every 2 ml of 2m2b, you can add 5 ml of vodka(40% ethanol). Measure in a 10 ml glass graduated cylinder. Add to a glass of warm water and stir then chug. The dose range of 2m2b is about 2-10ml.", "replies": {"fqcb676": {"score": 1, "link": "/r/researchchemicals/comments/f47obk/2_methyl_2_butanoltert_amyl_alcohol/fqcb676/", "is_submitter": false, "created": 1589282840.0, "body": "I’m 2 hrs into it. Took 9ml mixed some unsweetened tea with it and chugged it. Taste was definitely unpleasant but nothing that you can’t survive. The burps i got along the way are nasty. I didn’t really feel anything from this dose.", "replies": {}}}}}}, "fy6lgx": {"text": "Hey r/RCs, I'm feeling really good off ~15mg of this substance, taken intranasally. It feels really good, reminds me of when I chewed up tiny pieces of a fentanyl patch. It's on par with oxycodone honestly. My only issue was the burn from snorting it and what I've read about it's toxicity/caustic properties. For reference, I've never been addicted to opioids and have no tolerance to them right now, and I definitely feel this. I've tried most opiates -- codeine, hydrocodone, oxycodone, morphine, heroin, fentanyl -- just for reference. This one is definitely a worthy opiate. Short duration though. I'm open to ROA suggestions, I heard sublingual is the best.\n  \nEdit: Redosed 30mg like 25 minutes ago. Nodded really hard but have come out of it already, still feeling good. This drug requires frequent redosing to maintain nod, but the nod was so fucking good. I'm pretty happy with my purchase.", "author": "silverexe", "score": 3, "flair": null, "created": 1586515448.0, "url": "https://www.reddit.com/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/", "num_comments": 15, "title": "2-Methyl-AP-237 Initial Thoughts", "subreddit": "researchchemicals", "comments": {"fmyt9qc": {"score": 3, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmyt9qc/", "is_submitter": false, "created": 1586523890.0, "body": "Nice. Too bad it's too caustic to boot or iv", "replies": {"fmz77qi": {"score": 2, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz77qi/", "is_submitter": false, "created": 1586537927.0, "body": "Its really not to caustic to boof", "replies": {}}, "fq587kt": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fq587kt/", "is_submitter": false, "created": 1589124581.0, "body": "I actually doesn’t burn IV assuming you don’t miss", "replies": {}}}}, "fn3ymto": {"score": 3, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fn3ymto/", "is_submitter": false, "created": 1586659302.0, "body": "It’s more euphoric than the afghan Heroin but the duration sucks. Can’t touch china white #4 tho...", "replies": {}}, "fmyxh5r": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmyxh5r/", "is_submitter": false, "created": 1586527646.0, "body": "Have you tried it orally?", "replies": {"fmyzkcy": {"score": 2, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmyzkcy/", "is_submitter": true, "created": 1586529707.0, "body": "No, I didn't make myself as clear as I could have. This is my first time ever taking this substance. I was able to maintain a pretty nice nod by redosing 20-30mg lines every 30 minutes. I'm done for the night though, don't wanna go too far. I feel like I went a little hard for having no opiate tolerance, but man it felt great, and I was with a friend in case I over did it. Haven't felt the nods like this since snorting heroin a few years ago.", "replies": {"fmz5kd5": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz5kd5/", "is_submitter": false, "created": 1586536054.0, "body": "Ok that has me very excited to try it out soon. Have you used ODSMT before? I imagine even if you had it doesn't compare to many of the other opiates you have used. I recently got a gram of both 2methylap237 and ODSMT so I am trying to compare and figure out ROA's and dosage.", "replies": {"fmz7apb": {"score": 2, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz7apb/", "is_submitter": false, "created": 1586538022.0, "body": "For the best effects i would snort 2map237. Its a fuckin insane euphoric high. But i would not suggest to snort it that often.", "replies": {}}, "fmz75o6": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz75o6/", "is_submitter": false, "created": 1586537862.0, "body": "boof odsmt, 2map i'd just eat.", "replies": {"fmz76g9": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz76g9/", "is_submitter": false, "created": 1586537886.0, "body": "Makes sense considering how caustic I have heard 2map is.", "replies": {"fmz77jh": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz77jh/", "is_submitter": false, "created": 1586537922.0, "body": "down it with milk and or ice cream, its lipophilic.", "replies": {"fmz7dde": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz7dde/", "is_submitter": false, "created": 1586538107.0, "body": "Is that to make it more effective or to counteract the caustic nature of it?", "replies": {"fmz7hsh": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz7hsh/", "is_submitter": false, "created": 1586538243.0, "body": "helps the causticity, and probably a bit of effectiveness but I have no proof. But damn did it sure help my stomach doing it that way! Felt just cleaner all around.", "replies": {"fmz7lnc": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz7lnc/", "is_submitter": false, "created": 1586538366.0, "body": "Ok cool sounds interesting. What would you recommend as a good first time dose?", "replies": {"fmz7ptl": {"score": 1, "link": "/r/researchchemicals/comments/fy6lgx/2methylap237_initial_thoughts/fmz7ptl/", "is_submitter": false, "created": 1586538495.0, "body": "zero tolerance to any opi/kratom? and possibly low low experience?   \n7-10mg. You can always take more and you will, that will give you a base of how you react (after allergy test) and how much more or not you want. At 10mg it was quite noticeable for me. So much so I thought i may have over did, this was long long ago when no info was out.", "replies": {}}}}}}}}}}}}}}}}}}}}}}, "fd7lp3": {"text": "I was considering getting some O-DSMT to use occasionally. I have enjoyed kratom and hydrocodone combined with amphetamines in the past. Due to the seizure risks associated with tramadol, I didn't know if such a combination with stimulants would be safe.\n\nI have heard that O-DSMT has less seizure issues than tramadol, but I don't know if it's just slightly less risky or if the risk is virtually nonexistent with O-DSMT. The feeling of a opiate buzz alongside a speed high is such a fantastic experience, so even being able to take it on the comedown would be nice.\n\nOn the topic of O-DSMT, what drug does it compare to as far as quality (for a person with zero opiod tolerance)? Is it on the level of hydrocodone, or is it lighter, like codeine perhaps? I like to take an opiate once in a while so I'm planning on infrequent use of the drug. I'll probably take it orally unless it's particularly good plugged.", "author": "colorfulexistance", "score": 8, "flair": null, "created": 1583324786.0, "url": "https://www.reddit.com/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/", "num_comments": 14, "title": "O-DSMT: Safe to Combine With Amphetamines?", "subreddit": "researchchemicals", "comments": {"fjfxtsx": {"score": 3, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fjfxtsx/", "is_submitter": false, "created": 1583332414.0, "body": "It's probably on the level of hydrocodone, if I had to guess. It's not oxycodone, but it's definitely much closer to traditional opioids than tramadol.\n\nO-DSMT likely doesn't have the seizure risk associated with tramadol (which has multiple mechanisms that could potentially contribute), but for the purposes of harm reduction, it's best to assume that it could cause a significant decrease in seizure threshold. I personally don't think it will, but what do I know?\n\nI have taken it with 2-FMA and a-PCYP (separate occasions) and haven't noticed anything concerning. If you do decide to do combinations, I recommend keeping your doses low.\n\nFor me, 25-30 mg is perfect, but it's a lot less than some people take. I always suggest checking PsychonautWiki and Tripsit for standard dosing information and interactions before taking any new drug.", "replies": {}}, "fjfq9sp": {"score": 1, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fjfq9sp/", "is_submitter": false, "created": 1583326232.0, "body": "[removed]", "replies": {"fjfqwxf": {"score": 1, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fjfqwxf/", "is_submitter": true, "created": 1583326692.0, "body": "Very interesting. I assumed it would have some kind of ceiling. I guess it's good that's it's much stronger than tramadol, that shit is weak. I'll have a little more of idea of the strength of this stuff. What kind of dosage would you recommend? For reference 20 to 30mg of hydrocodone is my ideal recreational dose.", "replies": {"fjfxvss": {"score": 2, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fjfxvss/", "is_submitter": false, "created": 1583332470.0, "body": "The ceiling that tramadol has is due to it needing to be converted by your hepatic enzymes to O-DSMT, hence taking O-DSMT straight bypasses the \"ceiling\"", "replies": {}}}}, "fjfymzx": {"score": 0, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fjfymzx/", "is_submitter": false, "created": 1583333205.0, "body": "IME,  o dsmt def had ceiling at about 100mg.", "replies": {"fjykub0": {"score": 1, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fjykub0/", "is_submitter": false, "created": 1583727714.0, "body": "Same. Anything beyond that is just bizarre effects from NE reuptake inhibition", "replies": {}}}}}}, "fjfr22u": {"score": 1, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fjfr22u/", "is_submitter": false, "created": 1583326795.0, "body": "Never can saying is safe. Many users try.", "replies": {}}, "fjftzvk": {"score": 1, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fjftzvk/", "is_submitter": false, "created": 1583329026.0, "body": "I wouldn't risk it, feeling good for 6 or so hours isn't worth the unknown consequences.", "replies": {}}, "fjfyzsh": {"score": 1, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fjfyzsh/", "is_submitter": false, "created": 1583333562.0, "body": "[deleted]", "replies": {"fjgsnlk": {"score": 1, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fjgsnlk/", "is_submitter": true, "created": 1583363461.0, "body": "That's good to know. I've only had one seizure in my life and I assume it was a random fluke. I'll just play it safe and use lower dosages and see how it goes", "replies": {"fomosv9": {"score": 1, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fomosv9/", "is_submitter": false, "created": 1587927089.0, "body": "how did it go? took some odsmt 10hours ago and thinking about taking 30mg amphetamine orally", "replies": {"fon7lth": {"score": 1, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fon7lth/", "is_submitter": true, "created": 1587942778.0, "body": "Still haven't gotten mine due to financial reasons.", "replies": {}}}}}}}}, "fv4demo": {"score": 1, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fv4demo/", "is_submitter": false, "created": 1592429835.0, "body": "did you try it ? how was it?", "replies": {"fvnapmi": {"score": 1, "link": "/r/researchchemicals/comments/fd7lp3/odsmt_safe_to_combine_with_amphetamines/fvnapmi/", "is_submitter": true, "created": 1592869731.0, "body": "It was pretty good. Finally tried it, had no issues", "replies": {}}}}}}, "j713kd": {"text": "I ordered a gram of ap238 and was wondering what you think of it compared to oxycodone/hydrocodone. I have no opioid tolerance and am completely new to this substance", "author": "1212googloo", "score": 0, "flair": null, "created": 1602139170.0, "url": "https://www.reddit.com/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/", "num_comments": 14, "title": "What do you think of ap238?", "subreddit": "researchchemicals", "comments": {"g821wza": {"score": 3, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g821wza/", "is_submitter": false, "created": 1602143155.0, "body": "Extremely caustic and you should've got ODSMT lol", "replies": {"g822kto": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g822kto/", "is_submitter": true, "created": 1602143547.0, "body": "That's what I was thinking but I wanted something that was going to knock my dick in the dirt", "replies": {"g822rz6": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g822rz6/", "is_submitter": false, "created": 1602143664.0, "body": "Then u got the wrong substance", "replies": {"g822u5u": {"score": 2, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g822u5u/", "is_submitter": true, "created": 1602143699.0, "body": "Odsmt for the future then?", "replies": {}}, "g8233v0": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g8233v0/", "is_submitter": false, "created": 1602143852.0, "body": "But isn't ap238 much stronger than odsmt", "replies": {"g823kgd": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g823kgd/", "is_submitter": true, "created": 1602144123.0, "body": "Damn, I wish I would have known that. Health over anything lol. Oh well, 1 gram cant do too much damage", "replies": {"g823o03": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g823o03/", "is_submitter": false, "created": 1602144181.0, "body": "Yeah u will be fine odsmt a banger tho", "replies": {"g823re3": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g823re3/", "is_submitter": true, "created": 1602144235.0, "body": "Bet. I'll try that in the future then!", "replies": {}}}}}}}}}}}}}}, "g825tnd": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g825tnd/", "is_submitter": false, "created": 1602145407.0, "body": "left me w some bloody boogers and dry sinuses for like 3-4 days after a couple doses in a night. i didnt really find the high to be anything worthy enough to outweigh the cons. will never buy another gram. \n\nlike other poster said, next time get some ODSMT to try", "replies": {"g8263gj": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g8263gj/", "is_submitter": true, "created": 1602145563.0, "body": "Yeah I'm talking it orally for sure but I was unaware it was so caustic", "replies": {"g826bkc": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g826bkc/", "is_submitter": false, "created": 1602145694.0, "body": "from what ive read and my own experience it wasnt AS damaging to some people. at least not as caustic as i wouldve made it out to be. theres also a post on here somewhere where a guy boofed his dose and got some rectal bleeding. i used the last little bit i had orally and didnt seem to have any issues from it", "replies": {"g826xnk": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g826xnk/", "is_submitter": true, "created": 1602146045.0, "body": "Yeah I just read on the website I was buying from \"medicine used in china\" and \"5x stronger than morphine\" and I just went Ooooo I gotta have some xD I've had tramadol before and I know that's a lighter opiate so that's why i went with ap thinking it was the stronger one. I definitely dont want to risk health over high though so this will probably be my first and last gram", "replies": {"g8299n2": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g8299n2/", "is_submitter": false, "created": 1602147379.0, "body": "You gotta do your research g. Odsmt would be perfect for someone in your shoes", "replies": {"g83xqyj": {"score": 1, "link": "/r/researchchemicals/comments/j713kd/what_do_you_think_of_ap238/g83xqyj/", "is_submitter": false, "created": 1602194595.0, "body": "That ap238 looks so promising though and then everyone says ita trash. I hear 2map237 is better but this particular batch is supposed to be trash too", "replies": {}}}}}}}}}}}}}}, "hboqm4": {"text": "After waiting weeks for a package of O-DSMT that is still yet to arrive, I decided to buy a different synthetic opioid, 2-methyl-AP-237, which arrived at my doorstep quite quickly. I won’t lie, I was a little scared of this chemical based on what I had heard in reviews (causticity, nausea), but I decided to give it a go anyways. \n\nI have done a few opioids before, all in the last couple of months or so. These experiences were with 15mg of Hydrocodone on three different occasions all taken orally, .3mg of Buprenorphine plugged (not combined with nalaxone), and, on maybe 3 or 4 different occasions, a combo of 250-500mg Phenibut FAA insuffuted and 3-4 grams of Kratom taken orally. My tolerance for trying all of these chemicals, including trying 2map, has been very low or nonexistent. \n\nI had heard 2map has a similar potency to morphine, and because 15mg of Hydrocodone was great for me and had a similar potency, I decided to try 16mg of 2map. I mixed 80mg of 2map into 5ml of distilled water, then drew it up into 5, 1cc oral syringes. \n\nWhen the time came for my first dose, I poured out a small glass of distilled water after eating a medium sized meal to reduce nausea. Into the glass of distilled water, 1cc (16mg 2map) of solution was added. I drank the glass of water, and it had a distinct taste, similar to the smell, which was like a mix of cheese and gasoline, the taste only lingered for a few seconds, and wasn’t particularly unpleasant. Much better than the taste of Kratom.\n\nWithin 10 minutes of ingestion, I felt the usual opiate warmth, and significant euphoria and sedation. For an equal dose of Hydrocodone, I would say 2map has twice the amount of sedation, with maybe 5-7x more euphoria. It was also slightly itchy. The effects continued to climb in intensity for another 30 minutes, and then began to decline until I was at baseline just over 2 hours after dosing. My first experience with 2map was much stronger and euphoric than I expected by a very large amount. I would imagine that’s what heroin would feel like, and hearing other people compare it to medium quality H definitely makes sense.\n\nMy second dose of 2map occurred two nights later, and this time 1 drank 1.5cc (24mg 2map) of solution, and then redosed with 1cc (16mg 2map) of solution an hour and a half later. The effects were very similar to the first time, only more intense, and more nod-friendly. Redosing was very nice and smooth, and the very fast come up time makes for an amazing experience. Music was enjoyable as well which is nice because on some opioids it becomes annoying. I’ve heard some people say it is stimulating, but I didn’t experience any stimulation at all really. Buprenorphine was much more stimulating.\n\nOverall, this chemical is wayyy better than any other opioid high I’ve ever experienced, and I can see why people have compared it to heroin. I experienced no discomfort or nausea taking it orally as long as I ate with it or drank a glass of milk with it. It completely blows Hydrocodone, Buprenorphine, and Kratom+Phenibut out of the water for me, so if you don’t have much of a tolerance, this is an amazing, cheap opioid to buy.", "author": "SibeliusVC", "score": 14, "flair": null, "created": 1592548990.0, "url": "https://www.reddit.com/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/", "num_comments": 12, "title": "2-Methyl-AP-237 was miles ahead of any other opioid I’ve tried (Report)", "subreddit": "researchchemicals", "comments": {"fva9yvl": {"score": 24, "link": "/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/fva9yvl/", "is_submitter": false, "created": 1592552763.0, "body": "Best opioid you tried and the hardest one you’ve done is subs? And you’ve only done them in the past couple of months? Turn back bruh it’s a scary road, I know more drug nerds that ended up shooting smack than I should.", "replies": {"fvacz1t": {"score": 6, "link": "/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/fvacz1t/", "is_submitter": false, "created": 1592554470.0, "body": "I agree and it’s a crazy shittt road. 10+ years of it", "replies": {"fvag3nj": {"score": 5, "link": "/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/fvag3nj/", "is_submitter": false, "created": 1592556309.0, "body": "Barely does any opiates and chooses to plug the sub... 🤦🏻‍♂️", "replies": {"fvan12m": {"score": 2, "link": "/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/fvan12m/", "is_submitter": false, "created": 1592560525.0, "body": "Imagine what you know now then.... lol.", "replies": {}}}}}}}}, "fvadhcr": {"score": 2, "link": "/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/fvadhcr/", "is_submitter": false, "created": 1592554762.0, "body": "Don't ever take buprenorphine with any opioids or opiates (even if its without naloxone). Buprenorphine is partially antagonist of opioid receptors, same as naloxone which means its dangerous and could cause withdrawl-like symptoms. Just my warning. Stay safe boys.", "replies": {"fvfy72x": {"score": 1, "link": "/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/fvfy72x/", "is_submitter": false, "created": 1592692225.0, "body": "This is only true if you are currently dependent, which it soundd like OP is not. The term you are looking for is \"precipitated withdrawal\"\"", "replies": {}}}}, "fvbjc4h": {"score": 1, "link": "/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/fvbjc4h/", "is_submitter": false, "created": 1592585049.0, "body": "Somehow daily there pop up a new positive 2-m-AP-237 report or a question regarding that chemical. Seems to become more popular than I thought it could get...", "replies": {}}, "fvby6xn": {"score": 1, "link": "/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/fvby6xn/", "is_submitter": false, "created": 1592598747.0, "body": "Thats because you only had 15mg hydrocodone. Trust me if you did more you‘d almost certainly prefer it. \n\nI too like mAP237, its good and I like it more than odsmt but a properly dosed morphine deriv is hard to beat", "replies": {}}, "fvd5dyj": {"score": 1, "link": "/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/fvd5dyj/", "is_submitter": false, "created": 1592621625.0, "body": "Been enjoying 2-map-237 here also recently received a few days ago and it’s pretty great tbh. Burns like hell though and is caustic", "replies": {}}, "fvdevyn": {"score": 1, "link": "/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/fvdevyn/", "is_submitter": false, "created": 1592626310.0, "body": "Could it be shot?", "replies": {}}, "fx3tpbv": {"score": 1, "link": "/r/researchchemicals/comments/hboqm4/2methylap237_was_miles_ahead_of_any_other_opioid/fx3tpbv/", "is_submitter": false, "created": 1594077450.0, "body": "Yea the only opiate I had ever tried before 2map was odsmt which did  nothing to me, once I got that 2map, BOOOOOOOY I never felt euphoria like that in my entire life, tho I snorted it.", "replies": {}}}}, "etk1dc": {"text": "I am very experienced with stimulants, and have been using them one day a week or so for about 4 years now (interspersed with 1-2 month breaks here and there). In the past I have used kratom, hydrocodone, cannabis, CBD, phenibut, 1,4-BDO, and alcohol to ease the stimulant comedown. However, I recently got some diclazepam blotters for this purpose.\n\n&#x200B;\n\nMy previous go-to comdown drugs were phenibut and 1,4-BDO, either separate, or together in reduced amounts. I realized that they were both euphoric enough to entice me to stay up later. Often I would dose them before the my \"\"last \"\" dose of speed wore off, only to continue dosing speed because the GABA euphoria made me lose my inhibitions and not give a fuck. So even though 1,4-BDO was great at making me sleep, it also makes me want to party until 5am.\n\n&#x200B;\n\nI am hoping diclazepam will make me sleepy without being too enjoyable, if you get what I mean. What dosages would you recommend to a guy coming off of a full day of 2-FA and 3-FPM? Are there other benzos that you think are superior for my purposes? Is taking kratom with benzos kosher? If I take some of the benzo while I am still speeding, will it kill the amphetamine high, or will the highs combine, like phenibut with amphet? Will I get rebound anxiety or a hangover from a reasonable dose of diclazepam?\n\nI have never properly tried benzos before, so general advice is appreciated *(except this one time I took just .25 milligrams of klonopin while I was high on 2-FDCK, weed, 4-aco-DMT, nitrous, and maybe some phenibut? while coming off of a lot of 3-FEA, so yeah I couldn't really tell what it did).*\n\n&#x200B;\n\nThe last GABAergic I used was a single gram of phenibut 5 days ago, so I'm guessing that puts me at zero tolerance. So anyway, if you have any tips/tricks/commentary regarding comedowns or benzos please share them.", "author": "colorfulexistance", "score": 2, "flair": null, "created": 1579944199.0, "url": "https://www.reddit.com/r/researchchemicals/comments/etk1dc/first_time_using_a_benzo_for_a_stim_comedown_tips/", "num_comments": 8, "title": "First Time Using a Benzo for a Stim Comedown, Tips?", "subreddit": "researchchemicals", "comments": {"ffgwtd4": {"score": 3, "link": "/r/researchchemicals/comments/etk1dc/first_time_using_a_benzo_for_a_stim_comedown_tips/ffgwtd4/", "is_submitter": false, "created": 1579945872.0, "body": "Etizolam is good. Diclazepam is also good but will last awhile in your system. And for those nights that you have to sleep like a rock fluaplrazolam takes the cake but don't do a lot and never do flualp often because reasons.", "replies": {"ffgy7ay": {"score": 1, "link": "/r/researchchemicals/comments/etk1dc/first_time_using_a_benzo_for_a_stim_comedown_tips/ffgy7ay/", "is_submitter": true, "created": 1579946911.0, "body": "Etizolam was the other one I was considering. I actually close diclazepam due to it's longer duration, I wanted something that would last longer through the night to keep me sleeping well for a longer time. I'm guessing flualprazolam is more addictive or harsher?", "replies": {"ffgz06v": {"score": 1, "link": "/r/researchchemicals/comments/etk1dc/first_time_using_a_benzo_for_a_stim_comedown_tips/ffgz06v/", "is_submitter": false, "created": 1579947508.0, "body": "Lasts into the next day. Seems to blow up tolerance as well. Maybe bc people abuse it. 0.25 to 0.5 mg should be nice. It's super inexpensive if you know where to look and volumetrically dose. Etizolam is nice because you won't be a barred out mess in the morning. 1mg before bed I usually sleep a good 5 solid hours. If I ramp it up to 1.5 to 2mg I sleep 6 or 7. These estimates for me with moderate tolerance, everyone's different. Flualp is nice but if you can't handle using benzos responsibly don't consider getting it, etiz always the safest all around winner. Second to real pharma pressed xanax.", "replies": {"ffh26sz": {"score": 1, "link": "/r/researchchemicals/comments/etk1dc/first_time_using_a_benzo_for_a_stim_comedown_tips/ffh26sz/", "is_submitter": true, "created": 1579949908.0, "body": "Ah I see. I'm used to phenibut, where it lasting into the next day is desirable. I think I'll pick up some etizolam blotters next, might as well try the one that everyone else loves. The low price is nice, I got blotters just to see how it is without having to go through the process of making a volumetric solution, and even the blotters are cheap compared to most other RCs.\n\nI'm still feeling the 2-FA, but I took about .5mgs of diclaz (half a blotter), and I'm starting to feel it now. It's pretty nice, nothing overwhelming but my muscle tension is virtually gone but I still feel quite clearheaded, just more relaxed. I think I'll take the rest of the blotter when I want to sleep. If your sleep estimates translate to my system I should be able to get a decent night of sleep, thanks!", "replies": {"ffhyj44": {"score": 1, "link": "/r/researchchemicals/comments/etk1dc/first_time_using_a_benzo_for_a_stim_comedown_tips/ffhyj44/", "is_submitter": false, "created": 1579988142.0, "body": "Yea I suppose if you don't already have a 1ml syringe, propelyne glycol and a 0.001 scale already then buying powder isn't the best route. But the price is so nice when buying 1g+ etiz powder.", "replies": {"ffi2hh3": {"score": 1, "link": "/r/researchchemicals/comments/etk1dc/first_time_using_a_benzo_for_a_stim_comedown_tips/ffi2hh3/", "is_submitter": true, "created": 1579991948.0, "body": "I have everything there except propylene glycol. A while ago I made a distilled water solution for DOC. I didn't want to get powder unless I knew I liked it", "replies": {}}}}, "ffhyono": {"score": 1, "link": "/r/researchchemicals/comments/etk1dc/first_time_using_a_benzo_for_a_stim_comedown_tips/ffhyono/", "is_submitter": false, "created": 1579988303.0, "body": "2fa and 2fma is hard to come by these days in the US. And I'm not going to even attempt an order from NL. I mean China is decent because the sheer volume of packs from china to US means better odds. And 2fma 2fa is likely banned in China... or is it?", "replies": {"ffi2cb9": {"score": 2, "link": "/r/researchchemicals/comments/etk1dc/first_time_using_a_benzo_for_a_stim_comedown_tips/ffi2cb9/", "is_submitter": true, "created": 1579991824.0, "body": "I gamble on the NL and it pays off, never have a problem as long as it's untracked. I would assume it's banned in China though", "replies": {}}}}}}}}}}}}}}, "hnaeki": {"text": "What if someone took 150mg of gabapentin with 1.5 alprazolam and 10mg hydrocodone and got cold sweats went pale abd almost passed out an drank 2 beers", "author": "Mulisha66", "score": 0, "flair": null, "created": 1594210991.0, "url": "https://www.reddit.com/r/researchchemicals/comments/hnaeki/what_if/", "num_comments": 8, "title": "What if?", "subreddit": "researchchemicals", "comments": {"fxa71ho": {"score": 21, "link": "/r/researchchemicals/comments/hnaeki/what_if/fxa71ho/", "is_submitter": false, "created": 1594212735.0, "body": "Post this shit elsewhere. Dumb fucking shit", "replies": {}}, "fxa4zas": {"score": 13, "link": "/r/researchchemicals/comments/hnaeki/what_if/fxa4zas/", "is_submitter": false, "created": 1594211222.0, "body": "It means the alcohol/opioid/benzo cocktail did what it usually does and all three compounds potentiated each other leading into a mild overdose, based on symptoms", "replies": {}}, "fxa87uq": {"score": 10, "link": "/r/researchchemicals/comments/hnaeki/what_if/fxa87uq/", "is_submitter": false, "created": 1594213628.0, "body": "What if you didn’t post this on r/researchchemicals. r/Drugs is a perfect place for asking dumb shit like “is this the outcome of combining 4 different depressants?”.", "replies": {"fxb3d7v": {"score": 5, "link": "/r/researchchemicals/comments/hnaeki/what_if/fxb3d7v/", "is_submitter": false, "created": 1594241383.0, "body": "None of which are even rcs lol", "replies": {"fxbu5f5": {"score": 1, "link": "/r/researchchemicals/comments/hnaeki/what_if/fxbu5f5/", "is_submitter": false, "created": 1594255407.0, "body": "Yeah exactly", "replies": {}}}}}}, "fxacagv": {"score": 3, "link": "/r/researchchemicals/comments/hnaeki/what_if/fxacagv/", "is_submitter": false, "created": 1594216877.0, "body": "More like r/blackoutboyz", "replies": {"fxcflie": {"score": 1, "link": "/r/researchchemicals/comments/hnaeki/what_if/fxcflie/", "is_submitter": true, "created": 1594265379.0, "body": "Ehh there was no blackout it was crystal clear theyve taken more than that before but they never went through that", "replies": {}}, "fxcfqmu": {"score": 1, "link": "/r/researchchemicals/comments/hnaeki/what_if/fxcfqmu/", "is_submitter": true, "created": 1594265446.0, "body": "Ears were ringing sweating bullets and very dizzy all lasted about 5 to 8 min then went away no problems just curious wth that was all about", "replies": {}}}}}}, "ipblya": {"text": "Took the clam spaced out about a hour apart then took 70mg of hydro after my clam timer went off. Is this gonna potentate my hydrocodone?\n\nEdit : I take about 5-600ug of clam a day for tolerance Info\n\nEdit :2 if this was any other combo I would have gotten legit help total r/drugs response:/\n\nEdit : 3 I have a decent tolerance . I basically just chilled I’m on a road trip so I just relaxed nodded out cuddled in a blanket and hit my cart. No death", "author": "State-Expensive", "score": 0, "flair": null, "created": 1599666140.0, "url": "https://www.reddit.com/r/researchchemicals/comments/ipblya/clonazolam_500ug_70mg_of_hydro/", "num_comments": 7, "title": "Clonazolam 500ug 70mg of hydro", "subreddit": "researchchemicals", "comments": {"g4j1d04": {"score": 7, "link": "/r/researchchemicals/comments/ipblya/clonazolam_500ug_70mg_of_hydro/g4j1d04/", "is_submitter": false, "created": 1599667986.0, "body": "Benzo’s + opiates = death", "replies": {"g4j73he": {"score": 1, "link": "/r/researchchemicals/comments/ipblya/clonazolam_500ug_70mg_of_hydro/g4j73he/", "is_submitter": false, "created": 1599674779.0, "body": "Yes, benzos and opioids unconsciously slow down breathing to the point the body isn’t getting enough oxygen, leading to the user passing out and sometimes dying due to lack of oxygen to the brain.\n\nMany who overdose on opioids do so combining with benzos or other depressants.\n\nThis is a serious dangerous combo OP, i really would suggest never combining the two.", "replies": {"g4jkazx": {"score": -2, "link": "/r/researchchemicals/comments/ipblya/clonazolam_500ug_70mg_of_hydro/g4jkazx/", "is_submitter": true, "created": 1599686081.0, "body": "I know I was asking for help not more rhetoric even if it’s well meaning. I had a chill time I’m on a road trip so I just kinda cuddled up w a blanket hit my cart and chilled out till sunrise.", "replies": {"g4kpulq": {"score": 2, "link": "/r/researchchemicals/comments/ipblya/clonazolam_500ug_70mg_of_hydro/g4kpulq/", "is_submitter": false, "created": 1599707562.0, "body": "Yeah you are fine this time. But not every time. Opiate overdoses are actually incredibly rare outside of relapses, combos, and fent presses. Don't fucking mix.", "replies": {}}}}}}, "g4jk7pc": {"score": -3, "link": "/r/researchchemicals/comments/ipblya/clonazolam_500ug_70mg_of_hydro/g4jk7pc/", "is_submitter": true, "created": 1599686023.0, "body": "Lol I’m alive I’m on a road trip I just nodded chilled and hot my dab cart", "replies": {}}}}, "g4jjfbd": {"score": 3, "link": "/r/researchchemicals/comments/ipblya/clonazolam_500ug_70mg_of_hydro/g4jjfbd/", "is_submitter": false, "created": 1599685516.0, "body": "I wouldn't dose this high on either.", "replies": {"g4jk5ra": {"score": 0, "link": "/r/researchchemicals/comments/ipblya/clonazolam_500ug_70mg_of_hydro/g4jk5ra/", "is_submitter": true, "created": 1599685987.0, "body": "I ended up chilling I’m on a road trip just kinda nodded till day light hit the dab pen and chilled", "replies": {}}}}}}, "j8c96r": {"text": "What’s the highest dose I can safely take and what does it compare to? (I’ve never tried tramadol, only kratom and hydrocodone.)", "author": "madfrombrad", "score": 3, "flair": null, "created": 1602324482.0, "url": "https://www.reddit.com/r/researchchemicals/comments/j8c96r/whats_a_high_dose_of_odsmt_like/", "num_comments": 6, "title": "What’s a high dose of ODSMT like?", "subreddit": "researchchemicals", "comments": {"g8atqu9": {"score": 3, "link": "/r/researchchemicals/comments/j8c96r/whats_a_high_dose_of_odsmt_like/g8atqu9/", "is_submitter": false, "created": 1602349806.0, "body": "I have done doses in the range of 40-80mg orally and they have all been fine for the most part. Just remember to stay hydrated or you can get some nausea. Combined with weed and I get into some of the most relaxing and blissful nods.", "replies": {}}, "g8akngh": {"score": 2, "link": "/r/researchchemicals/comments/j8c96r/whats_a_high_dose_of_odsmt_like/g8akngh/", "is_submitter": false, "created": 1602340081.0, "body": "Like taking codien and mixing it with Adrenalin. Not the best feeling to do high doses of this one", "replies": {}}, "g8dd19n": {"score": 2, "link": "/r/researchchemicals/comments/j8c96r/whats_a_high_dose_of_odsmt_like/g8dd19n/", "is_submitter": false, "created": 1602392557.0, "body": "o-DSMT is pretty good but unless your plugging it your gonna waste quite a bit due to the oral bioavailability. Its not really compareable to tramadol because it lacks the SNRI action of tramadol, but its also not as sedating as hydrocodone. When plugging the doses are about as strong as plugged morphine with a bit more stimulation i'd say.", "replies": {"g8juu5t": {"score": 1, "link": "/r/researchchemicals/comments/j8c96r/whats_a_high_dose_of_odsmt_like/g8juu5t/", "is_submitter": true, "created": 1602495874.0, "body": "How do you actually uh... plug it? Asking for a friend", "replies": {"g8uc10k": {"score": 1, "link": "/r/researchchemicals/comments/j8c96r/whats_a_high_dose_of_odsmt_like/g8uc10k/", "is_submitter": false, "created": 1602743362.0, "body": "I use between 150mg and 200mg boofed/plugged and I’d say I have a medium opioid tolerance - I use opioids twice a week with always a minimum of a 3 day break between use days. It’s really a great abs relatively safe opioid unless you’re combining it with other downers (like benzos and/or alcohol). \n\nFor everything “your friend” ever wanted to know about boofinf/plugging but was afraid to ask - https://www.reddit.com/user/WeirdOneTwoThree/comments/98o55b/guide_to_per_rectal_administration_of_opiates/", "replies": {}}}}}}}}, "goq25p": {"text": "So recently I’ve had the pleasure to experiment with both these chemicals and would like to give my opinion on how they compare.\n\nI’m opiate naive. I’ve never really had any interest in any types of opiates before hand as I found them very lackluster and not worth it for the rep they have. However as I grow older it’s nice to have a chemical that doesn’t change your mind state as psychedelics or weed can do. \n\n*ODSMT* was very warm and cozy with a little amount of itch compared to 2MAP237. It lasted about 3-5 hours longer. And I noticed it was less nauseating which I enjoyed because the nausea you get from opiates is pretty unpleasant. \nDoses 20mg-40mg were my go to for the first couple of uses. But after 2-3 doses in between a  week I noticed I needed to increase my dosage to 40-60mg to feel the same effect. \nI went up to 80-90mg and the nausea was pretty unpleasant unless I laid down in my bed which it would quickly subside and I would feel amazing laying under my covers. If I decided to walk around or even play video games the nausea would come back. I noticed the itch kind of felt better than 2MAP.\n\n*2-METHYL-AP237* is more potent than ODSMT. I started with 10mg which felt really nice and enjoyed it more than a dose of ODSMT. However as my doses increased I noticed the side effects were kind of annoying. You really need to eat something and top it off with ice cream or milk so you don’t get any stomach discomfort. I would not enjoy the nausea I felt it more in my gut with this one. I went up to 30-60mg on this one and the itchy ness was more annoying than ODSMT’s. This high however reminded me of trying hydrocodone for my first time. \n\nOverall these are good chemicals if you like opiates then I’m sure you will enjoy these. Just stay safe and avoid abuse with these RESEARCH chemicals.", "author": "stroC56dyR", "score": 10, "flair": null, "created": 1590204591.0, "url": "https://www.reddit.com/r/researchchemicals/comments/goq25p/2methylap237_vs_odsmt/", "num_comments": 3, "title": "2-METHYL-AP237 vs ODSMT", "subreddit": "researchchemicals", "comments": {"frhc4oi": {"score": 5, "link": "/r/researchchemicals/comments/goq25p/2methylap237_vs_odsmt/frhc4oi/", "is_submitter": false, "created": 1590206037.0, "body": "ODSMT may be worse/weaker when it comes to the effect these substances provide, but ODSMT is way safer physically. 2MAP is known to be caustic, I've read enough stories of people coughing blood, burning away their nostrils or experience very severe stomach discomfort to the point where they have to vomit Everytime they drink or eat and thus have to go the hospital.\nI myself have gotten a 3 week long severe Bronchitis from smoking a good amount in one session. The stuff is dangerous and shouldn't be consumed if better options are available. Please stay safe, it is probably rather safe to try that stuff out in low doses but due to the addictive nature and shortlasting effects of 2MAP one may be inclined to use more in less time, leading to health problems. It is not worth it and I wouldn't recommend it to anyone at all.", "replies": {}}, "frhbk2d": {"score": 3, "link": "/r/researchchemicals/comments/goq25p/2methylap237_vs_odsmt/frhbk2d/", "is_submitter": false, "created": 1590205746.0, "body": "Good report. Hope you won't get addicted to opiates", "replies": {}}}}, "el7zfp": {"text": "T:0:00: 50mg clomethiazole HCL put into a capsule and swallowed.\n\nT:0:30: my nose feels very runny, but I am sick so this may be why. I also notice a definite change in headspace. It feels like I’ve just taken maybe 50mg butalbital or 5-10mg ambien. Very subtle, but noticeable. It almost feels like 100mg dxm. I will update in the next hour, as I just took another 50mg.\n\nT:1:00: took another 50mg capsule. No difference really noticeable from the last dose.\n\nT:1:30: another 50mg, still not much effect.\n\nT:2:00: another 100mg, with little effect. However, Nose does feel irritated and is very runny.\n\nT:3:00: same effects, I take 130mg more. I took 10mg loratadine as well an hour ago, this seems to help some strange mild side effects like the feeling of pressure in face, and nose:\n\nT:3:30: take 50mg more. Starting to notice some muscle relaxation and euphoria. Maybe the adequate dose of what I have is 400mg or so\n\nNext day. I am reflecting on last nights experience, it was very lackluster, and the effects were very weak. I believe the drug wears off quickly and needs about 300mg to cause an effect, and the fact I was taking it so spaced out made it so that by the time the larger doses were taken, I was no longer feeling the previous doses. \n\nTonight, about 40 minutes ago I took 360mg, and am feeling like I just took .5mg clonazepam. (I should note I took an antacid tablet about 10 minute after taking the 360mg, as it felt as if I just took 2 shots of some strong liquor, and my stomach was burning like a cross between alcohol and heartburn. I wonder if the antacid made me absorb more of the clomethiazole, as I felt the effects about 20 minutes later.) I do feel sedation and it is quite nice. It’s like a half and half mix between a barb and a benzo, quite pleasurable, also, my nose is not very irritated tonight and it is feeling just fine. I will take another 100mg in a minute and report back. At the end of writing this I took another 100mg at T:0:50:\n\nT:1:30: another 192mg taken.  Total 652mg\n\nT:2:15: another 150mg taken, total 802mg. I am feeling slightly drunk, like I took .75mg Xanax and maybe smoked a tiny bit of weed. Or took that with 5mg hydrocodone almost.\n\nT:2:45: took another 110mg. Feeling significantly more intoxicated. Balance is fucked. But I am still not super messed up, I could handle maybe another 300mg, but I will tread lightly, and take it slow until tomorrow. Tomorrow I will try dosing 700mg right away, maybe. (I read someone saying doses were like phenibut doses, like 1-2 grams, but I don’t know if that much would be safe yet.)\n\nT:3:15: another 125mg. The effects have seem to plateau at how I felt at 650mg or so. Now it is just being sustained by each dose.\n\nT:340: another 157mg. Effects still plateaued.\n\nT:4:30: another 200mg taken. Effects slightly above how they felt at 650mg. I believe I can handle about twice this. I am not particularly sedated, my breathing is the same. I just feel very calm and my motor skills are disrupted. My perception of time is slightly shrunk. Meaning that 30 minutes feels more like 20 to me. I notice it’s been 4 hours since I first dosed but feels like 3.\n\nRETROSPECTION: Next day, today, January 8th. DAMNNN that stuff is pretty nice. After that last  200mg I was pretty high and I can say that at a total of 1400mg, over 5 hours or so felt very nice and pretty strong. I would guess that it would be much too high of a dose to take that all at once. I feel that one single dose of clomethiazole, lasts about 3 hours or so in terms of duration of action. Now I have only taken two drugs that work at barbiturate sites, butalbital (in fiorcet) and carisoprodol (soma). I took butalbital one time, and soma twice, years ago. I can say that I feel some effects of butalbital in this (the fucked up, sort of blurry vision and movement feeling) but the drug that is closest is SOMA. Soma I find is the most comparable to clomethiazole, and most of its effects were witnessed in clomethiazole. Here’s some of the things I felt \n\n-motor discoordination\n-sedation (not as strong as say, ambien or doxylamine though)\n- anxiolysis (it was able to combat the existential crisis anxiety I get when I smoke weed, it eliminated my fear of my eventual and inevitable death) \nI will write more soon", "author": "Lilziggy098", "score": 7, "flair": null, "created": 1578409199.0, "url": "https://www.reddit.com/r/researchchemicals/comments/el7zfp/clomethiazole_hydrochloride/", "num_comments": 1, "title": "Clomethiazole Hydrochloride", "subreddit": "researchchemicals", "comments": {"fdhiqjr": {"score": 2, "link": "/r/researchchemicals/comments/el7zfp/clomethiazole_hydrochloride/fdhiqjr/", "is_submitter": false, "created": 1578452300.0, "body": "Happy to see someone else here has experimented with this substance. I’ll share my experience as well, but it was rather lacklustre like you’ve described yours.\n\nT-0:00: I’ve scaled out 200mg and put it in a gelatin capsule, and taken it on an empty stomach.\n\nT-0:10: Starred to feel my nose tingle already, not sure if this is just nocebo (opposite of placebo).\n\nT-0:20: Nose burning is very much evident now, to a point of discomfort, and I’m not sick. I’m also feeling a “warm” feeling in my stomach, this was slightly pleasurable. To help with my nose burning, I drank some peppermint tea.\n\nT-0:40: Nose burning has slightly subsided, and now I’m feeling somewhat relaxed.\n\nT-1:00: Feeling nice and relaxed now, but it isn’t too powerful to the point of feeling disinhibition or sedation. It’s just a relaxing feeling.\n\nT-2:00: Effects have completely gone away, the remnants of the nose burning has completely disappeared. Feeling as though I hadn’t even dosed. No urge to redose.\n\nT-10:00: I fell asleep pretty quickly after typing up my final thoughts, but when I awoke I felt very nauseous. I ran to my washroom and puked. The problem is that, I puked a large amount of blood. This obviously was concerning, so I paid a visit to my doctor and explained that I had taken the HCl salt form of Clomethiazole. He just had a look down my throat and saw that it was completely raw, seemed as though the acid from throwing up had burned my esophagus and caused micro tears from any food coming up. My doctor said it was nothing to be concerned about, although recommended that I stay away from future use of the substance.\n\nConclusion: Overall, my experience with Clomethiazole wasn’t special enough to even make me want to redose. The euphoria and sedation was mild (although I had only taken 200mg), and the half-life seemed to short to be a desirable substance. Since then, I haven’t felt the urge to take another dose and have just stocked with benzos. Benzos offer a more powerful effect without any fear of acidity. I’m aware that my experience with the throwing up blood is unique, but should be noted for anyone with a sensitive stomach like myself. \n\nEnsure that if you wish to consume this drug, that you have proper safety equipment to handle the substance, as it’s incredibly acidic. I would recommend the substance for anyone looking for a “sub-par” benzodiazepine experience.", "replies": {}}}}, "i2bmff": {"text": "I was curious it compares to? Hydrocodone more or less? mine was kind of weak and almost gone afterwards in a couple days.  I was taking 30-50mg on dosage.\n\n&#x200B;\n\nIs there something as safe but stronger?\n\nThanks,", "author": "rockbud", "score": 5, "flair": null, "created": 1596401807.0, "url": "https://www.reddit.com/r/researchchemicals/comments/i2bmff/ap_238_compare_to_what/", "num_comments": 1, "title": "AP 238 compare to what?", "subreddit": "researchchemicals", "comments": {"g06oi69": {"score": 1, "link": "/r/researchchemicals/comments/i2bmff/ap_238_compare_to_what/g06oi69/", "is_submitter": false, "created": 1596466896.0, "body": "Also interested", "replies": {}}}}}